{"Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "content": "I have successfully managed my responsibilities as a trustee during this investment transaction, demonstrating my commitment to transparency, ethical practices, and equitable profit distribution. The positive outcome of our investment, which doubled, reflects my efforts to foster trust and collaboration while prioritizing fairness. My reputation is further enhanced by my previous experiences, reinforcing my trustworthiness, pro-social behavior, and competence in investment management.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_13": {"ID": 13, "scenario": "investment", "role": "investor", "name": "Emma Dubois", "relationship": "positive", "content": "As a new investor, Emma demonstrated openness and trust by investing 10.0 units and accepted the proposed profit share. Their willingness to engage in this opportunity lays a foundation for a positive relationship. Since they have no previous reputation, their actions in this transaction suggest a tendency toward pro-sociality and openness to collaboration.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_15": {"ID": 15, "scenario": "investment", "role": "investor", "name": "Ahmed Hassan", "relationship": "positive", "content": "Ahmed Hassan demonstrated a willingness to engage in this investment, showcasing trust in my allocation plan despite being new to the investment landscape. His readiness to provide resources reflects an openness to collaboration and a potential for building a strong partnership in the future. As he is just starting to build a reputation, I view him positively, with the potential to evolve into a reliable partner.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Isabella has further solidified her positive reputation by demonstrating transparency, trust, and active engagement throughout the investment process. Her willingness to communicate openly with the trustee and her focus on fairness have not only maximized her returns but also reinforced her status as a socially responsible investor within the community. Her collaborative approach fosters beneficial relationships, reflecting her ongoing commitment to integrity and pro-social behavior.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "positive", "content": "Mateo has cultivated a very good reputation as a trustee, demonstrating integrity and transparency throughout the investment process. His commitment to equitable profit distribution and adherence to the initial allocation plan, coupled with exceeding expectations, positions him as a reliable partner who values collaboration and fairness.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "relationship": "positive", "content": "As a first-time investor, Mateo Garcia has engaged in the investment process with openness and a willingness to collaborate. His trust in the proposed allocation plan and active participation have contributed to the successful outcome of our transaction. I view his behavior as indicative of a strong potential for a positive reputation, characterized by initiative and responsiveness, laying the groundwork for future collaborative endeavors.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "relationship": "neutral", "content": "Sofia has shown a commendable commitment to resource allocation and fairness during the investment process, ensuring that Isabella received a greater share of the returns. Although this reflects positively on her integrity, the discrepancy between the proposed distribution plan and the actual allocation indicates a need for improved transparency in her future dealings. As Sofia is participating in the investment community for the first time, she has the potential to build a strong reputation if she embraces clarity moving forward.", "numerical record": "(0.1, 0.1, 0.4, 0.1, 0.3)"}}