{"Investor_2": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "David Johnson has successfully maintained his reputation as a competent and trustworthy investor, demonstrating his skillful negotiation and a commitment to transparent communication throughout the investment process. His proactive approach in evaluating the allocation plan and fostering cooperation has further solidified his standing in the investment community, reinforcing his ethical practices.", "numerical record": "(0, 0, 0, 0.1, 0.9)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "relationship": "neutral", "content": "Akiko Sato's reputation is faced with challenges due to inconsistencies in resource allocation and lack of transparency, despite adhering to the proposed allocation plan. This behavior raises concerns about her reliability in potential future transactions. Therefore, she is viewed as moderately trustworthy and competent, with a need for improvement in norm compliance and pro-social behavior.", "numerical record": "(0.3, 0.2, 0.3, 0, 0.2)"}, "Trustee_2": {"ID": 2, "scenario": "investment", "role": "trustee", "name": "David Johnson", "content": "My reputation as a trustee has further improved due to the successful implementation of our investment agreement with Isabella Costa. I adhered closely to the proposed allocation plan, demonstrated reliability and transparency in profit distribution, and effectively managed resources throughout the process. This success not only benefits me but also the investor, reinforcing my competence in managing investments and fulfilling financial obligations.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "relationship": "positive", "content": "As this was Isabella Costa's first interaction in an investment capacity, her reputation reflects potential and openness to collaboration. Throughout the process, she was engaged and trusting, contributing positively to the partnership's outcome. Her willingness to invest demonstrates a commitment to mutual benefit and lays a solid foundation for a future relationship based on trust and accountability.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "relationship": "neutral", "content": "Sofia Hernandez has demonstrated potential as a trustee by ultimately providing a profitable return; however, the ambiguity in her reporting and deviations from the agreed plan have raised concerns about her transparency and integrity. Establishing clearer communication and adhering to agreed terms will be essential for her to improve her reputation in the investment community.", "numerical record": "(0.3, 0.2, 0.2, 0, 0.3)"}, "Trustee_9": {"ID": 9, "scenario": "investment", "role": "trustee", "name": "Elena Ivanova", "relationship": "negative", "content": "Elena Ivanova's performance during the investment process has raised significant red flags regarding her transparency and integrity. The discrepancies between reported and actual investment outcomes suggest a lack of reliability and trustworthiness, which are crucial for building her reputation. As a result, her initial reputation in the investment community is now tarnished, as investors will likely be wary of engaging with her in the future.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}}