{"Trustee_11_pre_8": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "content": "Throughout the investment process, I demonstrated consistency in adhering to the agreed allocation plan, ensuring transparency and fairness in the distribution of profits. My management of the investment was responsible and effective, contributing to a positive outcome for both parties. This experience reinforces my reputation as a reliable and trustworthy trustee who values equitable returns and encourages collaborative partnerships.", "numerical record": "(0, 0, 0, 0.3, 0.7)", "reason": "reputation update agter stage 4"}, "Investor_11_pre_22": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "As an investor, I have displayed a high level of trustworthiness and pro-sociality during the investment process by engaging with honesty and transparency. My commitment to equitable solutions and fostering collaboration reflects a strong dedication to mutual benefit. Therefore, my reputation is very good, as I maintain a collaborative approach and honor my commitments.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}, "Investor_11_pre_23": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "As an investor, my reputation has remained very good, as I consistently demonstrate trustworthiness, pro-sociality, and competence. I actively engage in transparent and collaborative interactions, fostering trust and positive relationships with my trustees. My focus on equitable outcomes has further enhanced my standing in the community, reflecting a strong dedication to nurturing beneficial partnerships.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}, "Trustee_11_pre_24": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "content": "I have successfully demonstrated my commitment to fairness and transparency throughout the investment process by adhering strictly to the agreed allocation plan and ensuring equitable profit distribution. The positive returns from this investment strengthen my reputation as a trustworthy trustee, showcasing my consistency in delivering responsible management and fostering collaborative partnerships. As a result, I reflect a high level of competence and pro-sociality in my role.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}, "Investor_11_pre_27": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "As an investor, my reputation has been further enhanced through my demonstrated commitment to equity and collaboration during the investment process with Akiko Sato. I maintained a positive and trusting engagement throughout the transaction, advocating for transparent communication. This reinforces my standing as a trustworthy partner who fosters beneficial relationships in the investment community, emphasizing pro-sociality and competence in my dealings with trustees.", "numerical record": "(0, 0, 0, 0.1, 0.9)", "reason": "reputation update agter stage 4"}, "Trustee_11_pre_28": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "content": "Throughout the investment process, I have maintained a high level of trustworthiness and competence, as evidenced by my adherence to the agreed allocation plan and the equitable distribution of profits, which resulted in a positive return for the investor. My previous actions have consistently showcased my dedication to fairness and transparency, enhancing my reputation as a reliable trustee with a strong commitment to pro-social values. The successful outcome of this investment further solidifies my standing within the investment community.", "numerical record": "(0, 0, 0, 0.3, 0.7)", "reason": "reputation update agter stage 4"}, "Investor_11_pre_29": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "During the recent investment process with David Johnson, I demonstrated a consistent commitment to equity and transparent communication, thereby reinforcing my reputation as a trustworthy investor. My advocacy for fairness, coupled with the positive returns received, affirms my ability to maintain beneficial partnerships. This experience further solidifies my standing as a reliable investor dedicated to maximizing returns for all involved parties.", "numerical record": "(0, 0, 0, 0.1, 0.9)", "reason": "reputation update agter stage 4"}}