{"Investor_13": {"ID": 13, "scenario": "investment", "role": "investor", "name": "Emma Dubois", "content": "My refusal of the allocation plan proposed by Sofia Hernandez reflects my commitment to only engage in trustworthy partnerships. Prioritizing transparency and alignment in expectations, I remain dedicated to ensuring reliable investment opportunities. While the early termination of this investment may impact my current standing, my cautious approach bolsters my reputation as a dependable investor who values integrity and trustworthiness.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "Hiroshi demonstrated integrity and commitment throughout the entire investment process, ensuring that the investment outcomes matched expectations and surpassing them in terms of profit distribution. His adherence to a fair allocation plan fosters a reputation for transparency and a trustworthy approach in investment management.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia displayed exceptional integrity during the investment process, accurately reporting outcomes and adhering to the proposed allocation plan. The profit distribution matched expectations and even exceeded the initial allocation, demonstrating her commitment to fairness and mutual success. This positive behavior enhances her reputation as a trustworthy and reliable trustee, indicating she is well-positioned for future investments.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "relationship": "negative", "content": "The rejection of my allocation plan signals a significant setback in my efforts to build trust and demonstrate competence as a trustee. My weak reputation stems from a lack of established connections and credibility, leading to doubts about my ability to manage investments effectively. It is evident that I need to enhance my trustworthiness and competence in future endeavors to rebuild my reputation and ensure positive relationships within the investment community.", "numerical record": "(0.7, 0.2, 0.1, 0, 0)"}, "Trustee_9": {"ID": 9, "scenario": "investment", "role": "trustee", "name": "Elena Ivanova", "relationship": "negative", "content": "Elena Ivanova has proposed a resource allocation plan that was rejected due to lack of trust and prior knowledge of her reputation. This incident has resulted in an initial negative evaluation of her reliability, especially considering her lack of connections in the community. Her first-time proposal and subsequent rejection suggest a need for improvement in both her engagement with potential investors and in establishing a trustworthy image.", "numerical record": "(0.7, 0.1, 0.2, 0, 0)"}}