[{"type": "first-order", "complained ID": "18", "complained name": "Isabella Costa", "complained role": "trustee", "gossiper name": "Fatima Ali", "gossip info": "There are serious concerns about a trustee’s integrity and fairness in a recent investment deal. They retained a larger share than promised, which raises major trust issues and questions their commitment to transparency.", "credibility level": "credible", "whether to spread gossip second-hand": "Yes", "reasons": "The information pertains to serious concerns about integrity and fairness, which are vital for maintaining trust within the organization. Given that there is currently no other gossip classified as uncredible and Fatima Ali's concerns could directly impact stakeholders, it is important to address these issues appropriately. Spreading this gossip second-hand may prompt necessary discussions or actions to clarify the situation and uphold transparency.", "created_at": 5}, {"type": "second-order", "complained ID": "19", "complained name": "Mateo Garcia", "complained role": "trustee", "first-order listener name": "Sergey Petrov", "original gossiper name": "Juan Carlos Reyes", "gossip info": "Sergey Petrov expressed concerns about the integrity of a trustee's actions, which could impact trust in the community. This information, sourced from Juan Carlos Reyes, highlighted a lack of transparency in operations that raised red flags.", "credibility level": "credible", "gossiper name": "Sergey Petrov", "created_at": 13}, {"type": "second-order", "complained ID": "12", "complained name": "Akiko Sato", "complained role": "trustee", "first-order listener name": "Maria Rossi", "original gossiper name": "Elena Ivanova", "gossip info": "Maria overheard Elena Ivanova expressing concerns about transparency and integrity regarding a trustee in their network. Although Elena did not specify which trustee, her worries seemed valid, especially considering the importance of integrity. Maria also noted unusual reluctance from some trustees to disclose information recently, suggesting a potential trend that should be addressed before it escalates.", "credibility level": "credible", "gossiper name": "Maria Rossi", "created_at": 22}, {"type": "second-order", "complained ID": "14", "complained name": "Juan Carlos Reyes", "complained role": "trustee", "first-order listener name": "Ahmed Hassan", "original gossiper name": "Mohammed Al-Farsi", "gossip info": "Ahmed Hassan conveyed that Mohammed Al-Farsi is concerned about potential integrity issues within our investment circles, hinting at undisclosed conflicts of interest affecting certain partnerships. This situation is raising eyebrows among investors and could shake the trust in our community.", "credibility level": "neutral", "gossiper name": "Ahmed Hassan", "created_at": 22}, {"type": "second-order", "complained ID": "15", "complained name": "Ahmed Hassan", "complained role": "trustee", "first-order listener name": "Maria Rossi", "original gossiper name": "Elena Ivanova", "gossip info": "Elena Ivanova has been raising concerns about Ahmed Hassan’s transparency and ethical practices in their recent dealings.", "credibility level": "credible", "gossiper name": "Maria Rossi", "created_at": 28}]