{"Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "content": "Following the recent failed investment due to a lack of an allocation plan proposed by the trustee and the potential for blacklisting between us, I am left feeling skeptical about future partnerships. This situation emphasizes my commitment to thorough vetting processes and necessitates a more cautious approach in my investment activities. I aim to engage only with reliable participants in the investment community to safeguard my resources and enhance my reputation.", "numerical record": "(0.4, 0.3, 0.2, 0.1, 0)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "negative", "content": "The absence of a viable allocation plan and the possibility of being on each other's blacklist severely harm my reputation as a trustee. This incident underscores the lack of trustworthiness and competence, which are critical in investment scenarios. The lack of bidirectional connections within the community further reflects my inability to foster pro-social behaviors, ultimately compromising my overall reputation.", "numerical record": "(0.6, 0.2, 0.1, 0.1, 0)"}, "Trustee_9": {"ID": 9, "scenario": "investment", "role": "trustee", "name": "Elena Ivanova", "content": "Elena Ivanova proposed a 70/30 profit allocation plan but was rejected by an investor due to lack of established reputation, impacting her perceived trustworthiness and competence. She has no successful acceptance records, pointing to a challenge in her professional reliability.", "numerical record": "(0.6, 0.2, 0.1, 0.1, 0)"}, "Investor_0": {"ID": 0, "scenario": "investment", "role": "investor", "name": "Liam OConnor", "relationship": "negative", "content": "Liam OConnor rejected the allocation plan due to concerns over the trustee's lack of an established reputation. His limited experience in connections reinforces his cautious approach to investments, resulting in a lower reputation in trusting new trustees.", "numerical record": "(0.5, 0.3, 0.1, 0.1, 0)"}}