[{"id": 1, "type": "EVENT", "subject": "Isabella Costa", "predicate": "investment", "object": "Sergey Petrov", "description": "Success investment: investor is Isabella Costa, trustee is Sergey Petrov\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '8.0', 'investor': '12.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 1}, {"id": 2, "type": "EVENT", "subject": "Isabella Costa", "predicate": "investment", "object": "Aisha Ibrahim", "description": "Success investment: investor is Isabella Costa, trustee is Aisha Ibrahim\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 12.0 units\nstage 3: trustee_allocation is {'trustee': '7.2', 'investor': '16.8', 'reported_investment_outcome': 'The current resource after investment is 24.0 units.'}, and reported_investment_outcome is The current resource after investment is 24.0 units.", "created_at": 2}, {"id": 3, "type": "EVENT", "subject": "Isabella Costa", "predicate": "investment", "object": "Emma Dubois", "description": "Success investment: investor is Isabella Costa, trustee is Emma Dubois\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 16.8 units\nstage 3: trustee_allocation is {'trustee': '10.08', 'investor': '23.52', 'reported_investment_outcome': 'The current resource after investment is 33.6 units.'}, and reported_investment_outcome is The current resource after investment is 33.6 units.", "created_at": 3}, {"id": 4, "type": "CHAT", "subject": "Sergey Petrov", "predicate": "gossip", "object": "Isabella Costa", "description": "the actual allocation result of 18.0 units is significantly less than the promised 70% allocation from the proposed plan, indicating a lack of honesty in the trustee's performance.", "conversation": "Sergey Petrov: I’ve got some gossip for you: the actual allocation result was only 18.0 units instead of the promised 70%! It really highlights the trustee's dishonesty. \n\nIsabella Costa: That's shocking! I believe transparency and honesty are vital in investment. How could they mislead everyone like that?\n\nSergey Petrov: Exactly. It’s a clear indicator of their lack of integrity. People should be held accountable for false promises.\n\nIsabella Costa: I totally agree! We need more trustworthy individuals in positions like that. It impacts everyone’s investments.\n\nSergey Petrov: Right? It's frustrating to see such self-serving behavior undermine the whole system. \n\nIsabella Costa: It is! We should advocate for fair practices and encourage more ethical approaches in investing. \n\nSergey Petrov: For sure. I prioritize my gains, but it's essential to have a system where honesty prevails as well.\n\nIsabella Costa: Definitely! We can promote collaboration, ensuring everyone benefits. It’s about balance!\n\nSergey Petrov: Agreed! But until then, I'll keep looking out for my own interests while navigating this mess. \n\nIsabella Costa: And I’ll remain optimistic, hoping that change comes soon!", "created_at": 3}]