{"Investor_4_pre_4": {"ID": 4, "scenario": "investment", "role": "investor", "name": "Sofia Hernandez", "content": "Throughout the investment process, I showcased an astute understanding of the market dynamics and maintained a strategy centered on maximizing returns through calculated risk-taking. My negotiation skills allowed me to secure a favorable profit-sharing agreement, leading to greater profit realization than initially anticipated. This experience has solidified my reputation as a resourceful and results-driven investor, characterized by high competence and pro-social tendencies.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Trustee_4_pre_6": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "content": "My performance in this transaction highlights my commitment to transparency, fairness, and maximizing investor gains. I successfully implemented the proposed allocation plan, demonstrating trustworthiness and competence. My established reputation as a reliable trustee is reinforced through my effective communication and adherence to the profit distribution agreement, showcasing pro-social behavior. Overall, I aim to continue building a strong investment management track record.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_4_pre_8": {"ID": 4, "scenario": "investment", "role": "investor", "name": "Sofia Hernandez", "content": "During this investment process, I have further solidified my reputation as a strategic and results-oriented investor. My adept negotiation skills and proactive approach allowed me to secure a favorable profit-sharing model, demonstrating my competence and commitment to achieving high-value outcomes. I have consistently aimed for maximizing returns while exhibiting trustworthiness and pro-social behavior towards my trustee.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)", "reason": "reputation update agter stage 4"}}