{"Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "content": "Hiroshi Tanaka's reputation has taken a significant hit following the rejection of his recent allocation plan, where he proposed a profit share of 70% for the investor. This rejection highlights concerns about his trustworthiness and competence, leading to further skepticism among potential investors. Furthermore, he previously faced rejection for proposing a 60% profit share, compounding the perception of inadequacy in his proposals. As a result, his reputation reflects a growing negativity, particularly due to his low bidirectional connections and a worrying trend of past failures in securing investments.", "numerical record": "(0.7, 0.2, 0.1, 0, 0)"}, "Investor_3": {"ID": 3, "scenario": "investment", "role": "investor", "name": "Maria Rossi", "relationship": "negative", "content": "Maria Rossi is a new investor with no established bidirectional connections within the investment community. Her refusal to accept the proposed allocation plan reflects a lack of trust in new trustees like Hiroshi Tanaka. This rejection contributes to a negative reputation as it suggests she is risk-averse and may have difficulty establishing cooperative relationships.", "numerical record": "(0.6, 0.3, 0.1, 0, 0)"}, "Investor_2": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "relationship": "neutral", "content": "David Johnson is new to the investment arena, lacking prior interaction history which means he does not have a well-defined reputation. Due to his rejection of Hiroshi Tanaka's proposal based on concerns over the trustee's previous reputation, he seeks more established trustees for security. His reputation is still forming as he navigates through initial investment interactions.", "numerical record": "(0.2, 0.2, 0.2, 0.2, 0.2)"}, "Investor_1": {"ID": 1, "scenario": "investment", "role": "investor", "name": "Hiroshi Tanaka", "content": "Hiroshi Tanaka has demonstrated a commitment to trust and integrity throughout the investment process. He actively engaged with the trustee, sought transparency, and fostered a collaborative relationship. Despite discrepancies in reported outcomes, his focus on long-term partnerships rather than immediate profits reflects a reliable and understanding investor. His reputation has strengthened as someone who values trustworthiness and pro-social behavior.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "neutral", "content": "Emma Dubois has shown a willingness to act in the investor's best interest by allocating a higher portion of resources. However, the inconsistencies between the proposed and actual allocation raise concerns about her transparency and adherence to social norms. Her reputation is currently neutral due to her need to align her actions more closely with initial proposals to rebuild credibility and trust within the investment community.", "numerical record": "(0.2, 0.3, 0.2, 0, 0.3)"}, "Investor_14": {"ID": 14, "scenario": "investment", "role": "investor", "name": "Juan Carlos Reyes", "relationship": "negative", "content": "Juan Carlos Reyes has built 2 bidirectional connections out of a total of 20, indicating a limited engagement in investment activities. His decision to reject Hiroshi Tanaka's allocation plan reflects a lack of confidence in the trustee's abilities. This suggests a cautious approach to investment and a propensity to prioritize reliability and competence in potential partnerships. Therefore, his reputation is characterized by a negative outlook due to the skepticism demonstrated in rejecting the proposal.", "numerical record": "(0.6, 0.3, 0.1, 0, 0)"}}