{"Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "content": "I have shown consistent transparency and effective communication throughout this investment process. My proactive management of expectations has culminated in achieving favorable returns of 45.1584 units, demonstrating my dedication to maximizing investments and fostering positive partnerships. This performance further solidifies my reputation as a reliable and trustworthy investor within the community.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "Hiroshi Tanaka has displayed integrity and fairness throughout this investment process. The final outcome of 64.512 units, with a favorable distribution of profits, exemplifies his commitment to my interests and adherence to the allocation plan. This reliable and supportive behavior merits a positive enhancement to his reputation for investor concern and integrity.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "positive", "content": "Emma Dubois has shown exceptional integrity and fairness, having accurately reported the investment outcome and distributed resources beyond the initial agreement. Her actions reflect a strong commitment to mutual benefit and trustworthiness, enhancing her reputation as a reliable trustee in the investment environment.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia has established a strong initial reputation as an honest and committed trustee. Her transparency and willingness to exceed the promised allocation to 19.2 units demonstrate her integrity and dedication to the investor's interests. This performance not only fulfills but enhances the trustworthiness and pro-sociality aspects of her role, indicating she is likely to foster fruitful relationships in the future.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_5": {"ID": 5, "scenario": "investment", "role": "trustee", "name": "James Wang", "relationship": "neutral", "content": "James Wang exhibited a commitment to prioritizing my interests, as demonstrated by exceeding the initial allocation, although this came at the expense of strict adherence to the original agreement. His behavior indicates good intent, but the lack of clarity in communication regarding the changes may impede trust-building. As a first-time trustee, he has the potential to improve his reputation with better transparency and communication in future investments.", "numerical record": "(0.1, 0.1, 0.2, 0, 0.6)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "content": "Isabella Costa's reputation has been negatively impacted by credible gossip regarding concerns over her integrity and fairness in recent investment practices, which raises questions about her trustworthiness and norm compliance.", "numerical record": "(0.4, 0.2, 0.2, 0.1, 0)"}, "Trustee_10": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "relationship": "positive", "content": "The trustee, Mohammed Al-Farsi, has showcased a strong commitment to fairness and integrity throughout our investment transaction. By adhering to the proposed allocation plan and reporting an accurate investment outcome of 53.76 units, he has displayed honesty, thereby establishing a positive foundation for future collaborations. This behavior enhances his reputation as a trustworthy and competent trustee in the investment community.", "numerical record": "(0, 0, 0, 0, 1)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "content": "Throughout the investment process, I have demonstrated trustworthiness and competence by adhering to the agreed-upon allocation plan and ensuring transparent communication. My behavior reflects integrity and accountability, leading to a fair and timely distribution of profits. This diligence reinforces my reputation as a reliable and ethical trustee, well-regarded in the investment community.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "relationship": "positive", "content": "Although Elena does not have a prior reputation, her clear engagement and collaborative approach throughout this investment process suggest a strong willingness to establish trust. This behavior, combined with an understanding of shared profit mechanisms, lays a solid foundation for her future reputation in the investment community.", "numerical record": "(0, 0, 0, 0, 1)"}}