{"Investor_11": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "Throughout the investment process, I exhibited transparency and a strong commitment to collaboration, which fostered a positive environment for our transaction. I trusted the trustee's proposed allocation plan and engaged positively, despite the allocation exceeding initial expectations. My behavior of nurturing equitable partnerships reflects my strong reputation as a reliable investor. I prioritize trustworthiness, pro-sociality, and norm compliance in my dealings, establishing myself as a solid partner in the investment community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "relationship": "positive", "content": "Isabella demonstrated exceptional commitment to integrity and fairness during the investment period. She effectively matched reported resources with outcomes, ensuring a transparent distribution process that favored my interests. This behavior signifies her reliability and supportive character, thereby enhancing her positive reputation in the investment ecosystem. Her adherence to pro-social values and compliance with social norms establishes her as a trustworthy and competent trustee.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "content": "Throughout this transaction, I have demonstrated a strong commitment to transparency and equitable profit distribution, which reinforces my reputation for reliability. My adherence to the agreed allocation plan and successful delivery of profits underscores my trustworthiness and competence as a trustee. This successful engagement not only affirms my dedication to nurturing trustworthy partnerships but also strengthens my reputation within the investment community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "relationship": "positive", "content": "This was my first interaction with Mateo, who demonstrated prompt engagement and a willingness to adhere to the proposed terms. Their trust in my management reflects positively on their reputation as a reliable investor. The successful receipt of profits and commitment to collaboration bodes well for Mateo's capacity to build future partnerships, suggesting a commendable level of trustworthiness and pro-social behavior.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}}