{"Investor_6": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "My reputation now reflects my assertive approach during the investment process, where I demonstrated strategic decision-making skills and effectively maximized my returns. My previous reputation of being focused on profit accumulation is reinforced by my ability to negotiate advantageous terms and achieve greater outcomes than initially proposed. I am viewed as a competent and dominant investor who prioritizes profit maximization while maintaining honesty.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "relationship": "positive", "content": "Akiko Sato's reputation has significantly improved due to her integrity and commitment to fair dealings throughout the investment process. She prioritized my wealth accumulation and acted transparently, distributing a larger share of profits than initially stated. This aligns well with the qualities of trustworthiness and pro-sociality, enhancing her standing as a reliable trustee in the community.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_6": {"ID": 6, "scenario": "investment", "role": "trustee", "name": "Sergey Petrov", "content": "I successfully executed the investment plan, demonstrating reliability and transparency throughout the process. My ability to secure profits for both myself and my investor underlines my competence and trustworthiness. This positive outcome reinforces my reputation as a dependable trustee who fosters mutual benefit and efficiency in transactions.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Investor_4": {"ID": 4, "scenario": "investment", "role": "investor", "name": "Sofia Hernandez", "relationship": "positive", "content": "Sofia displayed trust and an open mindset by accepting the allocation plan, contributing to a successful investment outcome. Their proactive engagement highlights a strong potential for future collaborations, and their willingness to participate in this venture marks them as a promising partner in the investment landscape.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}}