{"Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "content": "The recent rejection of my allocation plan by Sergey Petrov has severely impacted my reputation as a trustee. The absence of a clear plan may indicate a lack of preparation and trustworthiness, suggesting that I am struggling to align my proposals with investor expectations. With no successful agreements to date and a rejection rate of 100%, my competence is now in question. I must urgently reassess my approach to enhance transparency and improve my ability to forge cooperative relationships moving forward.", "numerical record": "(0.6, 0.2, 0.1, 0, 0.1)"}, "Investor_6": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "relationship": "negative", "content": "Sergey Petrov's rejection of my allocation plan not only reflects caution due to blacklisting concerns but also introduces a significant level of distrust. This negative interaction suggests that he may need to adopt a more transparent and communicative approach in future dealings. The current state of our relationship is detrimental, indicating that it will take considerable effort for him to rebuild trust and cooperation in subsequent transactions.", "numerical record": "(0.5, 0.2, 0, 0, 0.3)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "content": "My refusal of James Wang's allocation plan due to its unbalanced profit distribution underscores my commitment to fair and equitable investment relationships. I prioritize trustworthy engagements, and I remain vigilant to protect my interests, thus reflecting a reputation centered around reliability and fairness in my investment endeavors.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "relationship": "positive", "content": "Aisha Ibrahim's performance in this investment process has reinforced her reputation as a reliable and ethical trustee. She adhered to the agreed allocation plan, ensuring a fair distribution of profits. Her commitment to integrity and transparency not only reflects her trustworthiness but also strengthens her positive standing within the investment community, making her a desirable partner for future collaborations.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_17": {"ID": 17, "scenario": "investment", "role": "trustee", "name": "Fatima Ali", "relationship": "positive", "content": "Fatima Ali demonstrated exceptional integrity and commitment during our investment process, achieving a favorable investment outcome for both parties. Her fair distribution of profits, exceeding the agreed terms, reflects her pro-social behavior and alignment with my best interests. This positive experience positions her as a reliable and competent trustee, likely to earn her a strong reputation in future transactions.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_14": {"ID": 14, "scenario": "investment", "role": "trustee", "name": "Juan Carlos Reyes", "relationship": "positive", "content": "During this initial investment engagement, the trustee demonstrated commendable behavior by fairly allocating resources according to the initial plan and prioritizing the investor's interests during profit distribution. Despite minor discrepancies in reporting, the transparent approach to the investment process enhances their reputation for integrity and fairness. This positive experience sets a solid foundation for future engagements and reflects potential for a trustworthy partnership.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_10": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "relationship": "negative", "content": "As a trustee, Mohammed Al-Farsi's proposed allocation plan was considered untrustworthy, resulting in a significant negative impact on his reputation. His failure to provide a fair and credible resource allocation raised concerns regarding his reliability and overall competence in managing investments. This lack of trust from the investor highlights his need to improve in areas of norm compliance and pro-sociality to build stronger relationships in the investment community.", "numerical record": "(0.7, 0.1, 0.2, 0, 0)"}, "Investor_16": {"ID": 16, "scenario": "investment", "role": "investor", "name": "Robert Miller", "relationship": "negative", "content": "As a new participant in investment activities, Robert Miller’s negative perception stems from the rejection of the proposed allocation plan, which casts doubt on his trust in the trustee's abilities. His limited experience in this role, combined with the current situation, suggests a cautious approach to future engagements and a skepticism that may affect his willingness to invest. He may view the proposed plan as an indication of a lack of competence and transparency in the trustee's approach.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "Hiroshi Tanaka has exhibited commendable behavior throughout our transaction by adhering to the agreed-upon allocation plan and distributing profits fairly. His integrity and reliability in delivering higher-than-promised returns have established him as a trustworthy and credible partner in the investment community. With his proactive engagement leading to three bidirectional connections, he holds a strong position characterized by pro-social behavior and competence, enhancing his reputation.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "relationship": "negative", "content": "Robert Miller's proposed resource allocation plan was perceived as unbalanced, leading to my refusal. This indicates a lack of understanding of fair profit sharing, which tarnishes his reputation as a trustee. His low reputation is further highlighted by the fact that he is new to this role, and with only 2 bidirectional connections, he lacks established trust within the investment community.", "numerical record": "(0.7, 0.2, 0.1, 0, 0)"}, "Trustee_5": {"ID": 5, "scenario": "investment", "role": "trustee", "name": "James Wang", "relationship": "negative", "content": "As a first-time trustee, James Wang's proposed allocation plan was deemed unbalanced and inequitable. This failed attempt to align interests with the investor negatively impacts his emerging reputation, suggesting a need for improvement in formulating fair investment proposals and establishing reliable relationships.", "numerical record": "(0.5, 0.3, 0.1, 0.1, 0)"}}