{"Investor_14": {"ID": 14, "scenario": "investment", "role": "investor", "name": "Juan Carlos Reyes", "content": "Throughout the investment process, I have reaffirmed my reputation as a diligent and trustworthy investor. My proactive communication and clarity in expectations facilitated a cooperative relationship with the trustee, resulting in successful outcomes and profits that exceeded projections. I am committed to maintaining transparency and fostering long-term partnerships that are mutually beneficial.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "relationship": "positive", "content": "Akiko Sato has maintained high standards of integrity and transparency during the investment process. Their accurate reporting and an altruistic approach that resulted in greater returns enhance their reputation as a trustworthy and fair trustee invested in the interests of investors.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "The trustee has exhibited exemplary behavior, maintaining transparency, integrity, and a commitment to exceeding expectations in profit distribution. Despite not adhering strictly to the proposed allocation plan, the trustee's actions indicate a proactive care for my financial well-being, enhancing his reputation as a trustworthy and competent investment partner dedicated to fairness and long-term success.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_6": {"ID": 6, "scenario": "investment", "role": "trustee", "name": "Sergey Petrov", "relationship": "positive", "content": "Sergey Petrov exhibited a high degree of integrity and competence throughout the investment process. His commitment to transparency was evident as he provided accurate reports on investment outcomes, which aligned with expectations. This behavior positively reflects his dedication to prioritizing the investor's interests, establishing him as a reliable and trustworthy partner for future investments.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}}