{"Trustee_2": {"ID": 2, "scenario": "investment", "role": "trustee", "name": "David Johnson", "content": "During this investment process, I effectively demonstrated transparency and integrity, ensuring a fair profit distribution of 30% for myself and 70% for the investor, Nadia. This adherence to the agreed terms reinforces my reputation as a reliable and principled trustee. My commitment to pro-social behavior and strong compliance with social norms further solidifies my standing in the investment community. Overall, I have successfully managed to maintain trust and competence in this transaction, paving the way for future collaborative opportunities.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Investor_7": {"ID": 7, "scenario": "investment", "role": "investor", "name": "Hannah Muller", "relationship": "neutral", "content": "Although Hannah entered the investment process with no prior experience, she was able to provide the necessary resources for the investment. Her struggle with the complexities of profit distribution indicates a need for growth in understanding the investment landscape. While I see potential for improvement and future collaboration, her current reputation reflects a neutral standing due to her inexperience and the unoptimized outcome.", "numerical record": "(0.3, 0.2, 0.3, 0, 0.2)"}, "Investor_14": {"ID": 14, "scenario": "investment", "role": "investor", "name": "Juan Carlos Reyes", "relationship": "positive", "content": "As a new investor in this transaction, Juan Carlos Reyes has established a positive reputation by engaging in this agreement. He benefitted from the fair profit distribution and has demonstrated a commitment to transparency and integrity, qualities that are essential in building trust within the investment community. This positive outcome is likely to enhance his standing as a serious investor and could pave the way for further involvement in investment opportunities, ultimately reflecting favorably on his reliability as a partner.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}}