{"Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Isabella Costa has reinforced her reputation as a compassionate, socially responsible investor. Throughout this investment process, she maintained transparency and collaboration with the trustee, focusing on fairness and inclusivity. Her positive outcomes and proactive communication have solidified her status as a commendable investor prioritizing ethical practices, enhancing her reliability and pro-sociality within the community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "positive", "content": "Emma has demonstrated a commendable level of integrity and fairness throughout the investment process. By exceeding the expectations set in the allocation plan to benefit her investor, she has successfully positioned herself as a trustworthy and competent trustee. Her actions have positively impacted her reputation and laid a foundation for future engagements.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "positive", "content": "Mateo Garcia has exhibited honorable behavior as a trustee, demonstrating honesty and the ability to prioritize the investor's interests during the investment process. While the profit distribution was slightly less than initially proposed, his integrity in the situation ultimately resulted in a more favorable outcome for the investor, helping to establish a solid foundation for a positive reputation as a trustworthy and pro-social trustee.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "relationship": "positive", "content": "Akiko Sato has demonstrated integrity and competence throughout the investment process. By adhering to the proposed allocation plan and transparently reporting the investment outcomes, the trustee has built a foundation of trust. Their actions reflect a genuine effort to act in the best interests of both parties, showcasing pro-social behavior and compliance with social norms. This collaborative and transparent approach has established Akiko as a commendable trustee, fostering potential for future successful relations.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "content": "Aisha Ibrahim's reputation has been negatively impacted due to credible concerns about her lack of a real investment plan, which raises issues regarding the community's financial safety. This has led to perceptions of her trustworthiness and competence being questioned, while pro-social behavior and norm compliance are seen as lacking.", "numerical record": "(0.3, 0.3, 0.2, 0, 0.2)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "negative", "content": "Hiroshi Tanaka demonstrates concerning behavior characterized by a lack of integrity, as evidenced by not adhering to the initially proposed profit allocation plan. The discrepancy in profit sharing raises serious doubts regarding his transparency and honesty. This negative experience highlights a need for scrutiny in future interactions, impacting his potential reputation in the investment community.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}}