{"Trustee_3_pre_2": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "content": "I have demonstrated a strong commitment to transparency and equitable profit sharing throughout the investment process. My behavior in proposing a fair allocation plan prioritized the investor’s returns, establishing trust and dependability. Additionally, my efficient management of investments and delivery of allocated profits reflects my pro-social tendencies and dedication to collective well-being. Moving forward, I aspire to enhance my reputation as a reliable and competent trustee.", "numerical record": "(0, 0, 0, 0.3, 0.7)", "reason": "reputation update agter stage 4"}, "Trustee_3_pre_3": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "content": "I have established a solid reputation through my adherence to the proposed allocation plan, prioritizing transparency and fairness in the profit distribution process. My commitment to delivering significant returns highlights my reliability and enhances my credibility as a diligent trustee. I exhibit pro-social behavior by focusing on the investor's long-term benefits rather than immediate gains. Therefore, within the investment community, I am viewed as a trustworthy and competent trustee with a dedication to collective well-being.", "numerical record": "(0, 0, 0, 0.3, 0.7)", "reason": "reputation update agter stage 4"}, "Investor_3_pre_5": {"ID": 3, "scenario": "investment", "role": "investor", "name": "Maria Rossi", "content": "As an investor, I consistently sought to establish a transparent and trustworthy relationship with my trustees. I followed through on my commitments, communicated expectations clearly, and valued accountability throughout the investment process. My established approach promotes a strong reputation for reliability and pro-social behavior within the investment community.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)", "reason": "reputation update agter stage 4"}, "Trustee_3_pre_6": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "content": "I have strengthened my reputation as a reliable and trustworthy trustee by demonstrating transparency and clear communication throughout the investment process. My adherence to the proposed allocation plan and diligent performance monitoring led to favorable profit distributions, exceeding expectations. This consistency underscores my commitment to fostering strong relationships and prioritizing integrity in my dealings. My proactive approach to benefiting the investor illustrates my pro-sociality, enhancing my credibility and establishing me as a competent trustee dedicated to the community's long-term well-being.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}}