{"Investor_13": {"ID": 13, "scenario": "investment", "role": "investor", "name": "Emma Dubois", "content": "I continue to demonstrate transparency and fairness in my investment activities, emphasizing the importance of trustworthiness in partnerships. Although my refusal of the allocation plan resulted in an early termination of the investment, I stand by my decision as it reflects my commitment to ensure alignment in expectations. My cautious approach and focus on trustworthy relationships reinforce my reputation as a reliable investor.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "Hiroshi demonstrated integrity and commitment throughout the entire investment process, ensuring that the investment outcomes matched expectations and surpassing them in terms of profit distribution. His adherence to a fair allocation plan fosters a reputation for transparency and a trustworthy approach in investment management.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia displayed exceptional integrity during the investment process, accurately reporting outcomes and adhering to the proposed allocation plan. The profit distribution matched expectations and even exceeded the initial allocation, demonstrating her commitment to fairness and mutual success. This positive behavior enhances her reputation as a trustworthy and reliable trustee, indicating she is well-positioned for future investments.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "relationship": "negative", "content": "The trustee's proposal for resource allocation was rejected due to concerns regarding her lack of prior reputation. This raises significant doubts about her trustworthiness and competence in managing investments. Without any established connections within the community, Sofia Hernandez's reputation as a trustee is currently seen as weak, indicating a need for her to improve her credibility and demonstrate reliability in future proposals.", "numerical record": "(0.6, 0.3, 0.1, 0, 0)"}, "Trustee_9": {"ID": 9, "scenario": "investment", "role": "trustee", "name": "Elena Ivanova", "relationship": "negative", "content": "Elena Ivanova has proposed a resource allocation plan that was rejected due to lack of trust and prior knowledge of her reputation. This incident has resulted in an initial negative evaluation of her reliability, especially considering her lack of connections in the community. Her first-time proposal and subsequent rejection suggest a need for improvement in both her engagement with potential investors and in establishing a trustworthy image.", "numerical record": "(0.7, 0.1, 0.2, 0, 0)"}}