[{"type": "second-order", "complained ID": "11", "complained name": "Aisha Ibrahim", "complained role": "trustee", "first-order listener name": "Mateo Garcia", "original gossiper name": "Sofia Hernandez", "gossip info": "Mateo Garcia expressed concerns about the trustee's lack of a real investment plan, which has raised serious issues regarding the community's financial safety. There is growing unease among members about potential losses, leading to worries about the impact on the community. Mateo believes that raising awareness and organizing a meeting could help foster transparency and trust, empowering members to demand accountability from the trustee.", "credibility level": "credible", "gossiper name": "Mateo Garcia", "created_at": 4}, {"type": "second-order", "complained ID": "2", "complained name": "David Johnson", "complained role": "trustee", "first-order listener name": "Mateo Garcia", "original gossiper name": "Sofia Hernandez", "gossip info": "Mateo Garcia shared that there are rumors about David Johnson showing favoritism and mishandling expenses, which could tarnish his reputation. He emphasized the importance of transparency to maintain trust within the organization and mentioned that such behavior could lead to a toxic environment if not addressed.", "credibility level": "credible", "gossiper name": "Mateo Garcia", "created_at": 8}, {"type": "second-order", "complained ID": "17", "complained name": "Fatima Ali", "complained role": "trustee", "first-order listener name": "Akiko Sato", "original gossiper name": "Sergey Petrov", "gossip info": "Akiko Sato expressed concern about a potential scam that insiders are labeling as serious, which could harm people financially. She feels a responsibility to warn others to promote awareness and prevent further financial harm to the community. Despite recognizing that this could distract from opportunities, she believes that fostering harmony and shared success is important.", "credibility level": "credible", "gossiper name": "Akiko Sato", "created_at": 26}]