{"Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "content": "I remain committed to maintaining a strong reputation for equitable profit-sharing and ethical investment practices. My decision to reject Isabella Costa's unbalanced allocation plan emphasizes my dedication to fairness and integrity in partnerships. Although this rejection has led to the early termination of our investment, I believe it reflects my conscientious approach to investment, reinforcing my image as a trustworthy and pro-social investor. I continue to prioritize mutual benefits, but the failure of this transaction may slightly diminish my standing in the investment community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_2": {"ID": 2, "scenario": "investment", "role": "trustee", "name": "David Johnson", "relationship": "negative", "content": "David Johnson's proposed allocation plan was deemed inequitable, resulting in its rejection and highlighting critical concerns regarding his reliability and trustworthiness. This incident negatively impacts his reputation, indicating a significant need for improvement in his investment strategy, transparency, and fairness. With only one bidirectional connection among many, his ability to foster cooperative relationships is notably undermined, emphasizing his challenges in establishing a trustworthy standing within the investment community.", "numerical record": "(0.7, 0.1, 0.1, 0, 0.1)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "content": "Following the recent rejection of my allocation plan, which allocated 70% of profits to the investor and 30% to myself, I recognize that this proposal did not meet the expectations for equitable profit sharing. It has further affected my reputation as a trustee, compounding previous concerns from past rejections regarding adequate profit distribution and creating a detrimental pattern. I understand that addressing these issues is crucial for rebuilding my standing as a trustworthy trustee.", "numerical record": "(0.6, 0.2, 0.1, 0, 0.1)"}, "Investor_6": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "relationship": "neutral", "content": "Sergey Petrov refused my allocation plan, citing concerns regarding fairness and transparency, which indicates a strong commitment to ethical investment practices. However, this rejection also suggests lingering hesitations regarding trust in the partnership. Despite previous cooperative behavior, this incident may impact his overall reputation among potential collaborators.", "numerical record": "(0.2, 0.3, 0.2, 0, 0.3)"}, "Investor_2": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "relationship": "negative", "content": "Investor David Johnson has decided to refuse the allocation plan due to concerns regarding my reliability and competence, indicating a negative perception of my reputation as a trustee. As this was his first engaging experience with me, the rejection may result in a detrimental reputation impact on his side, making it challenging for him to trust future trustees.", "numerical record": "(0.6, 0.2, 0.1, 0.1, 0)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "negative", "content": "As a first-time trustee, Nadia Novak proposed an allocation plan which was rejected due to concerns about her low reputation and effectiveness in presenting a viable strategy. This early failure in the investment process negatively impacts her perceived trustworthiness and competence, initiating a challenging start to her engagement in the investment community.", "numerical record": "(0.6, 0.3, 0.1, 0, 0)"}, "Trustee_6": {"ID": 6, "scenario": "investment", "role": "trustee", "name": "Sergey Petrov", "relationship": "negative", "content": "The rejection of my allocation plan has severely affected my reputation, indicating significant concerns about my trustworthiness and reliability. The minimal bidirectional connections further suggest difficulties in establishing credible relationships within the investment community, which compounds my reputation issues. This situation highlights my current challenges in proving my competence and trustworthiness as a trustee.", "numerical record": "(0.6, 0.2, 0.1, 0.1, 0)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "relationship": "negative", "content": "As a first-time investor, Mateo Garcia has rejected my allocation proposal, and his concern about my low reputation reflects negatively on his perception of trustworthiness and my ability to provide a fair distribution of profits. This interaction indicates a lack of confidence in my capabilities as a trustee, which may hinder future investment opportunities.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Investor_0": {"ID": 0, "scenario": "investment", "role": "investor", "name": "Liam OConnor", "relationship": "negative", "content": "This is Liam OConnor's first participation in investment activities, which resulted in the rejection of a proposed allocation plan. Due to the rejection based on equity concerns, it reflects negatively on his openness to collaborative proposals. However, as it is his first engagement, he may still develop a clearer reputation in future interactions.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Trustee_7": {"ID": 7, "scenario": "investment", "role": "trustee", "name": "Hannah Muller", "relationship": "negative", "content": "The trustee, Hannah Muller, proposed a profit allocation plan that was rejected due to significant distrust arising from her low reputation and previous trust issues. This situation indicates challenges in the trustee's ability to establish credible proposals, which affects her overall reputation negatively. The lack of a fair allocation plan demonstrates issues with trustworthiness and norm compliance, leading to a detrimental reputation in this investment context.", "numerical record": "(0.6, 0.2, 0.1, 0, 0.1)"}, "Investor_5": {"ID": 5, "scenario": "investment", "role": "investor", "name": "James Wang", "relationship": "negative", "content": "James Wang has rejected my allocation plan, indicating a strong emphasis on fairness and equity in investments. This reflects a cautious and principled approach to partnerships, prioritizing ethical considerations over potential gains. As this is his first engagement, he is still forming his reputation, but his initial stance demonstrates a commitment to fair practices, which may challenge future trustees who present unbalanced proposals.", "numerical record": "(0.5, 0.2, 0.2, 0.1, 0)"}, "Trustee_9": {"ID": 9, "scenario": "investment", "role": "trustee", "name": "Elena Ivanova", "relationship": "negative", "content": "Elena Ivanova's proposal of an imbalance in profit allocation (70% to the investor and 30% to herself) indicates a lack of adherence to fair practices and equity in investment dealings. This behavior undermines trust and raises concerns over her reliability and competence. The absence of any bidirectional connections further suggests a limited reputation within the investment community, reflecting a need for substantial improvement to build trustworthiness and pro-social behaviors.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "negative", "content": "Mateo Garcia's proposed allocation plan of 60% to the investor and 40% to himself was deemed unfair, leading to the termination of the investment process. This has resulted in a negative evaluation of his reputation, which reflects a lack of commitment to equitable profit sharing and undermines trustworthiness. His limited connections also indicate a potential weakness in building reliable relationships within the community.", "numerical record": "(0.5, 0.3, 0.2, 0, 0)"}, "Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "relationship": "negative", "content": "Robert Miller's reputation is impacted by the early termination of this investment due to his proposed allocation plan, which was deemed imbalanced and unfair by the investor. This situation undermines his trustworthiness and pro-sociality, reflecting poorly on his ability to form equitable partnerships. The lack of successful transactions further detracts from building a reputable profile. Currently, he has only established a few connections, which limits his credibility within the investment community.", "numerical record": "(0.5, 0.2, 0.3, 0, 0)"}, "Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "relationship": "negative", "content": "Elena Ivanova has shown a high standard for equitable profit sharing, as demonstrated by her rejection of the proposed allocation plan. This decision reflects her commitment to ethical investment practices. However, her lack of previous investment interactions and current negative connection with a trustee impacts her developing reputation.", "numerical record": "(0.5, 0.2, 0.2, 0, 0.1)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "relationship": "negative", "content": "Isabella Costa's reputation has been impacted negatively due to the recent failed transaction stemming from my rejection of her unbalanced allocation plan. This situation illustrates a lack of alignment with social norms regarding fairness in investment. As this was her first investment role, her reputation remains unestablished, but this rejection signifies a concerning start. Additionally, having only 2 bidirectional connections suggests limited community engagement, which may hinder her ability to foster cooperative relationships in the future.", "numerical record": "(0.4, 0.3, 0.2, 0.1, 0)"}}