{"Trustee_8_pre_3": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "content": "My commitment to transparency and equitable practices during the investment process has reinforced my reputation as a trustworthy and reliable trustee. Adhering strictly to the agreed allocation plan and fairly distributing profits demonstrate my competence and dedication to pro-social behavior. I have underscored the importance of maintaining open communication and fostering long-term partnerships based on fairness, which further strengthens my position within the investment community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Trustee_8_pre_4": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "content": "I have successfully fulfilled my obligations as a trustee, demonstrating trustworthiness and pro-sociality throughout the investment process. My commitment to transparency and adherence to the agreed allocation plan has solidified my reputation as a reliable and competent trustee. This performance not only ensures fairness in profit distribution but also positions me positively for future partnerships, marking me as a trustworthy figure in the investment community.", "numerical record": "(0, 0, 0, 0.3, 0.7)", "reason": "reputation update agter stage 4"}, "Investor_8_pre_5": {"ID": 8, "scenario": "investment", "role": "investor", "name": "Nadia Novak", "content": "Nadia Novak has demonstrated her capability as a decisive and ambitious investor, effectively leveraging resources to engage in fruitful transactions. Her ability to secure favorable returns reinforces her reputation as a goal-oriented individual, making her a reliable participant in investment activities. Her proactive approach to refining strategies for maximum gain indicates a high level of competence and pro-sociality in the investment community.", "numerical record": "(0, 0, 0, 0.3, 0.7)", "reason": "reputation update agter stage 4"}}