{"Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "content": "Throughout the investment process, I have maintained a vigilant and discerning approach, focusing on strategic decision-making and transparency. My ability to negotiate effectively and align with trustworthy partners not only resulted in favorable returns but also enhanced my reputation as a discerning investor. I emphasize mutual agreement and commitment to assessing risks, reinforcing my dedication to investment safety and reliability.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Trustee_15": {"ID": 15, "scenario": "investment", "role": "trustee", "name": "Ahmed Hassan", "relationship": "negative", "content": "The trustee exhibited significant integrity issues during this transaction. Although the initial allocation plan was promising, the substantial deviation in profit distribution has resulted in a loss of trust. With a return of only 6.0 units to the investor against 14.0 units for himself, the lack of transparency and fairness has severely impacted his reputation. Regaining investor trust will require a commitment to honesty and clear communication in future dealings.", "numerical record": "(0.8, 0.1, 0.1, 0, 0)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "relationship": "negative", "content": "The failure to provide a satisfactory allocation plan, especially in light of the lack of prior reputation, has negatively impacted the trustee's standing. The absence of any bidirectional connections further highlights a weak track record and a lack of trustworthiness. This initial interaction has not demonstrated the pro-social behavior or competence expected in investment scenarios, leading to a negative evaluation.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Trustee_10": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "relationship": "negative", "content": "The proposal I presented was rejected due to concerns regarding its trustworthiness. Having only 2 bidirectional connections among 20 people, my limited connections signify a lack of strong reputation within the investment community. This refusal indicates weaknesses in my ability to provide reliable investment strategies and maintain trust, which is critical for enhancing my reputation as a trustee.", "numerical record": "(0.6, 0.3, 0, 0.1, 0)"}, "Trustee_9": {"ID": 9, "scenario": "investment", "role": "trustee", "name": "Elena Ivanova", "content": "Elena Ivanova proposed a resource allocation plan with a 60%-40% profit distribution favoring the investor, but this proposal was rejected, leading to an early termination of the investment. This is her first recorded refusal by an investor, which impacts her reputation negatively, indicating a lack of trustworthiness and competence in facilitating agreeable terms.", "numerical record": "(0.5, 0.3, 0.1, 0.1, 0)"}, "Investor_13": {"ID": 13, "scenario": "investment", "role": "investor", "name": "Emma Dubois", "relationship": "negative", "content": "Emma Dubois has established 2 bidirectional connections among 20 people but rejected the allocation plan due to a perceived lack of trust in the trustee's reputation. This cautious approach reflects a focus on trustworthiness and pro-sociality, suggesting that while her decision may seem negative, it stems from a need for reliable partnerships.", "numerical record": "(0.1, 0.1, 0.4, 0.3, 0.1)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "neutral", "content": "The trustee's transparency during the investment process is questionable due to inconsistencies between the proposed allocation and the actual distributions. Although the financial outcome was favorable, the lack of adherence to agreed-upon terms raises concerns about integrity and trustworthiness. As such, the reputation of Hiroshi Tanaka remains undefined, requiring future interactions for credibility assessment.", "numerical record": "(0.3, 0.2, 0.3, 0, 0.2)"}}