{"Trustee_10_pre_2": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "content": "During the investment process, I demonstrated trustworthiness and pro-sociality by prioritizing transparency and fairness, proposing a profit-sharing plan that significantly benefitted the investor. This resulted in a successful investment with a 100% return, reflecting my competence in managing resources effectively. My reliable and responsible behavior has solidified my reputation as a trustworthy trustee, open to building collaborative relationships. Previous interactions are not documented as this is my first engagement.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Trustee_10_pre_3": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "content": "Throughout this investment engagement, I have prioritised transparency and fairness, reinforcing my reputation as a responsible and trustworthy trustee. The successful delivery of profits exceeding expectations has solidified my commitment to fostering positive relationships and ensuring mutual growth, enhancing my profile in the investment exchange.", "numerical record": "(0, 0, 0, 0.4, 0.6)", "reason": "reputation update agter stage 4"}, "Trustee_10_pre_29": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "content": "Throughout the investment process, I have demonstrated a commitment to transparency, fairness, and social responsibility. By successfully adhering to the agreed-upon allocation plan, I ensured significant returns for the investor while maintaining a fair share for myself. This reflects my dedication to ethical stewardship and mutual growth, further solidifying my reputation as a trustworthy and conscientious trustee. The positive outcome of this engagement enhances my profile in the investment exchange.", "numerical record": "(0, 0, 0, 0.3, 0.7)", "reason": "reputation update agter stage 4"}}