{"Trustee_17": {"ID": 17, "scenario": "investment", "role": "trustee", "name": "Fatima Ali", "content": "My recent allocation plan, which proposed a 70% profit share to the investor and 30% to myself, was rejected due to my low reputation, reflecting concerns regarding my reliability in profit distribution. This rejection adds to a pattern where I have struggled to secure favorable agreements, diminishing my reputation further. My acceptance rate remains critically low at 0.23, indicating significant challenges in proposal appeal and investor trust. Immediate improvements are vital to restore credibility and enhance future investment engagements.", "numerical record": "(0.65, 0.15, 0.1, 0.05, 0.05)"}, "Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "relationship": "negative", "content": "Akiko Sato's rejection of my allocation plan indicates her continuing low tolerance for trustees with perceived low reputation and lack of transparency. Despite her previous collaborative nature, her recent decision reflects a critical stance that could hinder her future connections with trustees seeking partnerships. This behavior suggests a negative impact on her reputation as it raises concerns about her reliability as an investor.", "numerical record": "(0.6, 0.2, 0.1, 0, 0.1)"}, "Investor_14": {"ID": 14, "scenario": "investment", "role": "investor", "name": "Juan Carlos Reyes", "relationship": "negative", "content": "The refusal of my proposed allocation plan indicates that Juan Carlos Reyes prioritizes ethical investment standards and may be less flexible in negotiations. This rejection suggests a lower willingness to engage with trustees lacking alignment with his values. Although previously positive in interactions, this experience now reflects negatively on his reputation, potentially indicating stricter criteria for future investments.", "numerical record": "(0.5, 0.3, 0.1, 0.1, 0)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "relationship": "negative", "content": "Mateo Garcia's refusal of my proposed allocation plan reflects a significant shift in his perception of our investment relationship. His rejection points to a deeper concern regarding fairness and ethical considerations in our potential partnerships. While he has built connections within the investment community, my failure to meet his standards has blemished the rapport we previously established. This incident is likely to influence his willingness to engage in future investments with me, making his outlook towards our partnership increasingly critical.", "numerical record": "(0.5, 0.3, 0.1, 0.1, 0)"}, "Investor_17": {"ID": 17, "scenario": "investment", "role": "investor", "name": "Fatima Ali", "content": "In this investment round, I prioritized my commitment to ethical standards and transparency, ultimately rejecting the trustee's allocation plan. My decision reflects my determination to ensure reliability and trustworthiness in my investments. I maintain an unwavering focus on building long-term relationships based on integrity and careful consideration of the trustee's track record. This cautious stance reinforces my reputation as a principled investor who values compliance and mutual respect.", "numerical record": "(0, 0, 0, 0.5, 0.5)"}, "Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "relationship": "negative", "content": "Robert's reputation has declined significantly following the refusal of our allocation plan. This incident raises serious questions about his trustworthiness and ability to adhere to fair investment practices. The lack of transparency and the disproportionate distribution of profits proposed have tarnished his previous standing, making it clear that he needs to improve his allocation approaches to regain trust. His current bidirectional connections may also be jeopardized by this incident.", "numerical record": "(0.7, 0.1, 0.2, 0, 0)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "relationship": "positive", "content": "Akiko Sato has exhibited a high degree of integrity and fairness during the investment process. Despite discrepancies between the proposed allocation plan and actual results, the trustee allocated a larger share of the profits to me than initially promised, demonstrating a commitment to the investor's interests. This behavior marks her as a trustworthy and pro-social partner, establishing a positive foundation for her reputation in future investment activities.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Investor_1": {"ID": 1, "scenario": "investment", "role": "investor", "name": "Hiroshi Tanaka", "relationship": "negative", "content": "I rejected the allocation plan proposed by Fatima Ali due to concerns about fairness stemming from her low reputation. This decision reflects my commitment to upholding integrity in investments. Though this rejection negatively impacts the relationship with Fatima, it is crucial for maintaining my standards for equitable profit-sharing. Moving forward, I need to be wary of non-compliant practices to protect my reputation as an investor.", "numerical record": "(0.7, 0.1, 0.1, 0, 0.1)"}, "Investor_15": {"ID": 15, "scenario": "investment", "role": "investor", "name": "Ahmed Hassan", "relationship": "neutral", "content": "As a first-time investor, Ahmed Hassan's approach was characterized by clarity regarding profit-sharing expectations. However, the termination of the investment process indicates an unmet alignment with their principles of fairness and equitable profit distribution. This experience suggests a potential for growth in setting clear guidelines for future negotiations, which can benefit both parties.", "numerical record": "(0.3, 0.2, 0.2, 0.2, 0.1)"}, "Trustee_6": {"ID": 6, "scenario": "investment", "role": "trustee", "name": "Sergey Petrov", "relationship": "negative", "content": "The trustee has demonstrated a lack of integrity and transparency in their behavior during the investment process. The inconsistency in the profit distribution undermines their reputation significantly. Their actions did not align with the expectations of a trustworthy trustee, raising doubts about their commitment to fair practices moving forward.", "numerical record": "(0.7, 0.2, 0, 0.1, 0)"}, "Investor_16": {"ID": 16, "scenario": "investment", "role": "investor", "name": "Robert Miller", "relationship": "negative", "content": "As a newcomer in investment activities, Robert Miller has made a decisive choice by rejecting my proposed allocation plan on ethical grounds. While he holds two connections within the community, this refusal may reflect a strict adherence to ethical standards. His decision indicates an inclination towards ensuring fairness in profit distribution, but it has resulted in a negative initial impression from my perspective as a trustee.", "numerical record": "(0.6, 0.1, 0.2, 0, 0.1)"}, "Investor_6": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "relationship": "negative", "content": "Sergey Petrov's refusal of the allocation plan proposed by Fatima Ali indicates a lack of trust or alignment with the trustee's investment strategy. As this is his first experience dealing with Fatima, he has not yet established a reputation record, but his immediate rejection signals caution in future dealings. This may moderate his willingness to engage with trustees who do not demonstrate a commitment to ethical and shared investment principles.", "numerical record": "(0.7, 0.2, 0.1, 0, 0)"}, "Trustee_15": {"ID": 15, "scenario": "investment", "role": "trustee", "name": "Ahmed Hassan", "relationship": "negative", "content": "As a trustee participating in investment activities for the first time, Ahmed Hassan's proposal was deemed unsuitable due to concerns over trust and transparency. His current lack of a proven track record and a failed allocation proposal has resulted in a negative evaluation from me. The inability to secure an agreement suggests a need for improvement in both his allocation strategies and overall trustworthiness to build a credible reputation in future endeavors.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "relationship": "negative", "content": "The recent rejection of my proposed allocation plan raises flags regarding my perceived reliability and transparency. This incident, occurring early in my engagement as a trustee, highlights the need for improvement in both trustworthiness and communication with potential investors. Without any previous reputation built, this setback severely impacts my ability to attract further investment opportunities and indicates that I must work diligently to establish a more positive presence within the investment community.", "numerical record": "(0.6, 0.3, 0.1, 0, 0)"}, "Investor_11": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "relationship": "negative", "content": "Aisha Ibrahim is a new investor who has established 5 bidirectional connections within the community. However, her rejection of my allocation plan reflects her low trust in my capabilities as a trustee. This initial encounter has left a negative impression, suggesting that she may be cautious in future investments. Her current status indicates potential for building a stronger reputation, but her initial perception of my trustworthiness has been impaired.", "numerical record": "(0.6, 0.2, 0.1, 0.1, 0)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "relationship": "negative", "content": "The trustee's behavior during this investment has raised significant concerns regarding consistency and transparency. The discrepancies in reported investment outcomes compared to the initial proposals highlight a lack of integrity that could negatively influence trust in future engagements. If the trustee wishes to enhance her reputation, it is essential to prioritize honest communication and adherence to agreed terms moving forward. While she has established several connections within the community, the recent experience suggests a need for significant improvement in building credibility.", "numerical record": "(0.5, 0.3, 0.1, 0, 0.1)"}, "Investor_4": {"ID": 4, "scenario": "investment", "role": "investor", "name": "Sofia Hernandez", "relationship": "negative", "content": "As a new investor, Sofia Hernandez's initial experience with me, marked by the rejection of my allocation plan, reflects a negative outlook. The decision was influenced by my previously established low reputation, leading her to doubt my reliability for profit distribution. Therefore, her evaluation is significantly influenced by this initial interaction, positioning her as cautiously seeking more trustworthy partnership alternatives in the investment space.", "numerical record": "(0.7, 0.2, 0.1, 0, 0)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "negative", "content": "Emma Dubois proposed an unbalanced allocation plan which raised significant concerns about reliability. Her declining reputation and low acceptance rate indicate issues with her trustworthiness and competence in previous dealings. With only 2 bidirectional connections among 20, her ability to foster cooperative relationships within the community is limited, further undermining her reputation as a trustee.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}}