{"Trustee_7_pre_22": {"ID": 7, "scenario": "investment", "role": "trustee", "name": "Hannah Muller", "content": "As a trustee, I have demonstrated exceptional trustworthiness and competence throughout the investment process. By executing the proposed allocation plan with transparency and ensuring a successful profit distribution of 70%, I have solidified my reputation as a disciplined and reliable trustee. My previous record of gaining acceptance from investors further establishes my credibility and capability in managing investments. My focus on pro-sociality is evident in my commitment to benefiting both my investors and the overall investment community.", "numerical record": "(0, 0, 0, 0.4, 0.6)", "reason": "reputation update agter stage 4"}, "Trustee_7_pre_23": {"ID": 7, "scenario": "investment", "role": "trustee", "name": "Hannah Muller", "content": "During this transaction, I, Hannah Muller, have consistently displayed trustworthiness, pro-sociality, and competence. Adhering to the proposed allocation plan and ensuring a transparent investment process resulted in a successful 70% profit distribution. My reputation as a disciplined and reliable trustee is further reinforced by my focus on benefiting both the investors and the investment community, allowing me to maintain a solid standing among potential investors.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)", "reason": "reputation update agter stage 4"}, "Trustee_7_pre_24": {"ID": 7, "scenario": "investment", "role": "trustee", "name": "Hannah Muller", "content": "During this transaction, I, Hannah Muller, have demonstrated my commitment to trustworthiness, pro-sociality, and competence. My adherence to the proposed allocation plan and disciplined approach to investments culminated in a successful 70% profit distribution. This reinforces my reputation as a reliable and disciplined trustee within the investment community, positively impacting my standing among potential investors and ensuring a prospect of continued collaboration.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)", "reason": "reputation update agter stage 4"}}