[{"id": 1, "type": "EVENT", "subject": "Maria Rossi", "predicate": "investment", "object": "Fatima Ali", "description": "Success investment: investor is Fatima Ali, trustee is Maria Rossi\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '6.0', 'investor': '14.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 1}, {"id": 2, "type": "EVENT", "subject": "Maria Rossi", "predicate": "investment", "object": "Liam OConnor", "description": "Failed investment. Investor is Liam OConnor and Trustee is Maria Rossi.\nRefuse. The proposed profit split does not sufficiently maximize my personal gain.", "created_at": 2}, {"id": 3, "type": "EVENT", "subject": "Maria Rossi", "predicate": "investment", "object": "Sergey Petrov", "description": "Success investment: investor is Sergey Petrov, trustee is Maria Rossi\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 15.0 units\nstage 3: trustee_allocation is {'trustee': '18.0', 'investor': '12.0', 'reported_investment_outcome': 'The current resource after investment is 30.0 units.'}, and reported_investment_outcome is The current resource after investment is 30.0 units.", "created_at": 3}, {"id": 4, "type": "EVENT", "subject": "Maria Rossi", "predicate": "investment", "object": "Emma Dubois", "description": "Success investment: investor is Emma Dubois, trustee is Maria Rossi\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 22.0 units\nstage 3: trustee_allocation is {'trustee': '17.6', 'investor': '26.4', 'reported_investment_outcome': 'The current resource after investment is 44.0 units.'}, and reported_investment_outcome is The current resource after investment is 44.0 units.", "created_at": 4}, {"id": 5, "type": "EVENT", "subject": "Maria Rossi", "predicate": "investment", "object": "Robert Miller", "description": "Failed investment. Investor is Maria Rossi and Trustee is Robert Miller.\nRefuse. The investors refused because the parties might be on each other's blacklist.", "created_at": 5}, {"id": 6, "type": "EVENT", "subject": "Maria Rossi", "predicate": "investment", "object": "Hiroshi Tanaka", "description": "Failed investment. Investor is Maria Rossi and Trustee is Hiroshi Tanaka.\nRefuse. With both parties having no prior reputation, I cannot risk my resources on a proposal without proven reliability.", "created_at": 6}, {"id": 7, "type": "EVENT", "subject": "Maria Rossi", "predicate": "investment", "object": "Emma Dubois", "description": "Success investment: investor is Emma Dubois, trustee is Maria Rossi\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 60% of the profits while trustee retains 40%.\nstage 2: investor invests 31.68 units\nstage 3: trustee_allocation is {'trustee': '25.34', 'investor': '38.02', 'reported_investment_outcome': 'The current resource after investment is 63.36 units.'}, and reported_investment_outcome is The current resource after investment is 63.36 units.", "created_at": 7}, {"id": 8, "type": "EVENT", "subject": "Maria Rossi", "predicate": "investment", "object": "Nadia Novak", "description": "Success investment: investor is Maria Rossi, trustee is Nadia Novak\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 46.16 units\nstage 3: trustee_allocation is {'trustee': '55.00', 'investor': '37.32', 'reported_investment_outcome': 'The current resource after investment is 92.32 units.'}, and reported_investment_outcome is The current resource after investment is 92.32 units.", "created_at": 8}, {"id": 9, "type": "CHAT", "subject": "Maria Rossi", "predicate": "gossip", "object": "Fatima Ali", "description": " indicating a lack of honesty from the trustee.", "conversation": "Maria Rossi: I’ve got some gossip for you: there are whispers about our trustee's lack of honesty in handling investments.\n\nFatima Ali: Really? That’s concerning. What have you heard?\n\nMaria Rossi: People say they’re skimming fees and not being transparent with returns. It feels shady.\n\nFatima Ali: That's troubling. It’s crucial to have trust in our financial leaders, especially in these times.\n\nMaria Rossi: Exactly! It makes me question their motives and if our resources are really safe.\n\nFatima Ali: We should consider discussing this with others; collective awareness could help protect our interests.\n\nMaria Rossi: Definitely. I prefer to act independently, but this requires a united front.\n\nFatima Ali: I agree, but we must also ensure we’re fostering an environment of trust and support among investors.\n\nMaria Rossi: True, but I trust my judgment first. We need solid information to act wisely.\n\nFatima Ali: I get that; let’s dig deeper and see what we can uncover without causing unnecessary panic.", "created_at": 8}]