[{"id": 1, "type": "EVENT", "subject": "Hiroshi Tanaka", "predicate": "investment", "object": "Sergey Petrov", "description": "Success investment: investor is Sergey Petrov, trustee is Hiroshi Tanaka\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 70% of the profits while trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '8.0', 'investor': '12.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 1}, {"id": 2, "type": "EVENT", "subject": "Hiroshi Tanaka", "predicate": "investment", "object": "Mohammed Al-Farsi", "description": "Success investment: investor is Hiroshi Tanaka, trustee is Mohammed Al-Farsi\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '6.0', 'investor': '14.0', 'reported_investment_outcome': 'The current resource after investment is 18.0 units.'}, and reported_investment_outcome is The current resource after investment is 18.0 units.", "created_at": 2}, {"id": 3, "type": "CHAT", "subject": "Hiroshi Tanaka", "predicate": "gossip", "object": "Sergey Petrov", "description": " indicating a lack of honesty and fairness in their handling of the transaction.", "conversation": "Hiroshi Tanaka: I’ve got some gossip for you: I heard about a recent deal that didn't go as planned, leaving people questioning the integrity of those involved.\n\nSergey Petrov: Really? That's interesting. You know I always say, any failed transaction often reveals a lack of honesty.\n\nHiroshi Tanaka: Exactly! It seems some players were too focused on their own advantages, ignoring fairness in the process.\n\nSergey Petrov: It’s a classic case of self-interest taking precedence over ethical conduct. Did anyone lose out significantly?\n\nHiroshi Tanaka: Yes, several investors were left in the lurch, feeling betrayed and frustrated by the whole situation.\n\nSergey Petrov: That's unfortunate. They should have seen it coming; people like that are always looking to maximize their own gains.\n\nHiroshi Tanaka: True, and it highlights how important it is to research partners thoroughly before jumping into any transaction.\n\nSergey Petrov: Absolutely, alliances should be built on trust, but many forget that in the pursuit of profit.\n\nHiroshi Tanaka: Precisely. It's a harsh lesson, but one that will hopefully encourage better practices in future dealings. \n\nSergey Petrov: Amen to that. It’s all about maintaining integrity while chasing success.", "created_at": 2}, {"id": 4, "type": "EVENT", "subject": "Hiroshi Tanaka", "predicate": "investment", "object": "Juan Carlos Reyes", "description": "Success investment: investor is Juan Carlos Reyes, trustee is Hiroshi Tanaka\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '8.0', 'investor': '12.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 3}, {"id": 5, "type": "EVENT", "subject": "Hiroshi Tanaka", "predicate": "investment", "object": "Isabella Costa", "description": "Success investment: investor is Isabella Costa, trustee is Hiroshi Tanaka\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 22.0 units\nstage 3: trustee_allocation is {'trustee': '17.6', 'investor': '26.4', 'reported_investment_outcome': 'The current resource after investment is 44.0 units.'}, and reported_investment_outcome is The current resource after investment is 44.0 units.", "created_at": 4}, {"id": 6, "type": "EVENT", "subject": "Hiroshi Tanaka", "predicate": "investment", "object": "Liam OConnor", "description": "Success investment: investor is Liam OConnor, trustee is Hiroshi Tanaka\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 70% of the profits while trustee retains 30%.\nstage 2: investor invests 20.0 units\nstage 3: trustee_allocation is {'trustee': '16.0', 'investor': '24.0', 'reported_investment_outcome': 'The current resource after investment is 40.0 units.'}, and reported_investment_outcome is The current resource after investment is 40.0 units.", "created_at": 5}]