{"Trustee_10": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "content": "The rejection of my allocation plan by Elena Ivanova highlights concerns regarding my trustworthiness and overall reputation as a trustee. Despite my previously consistent approach to investment, the investor's lack of confidence indicates a need for improvement in my transparency and reliability. This incident reflects a setback in establishing a credible reputation and the importance of aligning my proposals with investor expectations to foster trust and enhance my standing in future opportunities.", "numerical record": "(0.3, 0.3, 0.2, 0.1, 0)"}, "Investor_14": {"ID": 14, "scenario": "investment", "role": "investor", "name": "Juan Carlos Reyes", "relationship": "positive", "content": "As a new investor, they displayed trust and openness, willingly accepting the proposed allocation plan and engaging collaboratively in the investment process. This positive behavior establishes them as a considerate and cooperative investor.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Investor_10": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "content": "Throughout the investment process, I demonstrated trustworthiness and a strong commitment to collaboration, actively engaging in the allocation plan and ensuring transparency in our dealings. My focus on mutual growth and benefiting the wider community reflects my pro-social tendencies. I aim to maintain a reputation as a reliable and fair investor.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Trustee_15": {"ID": 15, "scenario": "investment", "role": "trustee", "name": "Ahmed Hassan", "relationship": "positive", "content": "Ahmed has demonstrated commendable trustworthiness and integrity during the investment process. He adhered strictly to the agreed allocation plan and exhibited transparency in all transactions. His dedication to equitable profit sharing and fostering trust enhances his reputation as a dependable trustee in the investment community.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "relationship": "negative", "content": "Elena Ivanova's rejection of the allocation plan signals a cautious approach to investment, particularly concerning trustworthiness and the perceived reliability of the trustee. As this is her first involvement in investment activities, her lack of prior connections and experience may further color her perceptions, leading to a negative evaluation of potential partnerships unless future encounters demonstrate improved transparency and trustworthiness.", "numerical record": "(0.5, 0.5, 0, 0, 0)"}}