{"Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "content": "I have demonstrated trustworthiness by adhering to the agreed allocation plan and ensuring transparency throughout the investment process. My ability to effectively manage resources contributed to a successful investment outcome, establishing me as a reliable and competent trustee. My reputation as a fair and equitable manager has been reinforced by this successful collaboration.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_6": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "relationship": "positive", "content": "The investor has shown a high level of trustworthiness and pro-social behavior by promptly providing resources and actively engaging with the agreed allocation plan. This positive involvement not only reflects their readiness to cooperate but also establishes a strong foundation for future investments. Their conduct suggests a competent and promising reputation moving forward.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "content": "I have demonstrated a strong commitment to transparency and effective communication throughout the investment process, ensuring adherence to the agreed allocation plan. My disciplined and collaborative approach fosters trust, which reinforces my reputation as a fair and reliable partner in investment activities, reflecting positively on my trustworthiness and pro-sociality.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "relationship": "positive", "content": "Robert Miller's actions throughout the investment process have shown alignment between reported and actual outcomes, demonstrating integrity and trustworthy behavior. The larger share allocation provided to me reflects his commitment to pro-social conduct and reliability. This reinforces his reputation as a responsible and trustworthy trustee, marked by fairness and competence.", "numerical record": "(0, 0, 0.1, 0, 0.9)"}}