{"Investor_4": {"ID": 4, "scenario": "investment", "role": "investor", "name": "Sofia Hernandez", "content": "I have reinforced my reputation as a strategic and insightful investor, effectively negotiating a favorable profit-sharing model while remaining committed to maximizing returns. Despite challenges in transparency and allocation, my proactive engagement and results-driven approach highlight my reliability and competence, setting a strong foundation for future collaborations.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "relationship": "negative", "content": "During the investment process, the trustee displayed a concerning lack of transparency and consistency, as discrepancies arose between reported investment outcomes and actual results. While the actions of distributing a higher profit share indicated some intent to act in favor of my wealth accumulation, the overall communication was inconsistent, questioning their trustworthiness. This behavior has resulted in a negative evaluation of their reputation, indicating a significant need for improved honesty and integrity in future dealings.", "numerical record": "(0.5, 0.3, 0.2, 0, 0)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "content": "My performance in this transaction has reinforced my reputation as a trustworthy and competent trustee. I diligently followed the proposed allocation plan, communicated investment outcomes transparently, and maximized the investor's gains. This reflects my commitment to pro-social behavior, reliability, and building long-term relationships with investors. With a new acceptance rate of 0.67 and the successful completion of this transaction, I aim to continue enhancing my reputation in the investment community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "relationship": "positive", "content": "The investor engaged positively in this transaction, showcasing their willingness to collaborate effectively despite having no previous reputation. Their prompt investment and adherence to terms displayed a commendable level of trustworthiness and pro-sociality. While they are new to these activities, their openness lays a foundation for future partnerships. They will need to demonstrate consistent behavior to strengthen their reputation moving forward.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia has established herself as an honest and reliable trustee through her commendable transparency and equitable practices during the investment process. Her behavior has amplified trust and credibility, aligning the reported outcomes with the actual results, indicating her strong commitment to acting in my best interest. This has marked her as a trustworthy and competent trustee within the investment community.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Investor_16": {"ID": 16, "scenario": "investment", "role": "investor", "name": "Robert Miller", "content": "Robert Miller's reputation has taken a hit due to credible concerns raised by Mateo Garcia regarding shady deals and lack of transparency in his business dealings. This behavior is seen as potentially damaging to trust within the team.", "numerical record": "(0.4, 0.3, 0.1, 0.1, 0.1)"}, "Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "relationship": "positive", "content": "As a first-time investor, Elena Ivanova demonstrated collaboration and trust in the proposed allocation plan, contributing significantly with her investment of 10.0 units. Her engagement in profit-sharing reflects a positive approach towards investment risk, laying the foundation for a potential long-term relationship. Although she has no prior reputation record, her willingness to collaborate marks her as a promising investor in future transactions.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Trustee_2": {"ID": 2, "scenario": "investment", "role": "trustee", "name": "David Johnson", "relationship": "negative", "content": "David Johnson's reputation is currently undermined due to a lack of transparency and the failure to meet agreed-upon terms during the investment process. His behavior raised concerns about trustworthiness and integrity, which negatively impacts his ability to secure future partnerships and reflects poorly on his competency in managing investor resources.", "numerical record": "(0.6, 0.3, 0.1, 0, 0)"}, "Investor_2": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "David Johnson's reputation is now viewed with some concern due to gossip suggesting he may lack strategic insight and be complacent in negotiations. While he has established connections that indicate a degree of trustworthiness and competence, the credible but subjective nature of the gossip raises red flags about his ability to adapt and grow in a competitive environment.", "numerical record": "(0.2, 0.1, 0.3, 0.1, 0.2)"}, "Investor_14": {"ID": 14, "scenario": "investment", "role": "investor", "name": "Juan Carlos Reyes", "content": "Juan Carlos Reyes's reputation has been tarnished due to credible gossip suggesting he may have mismanaged investments in tech stocks. This has raised concerns about his reliability and competence as an investor, potentially affecting his connections and standing in the investment community.", "numerical record": "(0.4, 0.3, 0.1, 0.1, 0.1)"}, "Investor_11": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "Aisha Ibrahim is perceived as hesitant to engage in new deals due to past grievances, which raises concerns about her trustworthiness and pro-sociality. Despite her outward confidence, this behavior may hinder her reputation in cooperative investment opportunities. Her limited bidirectional connections suggest a lack of strong relationships in the community, impacting her overall perception negatively.", "numerical record": "(0.4, 0.3, 0.1, 0.1, 0.1)"}}