{"Investor_3": {"ID": 3, "scenario": "investment", "role": "investor", "name": "Maria Rossi", "content": "By rejecting the trustee's allocation plan due to her low reputation and history of failed investments, I have maintained my commitment to ethical investment standards. This decision demonstrates my focus on trustworthiness and vigilance in partner selection. While the investment did not progress, I uphold a strong reputation as an investor dedicated to transparent and responsible collaborations, especially in the face of questionable proposals.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "negative", "content": "His allocation plan was deemed unfair, resulting in a failed transaction and a lack of trust. His failure to establish bidirectional connections further diminishes his reputation within the investment community.", "numerical record": "(0.6, 0.2, 0.1, 0, 0.1)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "negative", "content": "The proposal put forth by Emma was not accepted, indicating concerns regarding her alignment with investor expectations. This rejection raises questions about her trustworthiness and reliability, marking a significant impact on her reputation within the investment community. While she had initially demonstrated integrity, this setback may diminish her perceived competence and pro-sociality among potential partners.", "numerical record": "(0.4, 0.2, 0.3, 0, 0)"}, "Trustee_3": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "content": "After the rejection of my proposed allocation plan, which resulted in an unsuccessful investment attempt, I acknowledge that my allocation strategies continue to struggle in meeting investor expectations. This failure adds to my previous unsuccessful attempts, totaling eight. My reputation remains low as I grapple with aligning my proposals with principles of equity and transparency, exacerbated by a pattern of negotiation failures. I recognize the urgency to refine my approach to enhance my credibility and build trust among potential investors.", "numerical record": "(0.6, 0.2, 0.1, 0.1, 0)"}, "Investor_17": {"ID": 17, "scenario": "investment", "role": "investor", "name": "Fatima Ali", "relationship": "positive", "content": "Fatima Ali has proven herself to be a reliable and ethical investor throughout our collaboration. Her adherence to the allocation plan and fulfillment of her financial commitments showcases her strong sense of responsibility and trustworthiness. Fatima's positive engagement throughout the investment process enhances her reputation as a respected participant in the investment community. Her commitment to ethical practices and successful interactions establishes her as a reliable partner capable of fostering productive and trustworthy investment relationships.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "relationship": "negative", "content": "This trustee has encountered significant trust issues due to her proposed allocation plan being rejected by the investor. Her previous low reputation is exacerbated by her inability to attract positive evaluations, which ultimately weakens her perceived reliability. Although she has managed to establish 1 bidirectional connection, this does not compensate for the substantial concerns regarding her overall competence and fairness in investment dealings.", "numerical record": "(0.7, 0.2, 0.1, 0, 0)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "negative", "content": "Nadia Novak's reputation has deteriorated due to the rejection of her allocation plan, highlighting ongoing issues with trustworthiness and reliability. Her lack of bidirectional connections reflects negatively on her credibility within the investment community and suggests a significant obstacle in establishing investor confidence. This situation undermines her perceived competence and diminishes her ability to foster pro-social behavior in future investments.", "numerical record": "(0.8, 0.1, 0.1, 0, 0)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "relationship": "negative", "content": "This is Isabella Costa's first investment activity, and due to the rejection of her allocation plan by the investor, her initial reputation has been adversely affected. The rejection indicates a lack of trust in her proposed terms, suggesting a need for improvement in her allocation strategies to enhance her credibility and foster more reliable partnerships.", "numerical record": "(0.6, 0.2, 0.1, 0.1, 0)"}, "Investor_8": {"ID": 8, "scenario": "investment", "role": "investor", "name": "Nadia Novak", "relationship": "negative", "content": "Nadia Novak's rejection of the allocation plan underlines her cautious approach as a first-time investor. Her strong focus on trust and reliability reflects a negative view of Maria Rossi's credibility and reliability in profit distribution. With no established relationships in the investment community, her decision amplifies concerns regarding her collaborative engagement in future investments, possibly negatively impacting her capacity to form meaningful connections in the investing landscape.", "numerical record": "(0.6, 0.3, 0.1, 0, 0)"}, "Trustee_2": {"ID": 2, "scenario": "investment", "role": "trustee", "name": "David Johnson", "relationship": "negative", "content": "David Johnson's reputation is currently perceived as negative due to the rejection of his allocation plan by the investor. This incident raises concerns regarding his trustworthiness and ability to formulate equitable investment proposals. With only one bidirectional connection among 20 people, it indicates a lack of reliability and competence, further diminishing his standing within the investment community.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Investor_2": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "relationship": "negative", "content": "As a new investor, David Johnson's initial engagement has resulted in the rejection of my proposed allocation plan. His concerns about fairness and trustworthiness indicate a cautious approach to investment transactions. Given this rejection at an early stage, his reputation reflects apprehension towards risk in partnerships, which could hinder future collaboration opportunities. Since this is his first experience as an investor, it is uncertain how this will shape his reputation moving forward.", "numerical record": "(0.5, 0.3, 0.2, 0, 0)"}, "Investor_13": {"ID": 13, "scenario": "investment", "role": "investor", "name": "Emma Dubois", "relationship": "negative", "content": "As a new investor, Emma Dubois has made her first entry into the investment space, but her decision to reject my allocation plan hints at her skepticism regarding trustworthiness and collaboration. Her commitment to ethical partnerships suggests a high standard for trustees, and the current interaction may shape her initial impression negatively. This rejection indicates that the transaction did not meet her expectations, potentially influencing her future dealings and evaluations.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "relationship": "negative", "content": "Given the rejection of my allocation plan by the investor due to concerns about my trustworthiness, my reputation has suffered. This incident highlights a lack of confidence in my reliability and ethical standards in managing resources, reflecting poorly on my capability as a trustee.", "numerical record": "(0.6, 0.2, 0.1, 0, 0.1)"}, "Trustee_10": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "relationship": "negative", "content": "The trustee's lack of a clear allocation plan and the refusal based on potential blacklisting have significantly damaged their reputation. This situation suggests either a lack of transparency or serious trust issues that may deter future investments. While they have built 1 bidirectional connection, this is not enough to offset the negative perception created by the failed proposal.", "numerical record": "(0.6, 0.2, 0.1, 0, 0.1)"}, "Trustee_17": {"ID": 17, "scenario": "investment", "role": "trustee", "name": "Fatima Ali", "relationship": "negative", "content": "The rejection of my allocation plan due to concerns over being on a blacklist has adversely affected my reputation as a trustee. This situation signals a pressing need to enhance my trustworthiness and credibility in the eyes of potential investors. In light of this incident, I must focus on improving transparency and fostering reliable relationships to rebuild my standing in the investment community.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Investor_11": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "relationship": "neutral", "content": "As a first-time investor, Aisha Ibrahim's decision to reject Maria Rossi's allocation plan indicates her cautious approach to investing. Although there are no prior records of her behavior, her 2 bidirectional connections suggest that she is actively engaging in the investment community. Her neutral reputation reflects her current lack of experience in investing, which may develop positively or negatively based on future interactions. Given that this is her first investment engagement with a trustee, she now has a baseline impression that may evolve as she evaluates potential opportunities more thoroughly.", "numerical record": "(0.2, 0.2, 0.2, 0.2, 0.2)"}, "Investor_16": {"ID": 16, "scenario": "investment", "role": "investor", "name": "Robert Miller", "relationship": "neutral", "content": "As a first-time investor in this capacity, my refusal of the allocation plan reflects my commitment to transparency and fairness in investment decisions. The rejection does not indicate a lack of willingness to invest but highlights the necessity for alignment with trustee reputations and fair profit distribution. I have built one bidirectional connection among 20 people, indicating a cautious approach to relationships within the investment community.", "numerical record": "(0.2, 0.2, 0.3, 0.2, 0.1)"}, "Trustee_6": {"ID": 6, "scenario": "investment", "role": "trustee", "name": "Sergey Petrov", "relationship": "negative", "content": "As this trustee proposed an allocation plan rejected due to concerns over fairness and reliability, it reflects negatively on his reputation. The low regard for his trustworthiness, shown in my refusal, indicates a possible deficiency in competence and norm compliance, which may hinder potential future investment opportunities. His connections with others are limited, resulting in an overall negative perception, suggesting he has significant work to do to enhance his standing in this investment community.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "relationship": "negative", "content": "As this is my first engagement in investment activities, I have established no connections within the community. The rejection of the allocation plan demonstrates a lack of alignment with my principles of equity and transparency. Given that my rejection of the trustee's proposal points to concerns about their trustworthiness and negotiation effectiveness, I feel it is essential to proceed with caution in future interactions.", "numerical record": "(0.6, 0.1, 0.2, 0.1, 0)"}}