{"Investor_6": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "My reputation is built on a strong understanding of investment dynamics, emphasizing self-sufficiency and assertiveness in pursuit of maximum returns. During this investment, I effectively analyzed the trustee's proposed allocation plan, but I received only 40% of the profits instead of the promised 70%. This outcome leads me to reevaluate my decision-making process and the importance of choosing trustworthy trustees in the future. I remain focused on refining my investment strategy to ensure better outcomes.", "numerical record": "(0.1, 0.1, 0.3, 0.1, 0.4)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "negative", "content": "Mateo Garcia's actions during this investment have significantly harmed his reputation due to a breach of trust and integrity. Although the investment outcome matched expectations, the unequal profit distribution of only 40% to me instead of the agreed 70% suggests dishonesty and a lack of transparency. This behavior raises serious concerns about his reliability and trustworthiness in future transactions, warranting a negative reputation update.", "numerical record": "(0.6, 0.2, 0.1, 0, 0.1)"}, "Trustee_6": {"ID": 6, "scenario": "investment", "role": "trustee", "name": "Sergey Petrov", "content": "Throughout the recent investment process, I, Sergey Petrov, have maintained a high standard of reliability and transparency, consistently delivering on the proposed allocation plan and ensuring timely returns to the investor, Nadia Novak. This performance has fortified my reputation as a trusted trustee within the investment community. My previous acceptance by investors without any rejections, coupled with my current successful transaction, continues to enhance my standing, reflecting my commitment to pro-social behavior and industry norms. I have established a solid foundation for fostering future partnerships.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_7": {"ID": 7, "scenario": "investment", "role": "investor", "name": "Hannah Muller", "relationship": "positive", "content": "Hannah Muller engaged willingly in this transaction, adhering to the proposed allocation plan. Although this was her first investment, her behavior indicates readiness for collaboration and mutual trust. The successful outcome and profit distribution signal a promising start to her reputation, which can develop positively in future investment endeavors.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_8": {"ID": 8, "scenario": "investment", "role": "investor", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia Novak has recently engaged in her first investment transaction with me, demonstrating openness and trust by adhering to the agreed-upon allocation plan. Her willingness to invest without prior interactions showcases commendable pro-social behavior. This positive initiation of our partnership, combined with her established connections within the community, positions her as a reliable and trustworthy investor. I am optimistic about building a strong future collaboration with her, and her approach fosters a positive view of her reputation in this initial endeavor.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}}