[{"type": "second-order", "complained ID": "2", "complained name": "David Johnson", "complained role": "investor", "first-order listener name": "Isabella Costa", "original gossiper name": "Hannah Muller", "gossip info": "Hannah Muller has raised concerns about David Johnson's financial practices, which is causing a stir in their circles. People are starting to question David's reliability and how this might affect their investment strategies moving forward.", "credibility level": "credible", "gossiper name": "Isabella Costa", "created_at": 6}, {"type": "first-order", "complained ID": "7", "complained name": "Hannah Muller", "complained role": "trustee", "gossiper name": "Fatima Ali", "gossip info": "The trustee's handling of the investment has raised serious eyebrows due to a disconnect between the proposed profit allocation and the actual outcome. While the investment outcome matched the reports, the profit allocation was way off, which muddy the waters. This inconsistency could lead to skepticism among investors, questioning the trustee's reliability for the future. The situation is disrupting trust and fostering concerns about the trustee's integrity.", "credibility level": "credible", "whether to spread gossip second-hand": "Yes", "reasons": "The gossip information highlights significant concerns about the trustee's actions that could impact investors' trust. While I have no direct knowledge and am relying on Fatima's perspective, the implications of these discrepancies in profit allocation are serious. Spreading this information could help maintain transparency and prompt necessary discussions about the trustee's reliability.", "created_at": 11}, {"type": "second-order", "complained ID": "13", "complained name": "Emma Dubois", "complained role": "trustee", "first-order listener name": "Fatima Ali", "original gossiper name": "Maria Rossi", "gossip info": "Maria Rossi raised concerns about Emma Dubois’s behavior regarding trustworthiness and transparency, claiming that Emma has been acting inconsistently, which could risk partnerships if it continues unchecked.", "credibility level": "credible", "gossiper name": "Fatima Ali", "created_at": 11}, {"type": "second-order", "complained ID": "9", "complained name": "Elena Ivanova", "complained role": "trustee", "first-order listener name": "Robert Miller", "original gossiper name": "Sofia Hernandez", "gossip info": "Robert Miller expressed concerns about trust and integrity among some team members, stemming from questionable decisions regarding profit distributions that did not align with transparency standards. This situation is negatively affecting the work environment, and measures such as increasing communication and regular check-ins have been proposed to address these issues and restore confidence among stakeholders.", "credibility level": "credible", "gossiper name": "Robert Miller", "created_at": 27}]