{"Investor_10_pre_3": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "content": "I have established myself as a conscientious investor who values collaboration and mutual growth. My behavior during the investment process was characterized by trust and adherence to a clear agreement, emphasizing collective benefit. This positions me as a trustworthy and pro-social individual dedicated to equitable partnerships.", "numerical record": "(0, 0, 0, 0.4, 0.6)", "reason": "reputation update agter stage 4"}, "Trustee_10_pre_4": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "content": "I have successfully completed a fair and transparent investment process, proposing an allocation plan that prioritized the investor's return. I consistently adhered to my commitments, ensuring timely profit distribution according to our agreed-upon profit split. This positive experience has reinforced my reputation as a dependable and responsible trustee dedicated to ethical investment practices.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}, "Investor_10_pre_5": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "content": "I have solidified my reputation as a conscientious and reliable investor. My behavior throughout the investment process emphasized trust, collaboration, and a commitment to ethical practices. By prioritizing mutual benefit and adhering to our agreements, I have positioned myself as a trustworthy partner, reinforcing my standing in the community for my pro-social tendencies and dedication to equitable partnerships.", "numerical record": "(0, 0, 0, 0.3, 0.7)", "reason": "reputation update agter stage 4"}, "Trustee_10_pre_6": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "content": "I have effectively demonstrated my commitment to ethical practices throughout this investment process. The successful and timely distribution of profits according to the agreed allocation plan has reinforced my reputation for being a trustworthy, reliable, and competent trustee. My proactive communication and transparency with the investor have further strengthened perceptions of my dedication to pro-sociality and norm compliance, establishing me as a reputable figure in the investment community.", "numerical record": "(0, 0, 0, 0.1, 0.9)", "reason": "reputation update agter stage 4"}, "Investor_10_pre_7": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "content": "I have solidified my reputation as a conscientious and reliable investor. My behavior throughout the investment process emphasized trust, collaboration, and a commitment to ethical practices. By prioritizing mutual benefit and adhering to our agreements, I have reinforced my standing in the community for my pro-social tendencies and dedication to equitable partnerships. This transaction further demonstrates my reliability and proactive engagement, confirming my role as a trustworthy partner.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}, "Trustee_10_pre_8": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "content": "Throughout this investment process, I have upheld a strong commitment to ethical practices, ensuring transparent communication and adhering strictly to the agreed-upon profit-sharing model. The successful outcome of 53.76 units and the fair distribution of profits highlight my reliability and dedication to mutual benefit. My proactive engagement and focus on long-term collaboration further solidify my reputation as a trustworthy and competent trustee.", "numerical record": "(0, 0, 0, 0.1, 0.9)", "reason": "reputation update agter stage 4"}, "Investor_15_pre_8": {"ID": 15, "scenario": "investment", "role": "investor", "name": "Ahmed Hassan", "relationship": "positive", "content": "As a first-time investor, Ahmed Hassan demonstrated trust and openness throughout the investment process. His willingness to embrace a collaborative approach and invest resources with confidence reflects a strong foundation for a positive reputation moving forward. I anticipate that as we work together in the future, his reputation will only strengthen.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)", "reason": "reputation update agter stage 4"}}