[{"type": "second-order", "complained ID": "15", "complained name": "Ahmed Hassan", "complained role": "trustee", "first-order listener name": "Aisha Ibrahim", "original gossiper name": "Elena Ivanova", "gossip info": "Elena Ivanova is really concerned about Ahmed Hassan’s integrity, which is creating quite a stir among stakeholders. If these concerns get out, it could undermine trust not just in Ahmed, but in everyone involved with him. We need to discuss these concerns openly in our next meeting to ensure everyone is aware of the risks, as it reinforces our commitment to integrity and is essential for our reputation.", "credibility level": "credible", "gossiper name": "Aisha Ibrahim", "created_at": 3}, {"type": "first-order", "complained ID": "8", "complained name": "Nadia Novak", "complained role": "trustee", "gossiper name": "Aisha Ibrahim", "gossip info": "Aisha Ibrahim expressed dissatisfaction with Nadia Novak's behavior regarding a recent transaction, where they promised a 40% allocation for themselves and 60% for Aisha but instead distributed 240.0 units to Aisha and only kept 160.0 for themselves. This deviation raised concerns about Nadia's integrity and transparency, which Aisha believes could harm Nadia's reputation in the long run. Aisha emphasized the importance of open communication and sticking to agreements to build trust within the community.", "credibility level": "credible", "whether to spread gossip second-hand": "Yes", "reasons": "The information comes from Aisha Ibrahim, who has expressed genuine concerns about Nadia's integrity and the implications for trust within the community. Given the nature of the issue—violating an agreement—this could have significant consequences for relationships in the team. It is important for others in the community to be aware of this behavior to foster transparency and accountability.", "created_at": 11}, {"type": "second-order", "complained ID": "7", "complained name": "Hannah Muller", "complained role": "trustee", "first-order listener name": "Akiko Sato", "original gossiper name": "Fatima Ali", "gossip info": "There are serious concerns about the trustee's actions, specifically regarding discrepancies in how profits are being allocated, which raises red flags and could undermine investors' trust. Akiko believes spreading this information could encourage transparency and critical discussions.", "credibility level": "credible", "gossiper name": "Akiko Sato", "created_at": 11}, {"type": "second-order", "complained ID": "17", "complained name": "Fatima Ali", "complained role": "trustee", "first-order listener name": "Mohammed Al-Farsi", "original gossiper name": "Sergey Petrov", "gossip info": "Mohammed Al-Farsi expressed concerns about some investors not adhering to ethical standards, which is causing worries in their circle. He emphasized the importance of maintaining transparency and trust to prevent larger issues and maintain their credibility.", "credibility level": "credible", "gossiper name": "Mohammed Al-Farsi", "created_at": 17}, {"type": "second-order", "complained ID": "3", "complained name": "Maria Rossi", "complained role": "trustee", "first-order listener name": "James Wang", "original gossiper name": "Hiroshi Tanaka", "gossip info": "James Wang expressed concerns about Hiroshi Tanaka's approach in recent deals, indicating a lack of transparency due to inconsistencies in profit distributions that do not align with agreed-upon plans. There is a growing buzz among peers, suggesting a need for open discussions around accountability.", "credibility level": "credible", "gossiper name": "James Wang", "created_at": 23}]