[{"type": "second-order", "complained ID": "8", "complained name": "Nadia Novak", "complained role": "trustee", "first-order listener name": "Sergey Petrov", "original gossiper name": "Aisha Ibrahim", "gossip info": "Aisha Ibrahim is raising concerns about Nadia's integrity, suggesting she violated an agreement. There are allegations of her not following through on commitments, which could undermine team relationships. If these issues aren't addressed upfront, it could create a ripple effect of distrust within the community.", "credibility level": "credible", "gossiper name": "Sergey Petrov", "created_at": 11}, {"type": "second-order", "complained ID": "7", "complained name": "Hannah Muller", "complained role": "trustee", "first-order listener name": "Akiko Sato", "original gossiper name": "Fatima Ali", "gossip info": "Akiko Sato expressed concerns about the trustee's actions regarding profit allocation, which could potentially shake investor trust. She emphasized the importance of ethical practices in transactions and suggested that they need to address these issues promptly to prevent damaging their reputations.", "credibility level": "credible", "gossiper name": "Akiko Sato", "created_at": 11}, {"type": "second-order", "complained ID": "17", "complained name": "Fatima Ali", "complained role": "trustee", "first-order listener name": "Sergey Petrov", "original gossiper name": "Akiko Sato", "gossip info": "People are whispering that her methods may not be as transparent as they seem. There have been several instances where her investment reports didn’t quite line up with reality, leading some to question her integrity. Some colleagues are starting to distance themselves, indicating they might have caught on to something concerning her behavior.", "credibility level": "credible", "gossiper name": "Sergey Petrov", "created_at": 27}, {"type": "second-order", "complained ID": "9", "complained name": "Elena Ivanova", "complained role": "trustee", "first-order listener name": "Robert Miller", "original gossiper name": "Sofia Hernandez", "gossip info": "Robert Miller expressed concerns about unethical practices among trustees in the investment circle. Allegations suggest that some trustees are not adhering to agreed-upon allocation plans, which jeopardizes trust within the community. It was noted that there are worries that personal gain may be prioritized over transparency and ethics, which could impact relationships and collaborations.", "credibility level": "credible", "gossiper name": "Robert Miller", "created_at": 27}]