{"Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "content": "Throughout this investment process, I have demonstrated strong commitment to collaboration and open communication, fostering a constructive relationship with the trustee. My proactive engagement and clear establishment of expectations showcase my trustworthiness and integrity as an investor. This experience solidifies my reputation as someone who values partnership integrity and collective success.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_17": {"ID": 17, "scenario": "investment", "role": "trustee", "name": "Fatima Ali", "relationship": "positive", "content": "The trustee, Fatima Ali, has shown commendable trustworthiness and pro-sociality throughout the investment process. Her commitment to transparency and fairness in executing the allocation plan exceeded initial expectations, reflecting a genuine interest in my wealth accumulation. This behavior indicates strong competence and adherence to social norms, establishing her as a reliable partner for future investments, enhancing her reputation positively.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "relationship": "neutral", "content": "While the trustee complied with the proposed allocation plan, their withholding of an unexpected lower portion of profits raises concerns regarding their integrity and fairness in profit distribution. This inconsistency questions their reliability, suggesting a need for caution in future interactions. Given their lack of established connections and the mixed evaluation of their actions, their reputation appears uncertain and warrants careful consideration in subsequent engagements.", "numerical record": "(0.3, 0.2, 0.3, 0, 0.2)"}, "Trustee_14": {"ID": 14, "scenario": "investment", "role": "trustee", "name": "Juan Carlos Reyes", "relationship": "positive", "content": "The trustee has exhibited high levels of integrity and fairness throughout the investment process. By distributing a greater share of profits to me than initially proposed, this demonstrates their commitment to prioritizing the investor's interests. Such behavior enhances their reputation significantly, showcasing transparency and equitable resource distribution, which are foundational for successful future collaborations.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}}