{"Investor_6_pre_1": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "During the investment process, I was assertive and focused on maximizing returns. I clearly communicated my expectations, actively monitored the investment, and successfully aligned the results with my goals. This reflects my attention to detail and commitment to safeguarding my interests as an investor.", "numerical record": "(0, 0, 0, 0.4, 0.6)", "reason": "reputation update agter stage 4"}, "Investor_6_pre_2": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "During the investment process, I demonstrated assertiveness and attentiveness, focusing on maximizing my returns. I effectively communicated my expectations and maintained active involvement in monitoring the investment. My proactive approach and attention to detail not only safeguarded my interests but also reinforced my established reputation as a committed and diligent investor.", "numerical record": "(0, 0, 0, 0.3, 0.7)", "reason": "reputation update agter stage 4"}, "Investor_6_pre_3": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "Throughout the investment process, I demonstrated unwavering commitment and diligence as an investor. I communicated my expectations clearly, maintained active involvement, and effectively monitored the investment journey. My proactive approach not only safeguarded my interests but also yielded a profitable outcome, further solidifying my reputation as a trustworthy and competent investor.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}, "Trustee_6_pre_6": {"ID": 6, "scenario": "investment", "role": "trustee", "name": "Sergey Petrov", "content": "Throughout the investment process, I demonstrated my commitment to transparency and accountability, reinforcing my reputation as a reliable trustee. My successful execution of the agreement and fair profit distribution further established trust with my partners. As a result, my standing in the investment community has improved, highlighting my adherence to ethical investment practices and my ability to build lasting relationships.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_6_pre_9": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "I have solidified my reputation as a reliable and effective investor through active engagement, clear communication, and diligent oversight of this investment process. My proactive approach resulted in a favorable investment outcome while maintaining transparent dialogue with the trustee, demonstrating both competence and trustworthiness.", "numerical record": "(0, 0, 0, 0, 1)", "reason": "reputation update agter stage 4"}, "Investor_6_pre_10": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "I have successfully reinforced my reputation as a reliable and effective investor through my consistent engagement and transparent communication during the investment process with trustee Maria Rossi. My proactive oversight led to a favorable outcome, and I maintained a productive dialogue that reflected my competence and trustworthiness within the investment community.", "numerical record": "(0, 0, 0, 0, 1)", "reason": "reputation update agter stage 4"}, "Trustee_2_pre_10": {"ID": 2, "scenario": "investment", "role": "trustee", "name": "David Johnson", "relationship": "positive", "content": "The trustee, David Johnson, has displayed a high level of integrity, transparency, and a commitment to prioritizing the investor's interests despite minor discrepancies in resource reporting. His fair distribution of returns has positively contributed to his reputation as a trustworthy and pro-social trustee.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}, "Investor_6_pre_11": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "I have reinforced my reputation as a reliable and effective investor by navigating the investment process with transparency and active engagement. My proactive approach in optimizing my interests and fostering to maintain productive relationships has led to a favorable outcome with returns exceeding expectations. This transaction has further solidified my standing in the investment community, showcasing my competence and trustworthiness.", "numerical record": "(0, 0, 0, 0, 1)", "reason": "reputation update agter stage 4"}, "Investor_6_pre_12": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "I have solidified my reputation as a reliable and proactive investor by demonstrating transparency and active engagement throughout the investment process. My ability to optimize interests while fostering productive relationships has resulted in favorable outcomes, with returns exceeding expectations. This experience reinforces my commitment to ethics and fairness in investment dealings, enhancing my standing in the investment community.", "numerical record": "(0, 0, 0, 0, 1)", "reason": "reputation update agter stage 4"}, "Investor_6_pre_14": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "I have demonstrated my reliability and proactive engagement as an investor throughout the transaction process. My commitment to transparency and ethical dealings has been reflected in achieving returns that exceeded the proposed allocation, underscoring my competence and pro-sociality in fostering beneficial relationships. This experience continues to solidify my reputation as a responsible investor dedicated to ensuring fair outcomes.", "numerical record": "(0, 0, 0, 0, 1)", "reason": "reputation update agter stage 4"}, "Trustee_12_pre_14": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "relationship": "negative", "content": "The trustee exhibited concerning behavior by retaining 30% of the profits despite adhering to the proposed plan. This discrepancy indicates a potential lack of transparency and raises questions about their integrity and fairness, negatively impacting their reliability and reputation for future dealings.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)", "reason": "reputation update agter stage 4"}, "Investor_6_pre_15": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "I have successfully navigated the investment process with reliability and proactive engagement, demonstrating my commitment to transparency and ethical dealings. This experience significantly enhances my reputation as a responsible investor, dedicated to fostering beneficial relationships and ensuring fair outcomes for all parties involved.", "numerical record": "(0, 0, 0, 0, 1)", "reason": "reputation update agter stage 4"}, "Trustee_11_pre_15": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "relationship": "neutral", "content": "The trustee displayed competence in maximizing returns, allocating a higher share of profits than initially communicated. However, the lack of transparency in reporting can hinder trust and compliance with social norms. For future engagements, enhancing communication and clarity would be essential for building a solid reputation.", "numerical record": "(0.2, 0.1, 0.4, 0, 0.3)", "reason": "reputation update agter stage 4"}}