{"Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "content": "My reputation as a trustee has been reinforced through my commitment to transparency and adherence to the agreed allocation plan. I ensured that the investor received their fair share of 60% of the profits, demonstrating my trustworthiness and pro-social behavior. I believe this positive experience will promote my integrity and foster future collaborative opportunities.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Investor_16": {"ID": 16, "scenario": "investment", "role": "investor", "name": "Robert Miller", "relationship": "positive", "content": "The investor has shown trustworthy and cooperative behavior, engaging positively with the investment process and adhering to the agreed allocation plan. Despite being new to this interaction, their constructive communication signals a solid foundation for future collaborations. I believe their reliable participation contributes positively to their reputation.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_4": {"ID": 4, "scenario": "investment", "role": "investor", "name": "Sofia Hernandez", "content": "Sofia Hernandez has proven to be a principled investor, prioritizing transparency, fairness, and ethical collaboration in her transactions. She engaged in clear communication regarding expectations and demonstrated a commitment to shared success over personal gain. This approach reinforces her reputation as a reliable and trustworthy investor, highlighting her integrity and cooperative nature.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "positive", "content": "Emma Dubois has exhibited exemplary behavior as a trustee, consistently adhering to ethical practices and prioritizing her investor's interests, even when faced with lower than expected distributions. Her pro-social behavior and integrity throughout the investment process contribute positively to her reputation as a trustworthy trustee, indicating a strong potential for future collaborations.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}}