[{"type": "first-order", "complained ID": "14", "complained name": "Juan Carlos Reyes", "complained role": "investor", "gossiper name": "Sergey Petrov", "gossip info": "Sergey Petrov revealed that Juan Carlos Reyes disregarded the agreed profit distribution and pocketed 80% instead of the agreed 30%. This behavior raises major concerns about his transparency and fairness, leading Sergey to reconsider future collaborations with him.", "credibility level": "credible", "whether to spread gossip second-hand": "Yes", "reasons": "The information comes from a direct source with a reputation that implies reliability. Given the serious nature of the allegations regarding financial misconduct and transparency, it is important to inform others to prevent potential future issues or collaborations with Juan Carlos Reyes. Spreading this gossip could serve to protect other collaborators.", "created_at": 3}, {"type": "first-order", "complained ID": "8", "complained name": "Nadia Novak", "complained role": "investor", "gossiper name": "Aisha Ibrahim", "gossip info": "Aisha Ibrahim expressed dissatisfaction with Nadia Novak’s behavior, noting that she observed Nadia as a trustee who lacked a strong reputation for fairness. However, Nadia recently improved her image by achieving better-than-expected investment outcomes, which has enhanced her reputation. Aisha is excited to see how this positive change affects her future investment opportunities and strengthens existing partnerships.", "credibility level": "credible", "whether to spread gossip second-hand": "No", "reasons": "While Nadia's recent improvement in reputation and investment outcomes make this information interesting, Aisha's feelings of dissatisfaction are subjective. Spreading this gossip could harm Nadia's reputation unnecessarily, especially since she has made significant progress. It is more prudent to withhold this information unless further substantiated.", "created_at": 7}, {"type": "first-order", "complained ID": "4", "complained name": "Sofia Hernandez", "complained role": "investor", "gossiper name": "Aisha Ibrahim", "gossip info": "Aisha Ibrahim has observed significant discrepancies between the investment outcomes reported by a trustee and the actual allocations, which raises serious concerns about their integrity. Although the allocations happened to favor her, Aisha feels it’s wrong to ignore the dishonesty and is considering addressing this issue in the next meeting for accountability and clearer communication. She aims to ensure a trustworthy investment environment for all involved.", "credibility level": "credible", "whether to spread gossip second-hand": "Yes", "reasons": "The information comes from Aisha Ibrahim, who appears concerned about integrity despite benefiting from the discrepancies. Given her intention to address this in a meeting, it indicates seriousness. Spreading this information could support transparency and accountability within the group.", "created_at": 7}, {"type": "second-order", "complained ID": "18", "complained name": "Isabella Costa", "complained role": "trustee", "first-order listener name": "Hannah Muller", "original gossiper name": "Robert Miller", "gossip info": "Robert Miller has raised serious concerns about financial dealings that could impact investors and our reputations. Allocation plans have not been followed, raising red flags about transparency and accountability.", "credibility level": "credible", "gossiper name": "Hannah Muller", "created_at": 7}]