{"Investor_16": {"ID": 16, "scenario": "investment", "role": "investor", "name": "Robert Miller", "content": "During the investment process, I demonstrated open cooperation and clear communication, establishing a foundation of trust and mutual respect. My proactive approach and commitment to understanding the trustee’s strategies reinforced my reputation as an investor who values collaboration and fair dealings. This positive outcome has strengthened my standing within the investment community, positioning me as a respected investor.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "relationship": "positive", "content": "Throughout the investment process, Sofia Hernandez exhibited integrity and fairness, notably exceeding the communicated profit distribution expectations. Her commitment to equitable and proactive resource allocation illustrates her reliability and pro-social behavior. This engagement significantly enhances her reputation as a trustworthy partner for future investments and fosters positive relations in the investment community.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "content": "I have demonstrated a strong commitment to transparency and fairness, adhering to the agreed allocation plan and effectively managing resources, resulting in substantial profits. This reinforces my reputation as a trustworthy and reliable trustee dedicated to collaboration and mutual goals.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "relationship": "positive", "content": "As a first-time investor, Akiko demonstrated a cooperative approach by engaging with the proposed allocation plan and effectively collaborating during the investment stage, suggesting a commitment to building trust and joint success in future transactions.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}}