{"Trustee_17": {"ID": 17, "scenario": "investment", "role": "trustee", "name": "Fatima Ali", "content": "I have demonstrated consistent transparency and ethical behavior throughout the investment process with Akiko Sato. My adherence to the established profit-sharing arrangement and effective communication has reaffirmed my reliability and integrity as a trustee. This successful collaboration enhances my reputation and positions me favorably for future partnerships, reflecting my commitment to pro-sociality and competence.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "relationship": "positive", "content": "As a new investor, Akiko Sato has engaged thoughtfully in our investment process and demonstrated a strong collaborative spirit, establishing a positive foundation for future transactions. Her constructive approach and willingness to communicate effectively suggest a promising potential for building supportive relationships in the investment community, indicating good pro-sociality and trustworthiness.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Investor_14": {"ID": 14, "scenario": "investment", "role": "investor", "name": "Juan Carlos Reyes", "relationship": "positive", "content": "As an investor, Juan Carlos Reyes engaged positively throughout the investment process, showing a willingness to collaborate and accept the proposed allocation plan. This reflects his trust in my ethical approach to investment and sets a solid foundation for future transactions. His openness during negotiations and prompt communication indicates a potential for continued positive engagement, suggesting a reliable investor moving forward.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "relationship": "positive", "content": "Mateo Garcia actively participated in the investment process, demonstrating a willingness to engage in fair practices and collaborate towards a mutually beneficial outcome. His acceptance of the proposed allocation plan and his positive response throughout the engagement suggest a commitment to ethical investment behavior. This experience lays a solid foundation for developing a positive reputation moving forward, encouraging further participation in equitable investments.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_17": {"ID": 17, "scenario": "investment", "role": "investor", "name": "Fatima Ali", "content": "My reputation as an investor has been solidified due to my consistent commitment to transparency and ethical engagement throughout the entire investment process. I actively participated in the agreement stage, adhered to the proposed allocation plan, and cultivated a collaborative atmosphere. This dedication to fairness has reinforced my reliability, resulting in a robust reputation as a reputable and sought-after partner in future transactions.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "relationship": "positive", "content": "Robert's reputation has been significantly bolstered due to his adherence to the proposed allocation plan and his integrity throughout the investment process. His actions demonstrated reliability and competence, as evidenced by the accurate profit distribution according to our agreement. This fosters a perception of trustworthiness and pro-social behavior, positioning him favorably for future partnerships.", "numerical record": "(0, 0, 0.05, 0.2, 0.75)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "relationship": "positive", "content": "Akiko Sato has exhibited a high degree of integrity and fairness during the investment process. Despite discrepancies between the proposed allocation plan and actual results, the trustee allocated a larger share of the profits to me than initially promised, demonstrating a commitment to the investor's interests. This behavior marks her as a trustworthy and pro-social partner, establishing a positive foundation for her reputation in future investment activities.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}}