[{"id": 1, "type": "EVENT", "subject": "Hiroshi Tanaka", "predicate": "investment", "object": "Maria Rossi", "description": ["Failed investment. Investor is Maria Rossi and Trustee is Hiroshi Tanaka.\nRefuse. Without a prior reputation, I cannot trust the trustee to fairly distribute profits, so I prefer to seek a new one."], "created_at": 1}, {"id": 2, "type": "EVENT", "subject": "Hiroshi Tanaka", "predicate": "investment", "object": "David Johnson", "description": ["Failed investment. Investor is David Johnson and Trustee is Hiroshi Tanaka.\nRefuse. Considering the trustee's previous reputation is low and he has already faced rejection, I prefer to seek a more established trustee to ensure my investment is secure."], "created_at": 2}, {"id": 3, "type": "EVENT", "subject": "Hiroshi Tanaka", "predicate": "investment", "object": "Emma Dubois", "description": "Success investment: investor is Hiroshi Tanaka, trustee is Emma Dubois\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '6.0', 'investor': '14.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 3}, {"id": 4, "type": "EVENT", "subject": "Hiroshi Tanaka", "predicate": "investment", "object": "Juan Carlos Reyes", "description": ["Failed investment. Investor is Juan Carlos Reyes and Trustee is Hiroshi Tanaka.\nRefuse. The trustee has a low reputation, indicating a lack of trustworthiness and competence, which raises skepticism regarding the investment opportunity."], "created_at": 4}, {"id": 5, "type": "EVENT", "subject": "Hiroshi Tanaka", "predicate": "investment", "object": "Elena Ivanova", "description": ["Failed investment. Investor is Elena Ivanova and Trustee is Hiroshi Tanaka.\nRefuse. Given the trustee's low reputation and recent history of failed proposals, I cannot trust that this allocation plan will lead to a successful investment."], "created_at": 5}, {"id": 6, "type": "EVENT", "subject": "Hiroshi Tanaka", "predicate": "investment", "object": "Mohammed Al-Farsi", "description": ["Failed investment. Investor is Mohammed Al-Farsi and Trustee is Hiroshi Tanaka.\nRefuse. The trustee's low reputation and recent history of failed proposals raise significant concerns about trustworthiness and competence."], "created_at": 6}]