{"Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "content": "I have further solidified my reputation as a trustworthy and cooperative investor. My proactive communication and commitment to transparency were instrumental in fostering a positive relationship during the investment process. The outcome of 19.2 units, exceeding initial expectations, reflects not only my engagement but also my dedication to building mutually beneficial partnerships. Thus, I continue to be seen as a reliable partner focused on sustainable growth.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "The trustee has shown honesty and fairness during the transaction, exceeding my expectations while adhering to the agreed-upon allocation plan. This reflects a commitment to my interests and integrity in dealings, warranting a positive update to their reputation for reliability and concern for investor well-being.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "positive", "content": "Emma Dubois has shown exceptional integrity and fairness, having accurately reported the investment outcome and distributed resources beyond the initial agreement. Her actions reflect a strong commitment to mutual benefit and trustworthiness, enhancing her reputation as a reliable trustee in the investment environment.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia has established a strong initial reputation as an honest and committed trustee. Her transparency and willingness to exceed the promised allocation to 19.2 units demonstrate her integrity and dedication to the investor's interests. This performance not only fulfills but enhances the trustworthiness and pro-sociality aspects of her role, indicating she is likely to foster fruitful relationships in the future.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}}