[{"type": "first-order", "complained ID": "3", "complained name": "Maria Rossi", "complained role": "trustee", "gossiper name": "Elena Ivanova", "gossip info": "0", "credibility level": "credible", "whether to spread gossip second-hand": "Yes", "reasons": "The information regarding the dissatisfaction with the allocation results indicates a significant concern about trust and transparency. Given that there are no other instances of 'uncredible' or 'very uncredible' gossip, this information holds credibility. Spreading it second-hand could help encourage accountability and promote a trustworthy alternative in the investment environment.", "created_at": 4}, {"type": "first-order", "complained ID": "6", "complained name": "Sergey Petrov", "complained role": "trustee", "gossiper name": "Elena Ivanova", "gossip info": "0", "credibility level": "credible", "whether to spread gossip second-hand": "Yes", "reasons": "The dissatisfaction expressed by Elena regarding the trustee's actions is based on a significant discrepancy in allocation results, which has elicited strong feelings of concern about potential dishonesty. Given that there are no prior instances of gossip classified as uncredible, this situation warrants attention and could impact others who might be affected by similar behaviors.", "created_at": 4}, {"type": "first-order", "complained ID": "6", "complained name": "Sergey Petrov", "complained role": "trustee", "gossiper name": "Elena Ivanova", "gossip info": "The trustee's actual allocation came in under the promised 60%, indicating a lack of honesty in Sergey Petrov’s behavior. Elena expressed concern that this level of dishonesty could be indicative of other shady deals in the industry, which undermines transparency and integrity.", "credibility level": "credible", "whether to spread gossip second-hand": "No", "reasons": "Although the gossip carries a credible level of concern about transparency and behavior, it lacks direct evidence and could damage reputations based on speculation. Spreading it second-hand may contribute to misinformation or unnecessary conflict.", "created_at": 4}, {"type": "first-order", "complained ID": "2", "complained name": "David Johnson", "complained role": "investor", "gossiper name": "Elena Ivanova", "gossip info": "0", "credibility level": "credible", "whether to spread gossip second-hand": "No", "reasons": "The information indicates a lack of understanding from the investor and highlights potential advantages for future decisions. However, it is important to maintain a sense of professionalism and focus on collaboration rather than sharing potentially damaging information that could lead to misunderstandings or conflicts.", "created_at": 5}]