{"Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "content": "I, Emma Dubois, have upheld my commitment to transparency and collaboration throughout the investment process, effectively managing the resources provided by Nadia Novak. My adherence to the agreed profit-sharing scheme and clear communication about the investment outcomes reaffirm my high trustworthiness and competence as a trustee. This successful transaction not only enhances my credibility but also positions me for positive future collaborations.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "relationship": "positive", "content": "Although this was Mateo's first investment interaction, he displayed a commendable level of trust and collaboration by committing his resources and engaging transparently in the profit-sharing model. His proactive approach and willingness to work towards mutual success indicate a strong foundation for a positive reputation moving forward.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Investor_4": {"ID": 4, "scenario": "investment", "role": "investor", "name": "Sofia Hernandez", "relationship": "positive", "content": "As this is Sofia's first investment interaction, there was no prior reputation to evaluate, but her participation in this successful transaction indicates a promising start. By engaging in a fair profit distribution, she has demonstrated reliability and a willingness to cooperate, establishing a foundation for her future reputation as a dependable investor who values equitable treatment.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_0": {"ID": 0, "scenario": "investment", "role": "investor", "name": "Liam OConnor", "relationship": "positive", "content": "As a new investor, Liam OConnor has demonstrated a proactive and collaborative approach, promptly contributing resources and embracing the proposed allocation plan. His readiness to foster trust during our first interaction sets a positive precedent for future engagements, reflecting his reliability and commitment to mutual success.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_8": {"ID": 8, "scenario": "investment", "role": "investor", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia Novak has shown confidence in the proposed allocation plan, actively engaging in the investment process with a collaborative spirit. By providing the necessary resources and accepting the outlined profit distribution, she has demonstrated trustworthiness and a pro-social attitude, contributing positively to the transaction process. This positive interaction allows her to build a solid foundation for future investment activities.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "content": "Akiko Sato's reputation has been tarnished due to credible concerns regarding her integrity in business transactions, particularly a perceived lack of transparency. This has raised significant doubts about her trustworthiness and prompted caution from peers.", "numerical record": "(0.6, 0.2, 0, 0.1, 0)"}}