{"Investor_11_pre_3": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "Throughout the investment process, I exhibited transparency and a strong commitment to collaboration, which fostered a positive environment for our transaction. I trusted the trustee's proposed allocation plan and engaged positively, despite the allocation exceeding initial expectations. My behavior of nurturing equitable partnerships reflects my strong reputation as a reliable investor. I prioritize trustworthiness, pro-sociality, and norm compliance in my dealings, establishing myself as a solid partner in the investment community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Trustee_11_pre_4": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "content": "Throughout this transaction, I have demonstrated a strong commitment to transparency and equitable profit distribution, which reinforces my reputation for reliability. My adherence to the agreed allocation plan and successful delivery of profits underscores my trustworthiness and competence as a trustee. This successful engagement not only affirms my dedication to nurturing trustworthy partnerships but also strengthens my reputation within the investment community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_11_pre_5": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "I have maintained a strong reputation as a reliable investor committed to transparency, collaboration, and equitable partnerships. My positive engagement during the investment process, despite an unexpected allocation, showcases my trustworthiness, pro-sociality, and adherence to principles. I prioritize cultivating trust in partnerships, which has solidified my standing in the investment community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}}