{"Investor_11": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "I continue to maintain a strong reputation as a trustworthy investor, showcasing my commitment to transparency, collaboration, and equitable partnerships. My ability to engage positively, even in the face of unexpected changes during allocation, further solidifies my standing in the investment community. I have demonstrated pro-social behavior by prioritizing trust and successful outcomes in partnerships, thus enhancing my reputation.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "relationship": "positive", "content": "Isabella demonstrated exceptional commitment to integrity and fairness during the investment period. She effectively matched reported resources with outcomes, ensuring a transparent distribution process that favored my interests. This behavior signifies her reliability and supportive character, thereby enhancing her positive reputation in the investment ecosystem. Her adherence to pro-social values and compliance with social norms establishes her as a trustworthy and competent trustee.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "content": "Throughout this transaction, I have further solidified my reputation as a reliable and trustworthy trustee. My commitment to transparency and equitable profit distribution has been evident, and my successful delivery of anticipated profits has reinforced my competence in managing investments. The positive outcomes of this collaboration with James Wang highlight my dedication to fostering strong partnerships founded on mutual trust and respect, making me a well-regarded figure within the investment community.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "relationship": "positive", "content": "This was my first interaction with Mateo, who demonstrated prompt engagement and a willingness to adhere to the proposed terms. Their trust in my management reflects positively on their reputation as a reliable investor. The successful receipt of profits and commitment to collaboration bodes well for Mateo's capacity to build future partnerships, suggesting a commendable level of trustworthiness and pro-social behavior.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "negative", "content": "The trustee's significant deviation from the agreed-upon profit distribution has led to concerns regarding their honesty and integrity. The lack of prior reputation compounds these concerns, signaling potential issues in transparency and compliance. This transaction negatively impacts their standing within the investment community as there are serious questions about their ability to manage trust effectively.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Investor_5": {"ID": 5, "scenario": "investment", "role": "investor", "name": "James Wang", "relationship": "positive", "content": "As a first-time investor, James Wang has exhibited a positive approach toward our collaborative investment effort. His willingness to engage openly and adhere to the proposed allocation plan reflects a constructive mindset essential for building successful partnerships. This favorable first interaction lays a strong foundation for future collaborations, enhancing his reputation as a trustworthy investor in the investment community.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Trustee_2": {"ID": 2, "scenario": "investment", "role": "trustee", "name": "David Johnson", "relationship": "negative", "content": "The trustee, David Johnson, has displayed concerning behavior during this investment transaction, marked by a significant deviation from the agreed-upon allocation plan. Although the reported investment outcomes were accurate, the reduction in my promised share undermines trust and raises questions about his integrity and fairness. This behavior reflects poorly on his reputation and necessitates improvement in consistency and transparency moving forward.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}}