{"Investor_2": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "David Johnson is recognized as a savvy and ambitious investor, showcasing a strong assertive approach during the investment process. His effective utilization of resources and clear understanding of negotiation terms positively impacts his reputation. He is deemed trustworthy, competent, and compliant with social norms, making him a respected figure in the investment community.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "relationship": "neutral", "content": "Akiko Sato's reputation is faced with challenges due to inconsistencies in resource allocation and lack of transparency, despite adhering to the proposed allocation plan. This behavior raises concerns about her reliability in potential future transactions. Therefore, she is viewed as moderately trustworthy and competent, with a need for improvement in norm compliance and pro-social behavior.", "numerical record": "(0.3, 0.2, 0.3, 0, 0.2)"}, "Trustee_2": {"ID": 2, "scenario": "investment", "role": "trustee", "name": "David Johnson", "content": "My reputation as a trustee has further improved due to the successful implementation of our investment agreement with Isabella Costa. I adhered closely to the proposed allocation plan, demonstrated reliability and transparency in profit distribution, and effectively managed resources throughout the process. This success not only benefits me but also the investor, reinforcing my competence in managing investments and fulfilling financial obligations.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "relationship": "positive", "content": "As this was Isabella Costa's first interaction in an investment capacity, her reputation reflects potential and openness to collaboration. Throughout the process, she was engaged and trusting, contributing positively to the partnership's outcome. Her willingness to invest demonstrates a commitment to mutual benefit and lays a solid foundation for a future relationship based on trust and accountability.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}}