{"Investor_8": {"ID": 8, "scenario": "investment", "role": "investor", "name": "Nadia Novak", "content": "Nadia Novak has demonstrated her capability as a decisive and ambitious investor, effectively leveraging resources to engage in fruitful transactions. Her ability to secure favorable returns reinforces her reputation as a goal-oriented individual, making her a reliable participant in investment activities. Her proactive approach to refining strategies for maximum gain indicates a high level of competence and pro-sociality in the investment community.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "relationship": "positive", "content": "Isabella Costa has shown a commendable performance as a trustee, successfully aligning with the investment goals and ensuring a profit distribution that benefitted the investor. Her ability to maintain a fair allocation plan and exhibit responsible management of resources speaks to her trustworthiness and competence. Though she retained slightly more than proposed, the overall outcome reflects her integrity, marking her as a potentially trustworthy partner for future collaborations.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "content": "My commitment to transparency and equitable practices during the investment process has reinforced my reputation as a trustworthy and reliable trustee. Adhering strictly to the agreed allocation plan and fairly distributing profits demonstrate my competence and dedication to pro-social behavior. I have underscored the importance of maintaining open communication and fostering long-term partnerships based on fairness, which further strengthens my position within the investment community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_11": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "relationship": "neutral", "content": "As this was our first collaboration, Aisha Ibrahim does not yet have an established reputation. However, her willingness to engage in the investment process and trust in the proposed allocation plan suggest a commitment to being a responsible investor. The successful conclusion of this transaction positions her favorably for future collaborations, potentially developing her reputation as a conscientious investor over time.", "numerical record": "(0.2, 0.2, 0.2, 0.2, 0.2)"}}