{"Investor_11": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "During the investment process, I demonstrated trustworthiness and a commitment to equitable resource sharing. I maintained transparency and collaboration, adhering to the proposed allocation plan. My engagement emphasized mutual success, and my slight advantage in resource allocation did not compromise my dedication to fairness. This behavior enhances my reputation as a trustworthy and pro-social investor.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "positive", "content": "The trustee exhibited integrity throughout the investment process, adhering to the agreed terms while also ensuring that my interests were prioritized. Their honest communication and compliance with the proposed allocation plan fostered trust. By managing the investment successfully and upholding pro-social behavior, Mateo's reputation has been significantly enhanced as a reliable and competent trustee.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "content": "After the recent rejection of the allocation plan due to potential blacklist issues, my reputation has taken a hit. Although I have previously been recognized for my trustworthiness and competence, this incident raises concerns about my capability to establish effective and agreeable plans with investors. As I had no allocation plan to propose, it highlights the possibility of reputational impact from prior relationships. I now have to work harder to regain trust and enhance my cooperation skills in future transactions.", "numerical record": "(0.3, 0.2, 0.3, 0.1, 0.1)"}, "Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "relationship": "positive", "content": "Isabella demonstrated trust and a willingness to engage in a transparent partnership during our first investment transaction. Her acceptance of my proposed allocation plan reflects her positive disposition towards equitable profit sharing, indicating a pro-social attitude. As this was her initial foray into investment, I believe her reputation as an investor will develop positively with future engagements, supporting the community's collaborative spirit.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_10": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "relationship": "positive", "content": "As a first-time investor, Mohammed Al-Farsi has demonstrated a willingness to engage in a transparent and fair investment process. His acceptance of the proposed profit distribution plan reflects his openness to collaboration and commitment to mutual success. Establishing a bidirectional connection highlights his proactive approach towards building relationships within the investment community. This positive initial interaction lays a strong foundation for future engagements, enhancing his reputation as a reliable and collaborative investor.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_2": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "relationship": "negative", "content": "Following the rejection of the allocation plan, David Johnson's reputation has shifted negatively. Despite his initial positive impression and willingness to engage in investment, this incident suggests a breakdown in mutual trust and could indicate reluctance to collaborate with me in the future. His connection status, though still maintained, may be adversely affected if this situation is perceived as a sign of misalignment in investment objectives.", "numerical record": "(0.6, 0.1, 0.1, 0.1, 0.1)"}}