{"Investor_8": {"ID": 8, "scenario": "investment", "role": "investor", "name": "Nadia Novak", "content": "Throughout the investment process, I have demonstrated a strong commitment to maximizing returns while actively communicating and collaborating with my trustee. My proactive involvement and successful profit distribution have reinforced my reputation as a strategic, trustworthy investor committed to fostering effective partnerships.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_14": {"ID": 14, "scenario": "investment", "role": "trustee", "name": "Juan Carlos Reyes", "relationship": "negative", "content": "The trustee, Juan Carlos Reyes, proposed an initially equitable allocation plan but ultimately failed to adhere fully to the agreed terms during the profit distribution. The misalignment between the expected and actual returns raised significant concerns regarding his trustworthiness and integrity. While the distribution was technically balanced, the lack of transparency and fairness has negatively impacted his reputation, marking him as unreliable in the eyes of investors.", "numerical record": "(0.5, 0.3, 0.2, 0, 0)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "content": "Due to credible concerns about significant allocation discrepancies and lack of communication, Akiko Sato's reputation has diminished. Trustworthiness and pro-sociality are now questioned, impacting her standing in the community.", "numerical record": "(0.4, 0.3, 0.2, 0, 0.1)"}, "Trustee_3": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "relationship": "positive", "content": "Maria Rossi has exhibited exceptional integrity, fairness, and transparency during the investment process. Her adjustments to profit distribution benefitted me and showcased her commitment to my interests, reinforcing her reputation as a credible and reliable trustee for future engagements.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "positive", "content": "Emma has showcased a strong level of integrity and fairness during the investment process. Her alignment of the actual allocation results with the proposed plan, along with exceeding expectations in profit distribution, has solidified her reputation as a reliable and trustworthy trustee. Her transparent communication further underscores her commitment to maximizing investor returns.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "content": "My reputation as a trustee has strengthened further due to my consistent adherence to ethical practices throughout the investment process. I successfully executed the agreed-upon allocation plan and ensured transparent profit distribution, which underlined my transparency and accountability. The successful and fair return for the investor reflects my competence in managing investments, affirming my standing as a reliable and responsible trustee in the investment community.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Investor_1": {"ID": 1, "scenario": "investment", "role": "investor", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "Despite being new to our collaboration, Hiroshi Tanaka's willingness to engage in a fair profit-sharing agreement and his promptness in providing capital demonstrate a commitment to transparency and success. This initial positive interaction suggests a promising foundation for a long-term, collaborative relationship, indicating both trustworthiness and pro-social behavior.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "relationship": "positive", "content": "Although this was their first investment experience, Mateo Garcia demonstrated commendable trust and collaboration throughout the process. His willingness to invest initially and adherence to the investment terms were key in achieving a successful outcome. This proactive engagement suggests a solid foundation for a positive reputation, indicating that he can foster constructive relationships in the investment community moving forward.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}}