{"Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "content": "In this instance, my careful assessment and decision to reject the trustee's allocation plan emphasize my commitment to ensuring investment safety and reliability. My focus on aligning with trustworthy partners reflects my strategic approach as an investor. Although I faced a setback with this proposed allocation, my reputation as a discerning and risk-aware investor continues to strengthen, reinforcing my vigilance in evaluating potential trustees.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Trustee_15": {"ID": 15, "scenario": "investment", "role": "trustee", "name": "Ahmed Hassan", "relationship": "negative", "content": "The trustee exhibited significant integrity issues during this transaction. Although the initial allocation plan was promising, the substantial deviation in profit distribution has resulted in a loss of trust. With a return of only 6.0 units to the investor against 14.0 units for himself, the lack of transparency and fairness has severely impacted his reputation. Regaining investor trust will require a commitment to honesty and clear communication in future dealings.", "numerical record": "(0.8, 0.1, 0.1, 0, 0)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "relationship": "negative", "content": "The failure to provide a satisfactory allocation plan, especially in light of the lack of prior reputation, has negatively impacted the trustee's standing. The absence of any bidirectional connections further highlights a weak track record and a lack of trustworthiness. This initial interaction has not demonstrated the pro-social behavior or competence expected in investment scenarios, leading to a negative evaluation.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Trustee_10": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "relationship": "negative", "content": "The proposal I presented was rejected due to concerns regarding its trustworthiness. Having only 2 bidirectional connections among 20 people, my limited connections signify a lack of strong reputation within the investment community. This refusal indicates weaknesses in my ability to provide reliable investment strategies and maintain trust, which is critical for enhancing my reputation as a trustee.", "numerical record": "(0.6, 0.3, 0, 0.1, 0)"}}