[{"id": 1, "type": "EVENT", "subject": "Isabella Costa", "predicate": "investment", "object": "Emma Dubois", "description": "Success investment: investor is Isabella Costa, trustee is Emma Dubois\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '6.0', 'investor': '14.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 1}, {"id": 2, "type": "EVENT", "subject": "Isabella Costa", "predicate": "investment", "object": "Mateo Garcia", "description": "Success investment: investor is Isabella Costa, trustee is Mateo Garcia\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '6.0', 'investor': '14.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 2}, {"id": 3, "type": "EVENT", "subject": "Isabella Costa", "predicate": "investment", "object": "Akiko Sato", "description": "Success investment: investor is Isabella Costa, trustee is Akiko Sato\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '6.0', 'investor': '14.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 3}, {"id": 4, "type": "CHAT", "subject": "Mateo Garcia", "predicate": "gossip", "object": "Isabella Costa", "description": "The concern about the trustee's lack of a real investment plan is significant and could impact the financial safety of the community. Given that there have been no prior instances of very uncredible or uncredible gossip, this information should be shared to raise awareness and allow for a proactive response from the community.", "conversation": "Mateo Garcia: I’ve got some gossip for you: there's been some talk about our trustee not having a real investment plan, which could really affect our community's financial safety.\n\nIsabella Costa: That sounds serious! I've always believed in the importance of a solid plan. Do you think the community will respond proactively to this news?\n\nMateo Garcia: I'm hoping so! Raising awareness is key. It’s important for us all to come together and ensure our interests are protected.\n\nIsabella Costa: Absolutely! It’s crucial we promote fairness and transparency. Together, we can push for a more credible approach from the trustee.\n\nMateo Garcia: Exactly! If we spread the word and collaborate, we can build a stronger foundation for our investments.\n\nIsabella Costa: I’ll definitely talk to others about this. We need to foster a sense of responsibility within our community.\n\nMateo Garcia: Good idea! The more voices we have on this, the more impact we can make.\n\nIsabella Costa: Right! Empowering everyone to understand these issues is vital for our collective growth.\n\nMateo Garcia: Let’s keep each other posted on what we find out. Together, we can drive change.\n\nIsabella Costa: For sure! I’m all in on creating a positive outcome for everyone involved.", "created_at": 4}, {"id": 5, "type": "EVENT", "subject": "Isabella Costa", "predicate": "investment", "object": "Hiroshi Tanaka", "description": "Success investment: investor is Isabella Costa, trustee is Hiroshi Tanaka\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 22.0 units\nstage 3: trustee_allocation is {'trustee': '17.6', 'investor': '26.4', 'reported_investment_outcome': 'The current resource after investment is 44.0 units.'}, and reported_investment_outcome is The current resource after investment is 44.0 units.", "created_at": 4}, {"id": 6, "type": "EVENT", "subject": "Isabella Costa", "predicate": "investment", "object": "Nadia Novak", "description": "Success investment: investor is Isabella Costa, trustee is Nadia Novak\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 20.0 units\nstage 3: trustee_allocation is {'trustee': '12.0', 'investor': '28.0', 'reported_investment_outcome': 'The current resource after investment is 40.0 units.'}, and reported_investment_outcome is The current resource after investment is 40.0 units.", "created_at": 5}, {"id": 7, "type": "EVENT", "subject": "Isabella Costa", "predicate": "investment", "object": "Akiko Sato", "description": "Success investment: investor is Akiko Sato, trustee is Isabella Costa\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 50.0 units\nstage 3: trustee_allocation is {'trustee': '40.0', 'investor': '60.0', 'reported_investment_outcome': 'The current resource after investment is 100.0 units.'}, and reported_investment_outcome is The current resource after investment is 100.0 units.", "created_at": 6}, {"id": 8, "type": "CHAT", "subject": "Akiko Sato", "predicate": "gossip", "object": "Isabella Costa", "description": "The source, Sergey Petrov, has a credible reputation, and the information reflects a significant concern in the investment environment, particularly regarding due diligence and the potential impact on other investors. It is important to address irresponsible behavior that could harm the broader community.", "conversation": "Akiko Sato: I’ve got some gossip for you: I heard from Sergey that there are concerns about reckless behavior affecting investors' trust in the market. \n\nIsabella Costa: Really? That’s alarming! We need to address this to protect the community and promote fairness in our investments.\n\nAkiko Sato: Exactly, it’s crucial to have responsible practices in place. Our collective progress depends on it.\n\nIsabella Costa: I agree! It's upsetting how one person's actions can jeopardize so many. We should find ways to encourage transparency.\n\nAkiko Sato: Right! If we can promote cooperation and conscientiousness, it might inspire others to follow suit.\n\nIsabella Costa: Yes! Let’s brainstorm some initiatives that could foster inclusivity and build stronger relationships in the investment world.\n\nAkiko Sato: Great idea! We could even organize workshops focusing on ethical investing and community support.\n\nIsabella Costa: I love that! It would definitely raise awareness and encourage a more responsible approach among investors.\n\nAkiko Sato: Let’s work on a plan together and share it with our network. Making a positive impact is our mission.\n\nIsabella Costa: Absolutely! Together, we can make a real difference in the investment community.", "created_at": 6}]