{"Investor_6": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "content": "My reputation as an investor has been significantly enhanced through this recent transaction. I demonstrated strong diligence in evaluating the trustee’s allocation plan and actively engaged throughout the investment process. The receipt of a higher-than-expected profit share (12.0 units instead of 10.0) underscores my capacity for strategic decision-making and adaptability. My commitment to ethical and transparent interactions has positioned me favorably within the investment community, likely leading to more successful collaborations in the future.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_14": {"ID": 14, "scenario": "investment", "role": "trustee", "name": "Juan Carlos Reyes", "relationship": "negative", "content": "The trustee's behavior during this investment was marked by a lack of integrity and transparency, as they received a disproportionate share of profits compared to what was agreed. This breach of trust significantly tarnished their reputation, highlighting concerns around their adherence to norms and reliability. Their previous standing is non-existent, but this transaction clearly leads to a negative perception based on this incident.", "numerical record": "(0.8, 0.1, 0.1, 0, 0)"}, "Trustee_3": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "relationship": "positive", "content": "Maria Rossi displayed commendable integrity and reliability during our investment process. Her commitment to providing a fair allocation plan and distributing profits fairly has laid a strong foundation for her reputation as a trustworthy and competent trustee. The unexpected favorability of the profit distribution aligns well with a pro-social approach, demonstrating her genuine interest in her investors' benefits. This positive experience fosters confidence in her abilities for future investments.", "numerical record": "(0, 0, 0.1, 0, 0.9)"}, "Trustee_6": {"ID": 6, "scenario": "investment", "role": "trustee", "name": "Sergey Petrov", "content": "My reputation has significantly strengthened following the successful investment process with Akiko Sato. I adhered strictly to the agreed allocation plan, ensured transparent communication, and distributed profits accurately. This commitment to ethical practices and transparent operations positions me as a trustworthy and competent trustee.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "relationship": "neutral", "content": "Although Akiko Sato does not have a prior reputation, their enthusiasm and engagement during the investment process are encouraging. Their collaboration on the allocation plan and trust in our agreement suggest a potential for establishing a positive reputation in future investments.", "numerical record": "(0.3, 0.3, 0.2, 0.2, 0)"}, "Trustee_15": {"ID": 15, "scenario": "investment", "role": "trustee", "name": "Ahmed Hassan", "relationship": "positive", "content": "Ahmed Hassan has established a commendable reputation as a trustee through this investment process. His adherence to the proposed allocation plan and the distribution of profits that exceeded initial expectations demonstrate his integrity and commitment to the investor’s interests. This behavior not only reflects his trustworthiness but also positions him positively for future engagements. His transparent communication and ethical practices are critical factors that will likely enhance his reputation within the investment community.", "numerical record": "(0.1, 0, 0, 0.2, 0.7)"}}