{"Investor_7": {"ID": 7, "scenario": "investment", "role": "investor", "name": "Hannah Muller", "content": "Hannah has successfully demonstrated her capabilities as a disciplined and goal-oriented investor, exhibiting effective communication and a strong commitment to transparency with her trustee, Isabella. Her adeptness at securing a favorable return of 12.0 units solidifies her reputation as a trustworthy and ethical investor who prioritizes mutual benefit throughout the transaction process.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "relationship": "negative", "content": "Robert has shown a marked lack of integrity throughout the investment transaction. Despite proposing a fair allocation plan, the execution of the investment resulted in an unequal distribution which breached their initial agreement. This dishonesty and unfairness significantly diminish his reputation, marking him as unreliable and untrustworthy.", "numerical record": "(0.6, 0.3, 0.1, 0, 0)"}, "Trustee_7": {"ID": 7, "scenario": "investment", "role": "trustee", "name": "Hannah Muller", "content": "My behavior throughout the investment process has demonstrated a high level of trustworthiness, ethical standards, and a commitment to mutual benefit. By adhering to the agreed allocation plan and providing transparent reporting, I have reinforced my reputation as a reliable trustee. My previous performance has led to a good reputation, which I aim to continue by maintaining trustworthy practices in future transactions.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Investor_1": {"ID": 1, "scenario": "investment", "role": "investor", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "As a new participant in this investment, Hiroshi has displayed a collaborative spirit and a readiness to trust the process by engaging with my proposed allocation plan. Their prompt provision of resources reflects a willingness to cooperate and a positive attitude towards building a relationship. Although they do not have a previous reputation, their behavior during this transaction suggests a foundation for a strong partnership moving forward.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "relationship": "positive", "content": "Isabella Costa has exemplified commendable integrity and fairness by adhering to the proposed allocation plan and demonstrating a strong commitment to her investor's interests during the profit distribution. Her decision to prioritize Hannah's financial outcomes enhances her reputation as a responsible and ethical trustee, highlighting her trustworthiness and pro-sociality in future engagements.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "content": "Emma Dubois's reputation has been negatively impacted due to credible concerns raised about her deviation from the original investment allocation plan and suspicions regarding fairness and integrity. While her reported investment outcomes align with actual results, the questions about her accountability and intentions have started to diminish her trustworthiness within the community.", "numerical record": "(0.4, 0.2, 0.3, 0, 0.1)"}}