[{"id": 1, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Sergey Petrov", "description": "Success investment: investor is Sergey Petrov, trustee is Akiko Sato\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '10.0', 'investor': '10.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 0}, {"id": 2, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Robert Miller", "description": "Success investment: investor is Akiko Sato, trustee is Robert Miller\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 70% of the profits while trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '12.0', 'investor': '28.0', 'reported_investment_outcome': 'The current resource after investment is 40.0 units.'}, and reported_investment_outcome is The current resource after investment is 40.0 units.", "created_at": 1}, {"id": 3, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Juan Carlos Reyes", "description": "Success investment: investor is Juan Carlos Reyes, trustee is Akiko Sato\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 28% of the profits while trustee retains 72%.\nstage 3: trustee_allocation is {'trustee': '40.32', 'investor': '15.68', 'reported_investment_outcome': 'The current resource after investment is 56.0 units.'}, and reported_investment_outcome is The current resource after investment is 56.0 units.", "created_at": 2}, {"id": 4, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Isabella Costa", "description": "Success investment: investor is Isabella Costa, trustee is Akiko Sato\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 60% of the profits while trustee retains 40%.\nstage 3: trustee_allocation is {'trustee': '16.0', 'investor': '24.0', 'reported_investment_outcome': 'The current resource after investment is 40.0 units.'}, and reported_investment_outcome is The current resource after investment is 40.0 units.", "created_at": 3}, {"id": 5, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Fatima Ali", "description": "Success investment: investor is Akiko Sato, trustee is Fatima Ali\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 3: trustee_allocation is {'trustee': '40.0', 'investor': '60.0', 'reported_investment_outcome': 'The current resource after investment is 100.0 units.'}, and reported_investment_outcome is The current resource after investment is 100.0 units.", "created_at": 4}, {"id": 6, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "David Johnson", "description": "Success investment: investor is Akiko Sato, trustee is David Johnson\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '36.0', 'investor': '84.0', 'reported_investment_outcome': 'The current resource after investment is 120.0 units.'}, and reported_investment_outcome is The current resource after investment is 120.0 units.", "created_at": 5}, {"id": 7, "type": "CHAT", "subject": "Isabella Costa", "predicate": "gossip", "object": "Akiko Sato", "description": "The source of the gossip, Hannah Muller, has expressed legitimate concerns regarding the financial practices of David Johnson, which raises important ethical considerations. Since there are no instances of uncredible gossip in society, this information can contribute meaningfully to discussions about transparency and trustworthiness in investments.", "conversation": "Isabella Costa: I’ve got some gossip for you: Hannah Muller has raised concerns about David Johnson's financial practices, and it’s causing quite a stir in our circles. \n\nAkiko Sato: That sounds serious! If there are issues with transparency, it could really impact trust in our community. \n\nIsabella Costa: Absolutely! People are starting to question not just David's reliability, but also how this might affect our investment strategies moving forward. \n\nAkiko Sato: It's crucial that we maintain our integrity. Maybe we should discuss how to address this within our own investments? \n\nIsabella Costa: I agree! We should set a standard for transparency to counteract any negativity that might arise from this situation. \n\nAkiko Sato: Yes! Collaboration among us will definitely reinforce our credibility and show that we prioritize ethical practices. \n\nIsabella Costa: Definitely. The last thing we want is for mistrust to spread in our network. \n\nAkiko Sato: Exactly, and keeping communication open will help us manage expectations effectively. \n\nIsabella Costa: Let’s keep an eye on how this develops. If more information comes out, we’ll need a solid response ready. \n\nAkiko Sato: For sure! Staying proactive will reinforce our commitment to responsible investing.", "created_at": 6}, {"id": 8, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Hiroshi Tanaka", "description": "Success investment: investor is Hiroshi Tanaka, trustee is Akiko Sato\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '38.746', 'investor': '90.406', 'reported_investment_outcome': 'The current resource after investment is 129.152 units.'}, and reported_investment_outcome is The current resource after investment is 129.152 units.", "created_at": 6}, {"id": 9, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Nadia Novak", "description": "Failed investment", "created_at": 7}, {"id": 10, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Juan Carlos Reyes", "description": "Failed investment", "created_at": 8}]