{"Investor_11": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "During the investment process, I demonstrated trustworthiness and a commitment to equitable resource sharing. I maintained transparency and collaboration, adhering to the proposed allocation plan. My engagement emphasized mutual success, and my slight advantage in resource allocation did not compromise my dedication to fairness. This behavior enhances my reputation as a trustworthy and pro-social investor.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "positive", "content": "The trustee exhibited integrity throughout the investment process, adhering to the agreed terms while also ensuring that my interests were prioritized. Their honest communication and compliance with the proposed allocation plan fostered trust. By managing the investment successfully and upholding pro-social behavior, Mateo's reputation has been significantly enhanced as a reliable and competent trustee.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "content": "During the investment process, I exhibited high trustworthiness and pro-sociality by providing a fair allocation plan that favored the investor with 70% of the profits. The successful outcome of the investment and my adherence to the agreement demonstrate my competence and reliability. My actions throughout reflect a commitment to transparency and fairness, enhancing my reputation as a trustworthy trustee who values collaboration and equitable resource sharing.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "relationship": "positive", "content": "Isabella demonstrated trust and a willingness to engage in a transparent partnership during our first investment transaction. Her acceptance of my proposed allocation plan reflects her positive disposition towards equitable profit sharing, indicating a pro-social attitude. As this was her initial foray into investment, I believe her reputation as an investor will develop positively with future engagements, supporting the community's collaborative spirit.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}}