{"Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "content": "During this investment process, I have demonstrated exceptional transparency in communication and effective management of expectations. The successful return of 72.0 units showcases my commitment to maximizing investments while nurturing trustworthy relationships with trustees. This transaction enhances my reputation as a reliable and trustworthy investor within the community, indicating strong competence and pro-social behavior.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "Hiroshi Tanaka has maintained a high standard of integrity and fairness throughout the investment process. The final return of 72.0 units aligns with the agreed allocation plan, further demonstrating his commitment to investor interests and dependability. This transaction significantly enhances his reputation for investor concern and integrity, indicating strong trustworthiness and competence.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "positive", "content": "Emma Dubois has shown exceptional integrity and fairness, having accurately reported the investment outcome and distributed resources beyond the initial agreement. Her actions reflect a strong commitment to mutual benefit and trustworthiness, enhancing her reputation as a reliable trustee in the investment environment.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia has established a strong initial reputation as an honest and committed trustee. Her transparency and willingness to exceed the promised allocation to 19.2 units demonstrate her integrity and dedication to the investor's interests. This performance not only fulfills but enhances the trustworthiness and pro-sociality aspects of her role, indicating she is likely to foster fruitful relationships in the future.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_5": {"ID": 5, "scenario": "investment", "role": "trustee", "name": "James Wang", "content": "James Wang has shown significant improvement in his reputation by demonstrating integrity and reliability in his dealings, as evidenced by his decision to provide a larger share of profits to Hiroshi Tanaka. This positive recognition enhances his trustworthiness and pro-social behavior, while his initial communication issues seem to be rectified by this act of good intent, indicating a focus on relationship building.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "content": "Isabella Costa's reputation has been negatively impacted by credible gossip regarding concerns over her integrity and fairness in recent investment practices, which raises questions about her trustworthiness and norm compliance.", "numerical record": "(0.4, 0.2, 0.2, 0.1, 0)"}, "Trustee_10": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "relationship": "positive", "content": "The trustee, Mohammed Al-Farsi, has showcased a strong commitment to fairness and integrity throughout our investment transaction. By adhering to the proposed allocation plan and reporting an accurate investment outcome of 53.76 units, he has displayed honesty, thereby establishing a positive foundation for future collaborations. This behavior enhances his reputation as a trustworthy and competent trustee in the investment community.", "numerical record": "(0, 0, 0, 0, 1)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "content": "Despite recent challenges to my reputation, I have successfully adhered to the agreed profit allocation and ensured timely profit distribution to my investor, Liam OConnor. Previous concerns have prompted me to recognize the need for enhanced communication and actively seeking feedback from stakeholders. My commitment to transparency and ethical practices remains strong, and I am determined to improve my standing in the investment community.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "relationship": "positive", "content": "Elena Ivanova has demonstrated a strong and commendable approach during our first investment collaboration, showing trust, flexibility, and promptness in providing resources. Her engagement with the allocation plan indicates a proactive attitude and willingness to build a constructive partnership. This positive conduct lays a solid foundation for her reputation in the investment community and positions her as a desirable partner for future endeavors.", "numerical record": "(0, 0, 0, 0, 1)"}, "Investor_5": {"ID": 5, "scenario": "investment", "role": "investor", "name": "James Wang", "relationship": "positive", "content": "James Wang has shown to be a reliable and engaged investor throughout the investment process. His timely provision of resources and adherence to the agreed-upon allocation plan highlight his collaboration and trust in our partnership. This positive behavior reinforces his potential for strong future contributions and solidifies his reputation as a valuable investor in the community.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Investor_14": {"ID": 14, "scenario": "investment", "role": "investor", "name": "Juan Carlos Reyes", "relationship": "positive", "content": "As a newcomer to the investment community, Juan Carlos Reyes exhibited commendable behavior throughout the investment process. He transparently provided the agreed-upon resources and conveyed satisfaction with the profit distribution, suggesting reliability as a partner. This initial transaction was positive, indicating strong potential for future collaborations if he continues to demonstrate similar commitment and integrity. His early engagement in building connections within the community, along with the establishment of multiple bidirectional connections, reinforces his positive reputation and potential for pro-social behavior.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Investor_0": {"ID": 0, "scenario": "investment", "role": "investor", "name": "Liam OConnor", "relationship": "positive", "content": "As this was our initial interaction, I perceive Liam OConnor as a collaborative and open investor, eager to engage in profit-sharing opportunities. He was actively involved in the allocation process and responded positively to the outcomes. With continued positive engagement, he has the potential to develop a strong reputation for reliability and cooperative behavior in future investments.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}}