{"Trustee_10_pre_2": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "content": "I have demonstrated trustworthiness by adhering to the allocation plan and transparently distributing profits, reflecting pro-sociality and competence in my role. My commitment to social responsibility has reinforced my reputation, making me a reliable partner for investors.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Trustee_10_pre_4": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "content": "I have maintained a responsible and transparent approach throughout the investment process. By adhering to the agreed allocation plan and achieving a fair distribution of profits (12.8 units for me and 19.2 units for the investor), I have demonstrated my commitment to pro-social outcomes. My consistent behavior in delivering results and communicating clearly has bolstered my reputation as a trustworthy and competent trustee, making me a preferred partner for future investments.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_15_pre_4": {"ID": 15, "scenario": "investment", "role": "investor", "name": "Ahmed Hassan", "relationship": "positive", "content": "As a first-time investor, Ahmed Hassan has shown great potential through his willingness to engage in a transparent and equitable investment process. His readiness to trust my management and collaborate indicates a positive attitude towards mutual benefit, which bodes well for future interactions. Although he does not have an established reputation yet, this initial positive experience suggests he may cultivate a strong reputation moving forward.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_10_pre_5": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "content": "My behavior throughout the investment process has reinforced my commitment to strategic and equitable partnerships. I engaged transparently with Aisha, adhering closely to our agreed-upon plan and demonstrating a collaborative approach. The successful outcome of our investment has further confirmed my focus on nurturing beneficial long-term relationships over short-term profits. With these actions, my reputation is now characterized by high trustworthiness and pro-sociality, positioning me favorably for future investments.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)", "reason": "reputation update agter stage 4"}, "Investor_10_pre_6": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "content": "My recent investment transaction with trustee Ahmed Hassan has further solidified my reputation as a trustworthy and pro-social investor. My commitment to transparency and collaboration throughout the process resulted in a successful profit distribution that exceeded the initial expectations. This experience enhances my standing, reflecting my ability to nurture equitable partnerships and promote a positive investment environment. As such, my reputation is characterized by high trustworthiness, pro-social behavior, and competence in managing investor relationships.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 1"}, "Investor_10_pre_7": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "content": "My recent rejection of trustee Hiroshi Tanaka's allocation plan, due to concerns over his low reputation and a history of failed proposals, has affected my standing. While I maintain my commitment to transparency and collaboration, this incident indicates a cautious approach towards partnerships with lesser-reputed trustees. My reputation remains characterized by high trustworthiness and pro-social behavior, but the situation highlights my vigilance in ensuring equitable and competent investment practices.", "numerical record": "(0, 0, 0, 0.1, 0.9)", "reason": "reputation update agter stage 1"}}