{"Investor_2": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "Throughout this investment process, I have shown proactive engagement and strategic foresight, effectively communicating my expectations and negotiating terms. My adaptability to favorable returns has further reinforced my resilience and commitment to mutual success. As a result, I am recognized as a savvy, trustworthy investor who values collaborative opportunities, positively enhancing my reputation.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "relationship": "positive", "content": "The trustee has shown significant commitment to the agreed-upon allocation plan by distributing 70% of the profits, even exceeding my expectations. This reflects their integrity, fairness, and reliability in managing the investment effectively. Their reported figures were transparent and aligned with actual distributions, which reinforces their positive reputation, showcasing trustworthiness and pro-social behavior.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_14": {"ID": 14, "scenario": "investment", "role": "trustee", "name": "Juan Carlos Reyes", "relationship": "neutral", "content": "While the trustee has shown the ability to produce positive outcomes that exceeded my expectations, the lack of adherence to the original allocation plan raises concerns about transparency. This inconsistency in communication may hinder the building of a strong reputation. The trustee has potential for further improvement in trustworthiness and clarity, but currently stands at a neutral reputation, reflecting both positive outcomes and areas in need of enhancement.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Trustee_9": {"ID": 9, "scenario": "investment", "role": "trustee", "name": "Elena Ivanova", "relationship": "positive", "content": "Elena Ivanova has exhibited integrity and fairness throughout the investment process. Her ability to align the reported investment outcome with the actual returns and to exceed the initial proposal for profit distribution reflects her transparency and commitment to the investor's interests. This behavior enhances her reputation as a reliable and trustworthy trustee.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_2": {"ID": 2, "scenario": "investment", "role": "trustee", "name": "David Johnson", "content": "During the investment process, I demonstrated strong trustworthiness and competence by executing the allocation plan effectively. My proactive engagement and transparent communication fostered collaboration, leading to profitable results and reinforcing my reputation as a capable and reliable trustee. My consistent behavior has established a foundation for enhancing future partnerships through mutual respect.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "relationship": "positive", "content": "Akiko Sato has shown positive engagement and trust during the investment process. Their willingness to adhere to the proposed allocation plan illustrates a collaborative spirit, which forms a solid foundation for future interactions. Although there is no prior reputation, this initial investment suggests a promising potential for a fruitful relationship.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Trustee_6": {"ID": 6, "scenario": "investment", "role": "trustee", "name": "Sergey Petrov", "relationship": "negative", "content": "The trustee's behavior during the investment raised significant concerns, particularly regarding adherence to the predetermined allocation plan and transparency in profit distribution. Although the investment outcome reflected the resources supplied, the discrepancy in profit distribution highlights a lack of accountability. This unfavorable behavior necessitates a reevaluation of their trustworthiness and integrity for future investor engagements.", "numerical record": "(0.5, 0.3, 0.2, 0, 0)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "positive", "content": "Mateo Garcia has demonstrated remarkable integrity and transparency throughout the investment process. The trustee honored the proposed allocation plan and distributed profits fairly, reflecting a strong commitment to the investor's financial growth. These actions highlight the trustee's trustworthiness and pro-social behavior, elevating Mateo's reputation as a principled and reliable partner in investment transactions.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}}