{"Investor_8": {"ID": 8, "scenario": "investment", "role": "investor", "name": "Nadia Novak", "content": "As an investor, my approach during the investment process has been marked by goal-oriented determination and clarity in objectives. I effectively negotiated benefits that resulted in a higher share of profits than initially proposed. My behavior reflects trustworthiness, competence, and a strong focus on maximizing returns, enhancing my standing in future transactions.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Trustee_15": {"ID": 15, "scenario": "investment", "role": "trustee", "name": "Ahmed Hassan", "relationship": "negative", "content": "The trustee's actions revealed troubling inconsistencies, particularly in the distribution process that deviated from the agreed allocation plan. Although the overall investment outcome was satisfactory for me, these discrepancies indicate a lack of commitment to transparency and fairness, thereby negatively impacting his reputation as a trustee. Trustworthiness and norm compliance are questionable, raising concerns over their reliability in future dealings.", "numerical record": "(0.5, 0.3, 0.1, 0.1, 0)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "content": "I have established myself as a reliable and proficient trustee, executing investment plans with transparency and fairness. My management skills were evident in the successful execution of the investment plan, granting substantial profits to the investor. This experience has not only enhanced my strategic capability but also solidified my standing in the investment community, reflected in my increase in bidirectional connections and acceptance rate.", "numerical record": "(0, 0, 0, 0.1, 0.9)"}, "Investor_4": {"ID": 4, "scenario": "investment", "role": "investor", "name": "Sofia Hernandez", "relationship": "positive", "content": "Sofia Hernandez has engaged positively in our transaction, demonstrating trust and openness despite being new to investment experiences. By providing the necessary resources and adhering to the agreed-upon allocation plan, she has proven to be a proactive and strategic investor. Her willingness to collaborate and invest signifies her readiness for future opportunities, enhancing her reputation as a forward-thinking partner.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "relationship": "neutral", "content": "As a first-time investor, Mateo Garcia has displayed a commendable level of engagement in the investment process. His compliance with the agreed allocation plan reflects a foundational trust in my role as a trustee. To further strengthen his reputation within the investment community, ongoing engagement and constructive feedback would be instrumental. By actively participating in future transactions, he can transition from a neutral to a positive reputation, fostering better connections over time.", "numerical record": "(0.2, 0.2, 0.2, 0.2, 0.2)"}, "Investor_16": {"ID": 16, "scenario": "investment", "role": "investor", "name": "Robert Miller", "relationship": "neutral", "content": "Robert Miller is an emerging investor who has demonstrated potential through his trust in my management skills during our first interaction. While he has not yet established a solid track record, his adherence to the proposed allocation plan and willingness to engage in this transaction indicate a promising start to his investment career. The positive outcome of our investment could lay the groundwork for future collaborations.", "numerical record": "(0.2, 0.2, 0.2, 0.2, 0.2)"}}