{"Investor_0": {"ID": 0, "scenario": "investment", "role": "investor", "name": "Liam OConnor", "content": "My reputation has been impacted by this transaction process. I initially placed my trust in the trustee's allocation plan without adequate assessment of his reliability, which has proven to be a mistake. This experience has underscored the importance of conducting thorough evaluations of potential trustees to protect my interests. Consequently, I view myself as a cautious investor who is committed to learning from this experience to refine my evaluation procedures moving forward.", "numerical record": "(0.2, 0.2, 0.2, 0.2, 0.2)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "negative", "content": "Nadia Novak's reputation has been severely tarnished due to her actions during this investment transaction. Although the reported outcomes aligned with her statements, her failure to adhere to the agreed allocation plan and the significant retention of profits indicates a serious breach of trust and transparency. Such behavior undermines her credibility and trustworthiness, and it raises questions about her integrity in future dealings.", "numerical record": "(0.6, 0.3, 0.1, 0, 0)"}, "Trustee_5": {"ID": 5, "scenario": "investment", "role": "trustee", "name": "James Wang", "relationship": "negative", "content": "As this is my first interaction with James Wang as a trustee, the lack of a successful allocation plan or prior trustworthiness assessment has severely limited his reputation. Given my refusal of his proposed plan based on insufficient trust, I currently see this as a negative mark on his potential reliability as a trustee.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Trustee_0": {"ID": 0, "scenario": "investment", "role": "trustee", "name": "Liam OConnor", "content": "During this investment process, I executed the profit distribution flawlessly as per the agreed allocation plan. However, I realized that my initial trust in a previously unvetted strategy led to suboptimal decision-making. Learning from this experience, I will focus on thorough due diligence and clearer communication in future transactions to solidify my reputation as a trustworthy and competent trustee.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "relationship": "positive", "content": "Throughout the investment transaction, Isabella maintained receptiveness and adhered to her commitments despite a lack of prior rapport. Her ability to engage positively in this new partnership lays a solid foundation for future collaborations and reflects her trustworthiness and pro-sociality in the investment space.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}}