{"Investor_8": {"ID": 8, "scenario": "investment", "role": "investor", "name": "Nadia Novak", "content": "I have demonstrated a strong commitment to both maximizing my returns and fostering effective communication with my trustee throughout the investment process. My proactive involvement in the allocation plan, adherence to profit-sharing agreements, and successful outcomes have reinforced my reputation as a strategic investor focused on collaboration and fruitful results.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Trustee_14": {"ID": 14, "scenario": "investment", "role": "trustee", "name": "Juan Carlos Reyes", "relationship": "negative", "content": "The trustee, Juan Carlos Reyes, proposed an initially equitable allocation plan but ultimately failed to adhere fully to the agreed terms during the profit distribution. The misalignment between the expected and actual returns raised significant concerns regarding his trustworthiness and integrity. While the distribution was technically balanced, the lack of transparency and fairness has negatively impacted his reputation, marking him as unreliable in the eyes of investors.", "numerical record": "(0.5, 0.3, 0.2, 0, 0)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "content": "Due to credible concerns about significant allocation discrepancies and lack of communication, Akiko Sato's reputation has diminished. Trustworthiness and pro-sociality are now questioned, impacting her standing in the community.", "numerical record": "(0.4, 0.3, 0.2, 0, 0.1)"}, "Trustee_3": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "relationship": "positive", "content": "Maria Rossi has demonstrated exceptional integrity and transparency during the investment process. She made adjustments to the profit allocation that benefitted me, showcasing her commitment to fairness and trustworthiness. By exceeding expectations with unexpected returns, Maria has fostered a strong, positive relationship rooted in cooperation and reliability, establishing her reputation as a credible trustee for future investments.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "positive", "content": "Emma has showcased a strong level of integrity and fairness during the investment process. Her alignment of the actual allocation results with the proposed plan, along with exceeding expectations in profit distribution, has solidified her reputation as a reliable and trustworthy trustee. Her transparent communication further underscores her commitment to maximizing investor returns.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}}