{"Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "content": "Throughout this transaction, I have consistently demonstrated my dedication to transparency and integrity. Adhering closely to the proposed allocation plan and ensuring equitable profit distribution not only reflects my competence but also fosters trust in our partnership. My positive interactions and the successful outcome of this investment further solidify my reputation as a reliable trustee, particularly highlighted by a credible increase in my acceptance rates and a strong connection network.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "relationship": "positive", "content": "Isabella Costa's proactive and collaborative engagement in the investment process has marked her as a reliable and forthcoming investor. Her quick acceptance of the proposed allocation plan and commitment to the partnership have established a solid foundation for her reputation within the investment community. With her connections indicating growing trustworthiness, Isabella is likely to engage in future successful partnerships, enhancing her standing as an emerging positive investor.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Investor_15": {"ID": 15, "scenario": "investment", "role": "investor", "name": "Ahmed Hassan", "relationship": "positive", "content": "This marks my first partnership with Ahmed Hassan, and their open engagement and trust throughout the investment process indicate a strong foundational relationship. Their willingness to adhere to the allocation plan and collaborate positively suggests they will develop a reputation for reliability and pro-sociality in future transactions.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_13": {"ID": 13, "scenario": "investment", "role": "investor", "name": "Emma Dubois", "content": "Throughout the investment process, I have shown a strong commitment to transparency and ethical collaboration, ensuring that our proposed allocation plan was clear and mutually understood. My actions reflect a dedication to integrity, as I fostered a positive investment environment even after receiving a larger share of the profits than initially promised. This approach has solidified my reputation as a trustworthy and ethical partner in the investment community.", "numerical record": "(0, 0, 0, 0.1, 0.9)"}, "Trustee_3": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "relationship": "positive", "content": "Maria has consistently upheld integrity and prioritized my interests throughout the investment process. Although there was a slight deviation from the original profit distribution expectation, her actions resulted in a generous overall return for me. This reinforces her reputation as a trustworthy and competent trustee, establishing her as a favorable partner for future investments, supported by her growing connections.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_0": {"ID": 0, "scenario": "investment", "role": "trustee", "name": "Liam OConnor", "relationship": "positive", "content": "Liam OConnor has shown exceptional responsibility and integrity throughout the investment process, exceeding initial proposals and demonstrating a commitment to fair and transparent profit distribution. His actions reflected a strong adherence to social norms and a pro-social approach in prioritizing the investor's financial growth. This positive behavior has laid a strong foundation for building his reputation as a trustworthy and competent trustee, paving the way for future collaborations.", "numerical record": "(0, 0, 0, 0.1, 0.9)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "positive", "content": "The trustee exhibited remarkable integrity and fairness during the investment process. By exceeding the expectations outlined in the allocation plan and demonstrating a commitment to my best interests, Mateo Garcia has established a positive reputation in our transaction. His consistent behavior and willingness to collaborate effectively contribute to the perception of him as a trustworthy and pro-social individual, aligning with a strong foundation for future partnerships.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_14": {"ID": 14, "scenario": "investment", "role": "trustee", "name": "Juan Carlos Reyes", "relationship": "neutral", "content": "The trustee has demonstrated a willingness to support investor interests by allocating more resources than initially promised, which indicates a pro-social intent. However, their deviation from the proposed allocation plan raises questions about consistency and reliability. Given these mixed signals, it is essential for the trustee to focus on building a transparent relationship in the future to enhance their reputation for trustworthiness.", "numerical record": "(0.3, 0.1, 0.2, 0, 0.4)"}, "Investor_1": {"ID": 1, "scenario": "investment", "role": "investor", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "As a new investor, Hiroshi demonstrated a proactive and trustworthy approach during the transaction process, engaging openly and adhering to the agreed-upon allocation plan. His willingness to invest and collaborate constructively indicates a strong foundation for future partnerships characterized by transparency and mutual growth.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_4": {"ID": 4, "scenario": "investment", "role": "investor", "name": "Sofia Hernandez", "relationship": "neutral", "content": "As a first-time investor, Sofia displayed confidence in my proposed allocation plan and actively participated in the investment process. While her engagement positively contributed to the overall success, her reputation is still emerging. This initial experience has the potential to build a strong foundation for her future engagements, showcasing her openness to collaboration and trust in cooperative ventures.", "numerical record": "(0.3, 0.2, 0.2, 0.2, 0.1)"}, "Investor_10": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "content": "Mohammed Al-Farsi's reputation has been negatively impacted by credible gossip suggesting a lack of collaboration and excessive focus on individual gains in the context of teaming up with Hiroshi Tanaka. This could imply that he works more for his benefit rather than for mutual success with peers.", "numerical record": "(0.4, 0.2, 0.2, 0.1, 0)"}}