{"Investor_4": {"ID": 4, "scenario": "investment", "role": "investor", "name": "Sofia Hernandez", "content": "In this investment process, I demonstrated my strategic capabilities by thoroughly evaluating the trustee's allocation plan and negotiating favorable terms. My proactive involvement led to better-than-expected returns, reflecting my keen eye for trustworthy partnerships and my commitment to maximizing investment outcomes. This successful transaction not only reinforces my reputation as a savvy investor but also showcases my ability to build strong, cooperative relationships in the investment community.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_7": {"ID": 7, "scenario": "investment", "role": "trustee", "name": "Hannah Muller", "relationship": "positive", "content": "The trustee, Hannah, demonstrated integrity and fairness throughout the investment process. Despite being new in their role, they reported results transparently and distributed profits favorably toward the investor, which reflects a strong commitment to pro-social behavior and trustworthiness. This positive experience not only establishes a foundation of trust but also bodes well for their future interactions within the investment community.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "content": "Sofia Hernandez's recent proposal for an allocation plan, which offered the investor 60% of profits, was rejected due to concerns regarding her poor reputation. This refusal indicates a significant lack of trustworthiness and reliability, further damaging her credibility in the investment community. Her history of rejections, including one where she proposed a 70% allocation to the investor, continues to present her as an unfavorable option for potential investors.", "numerical record": "(0.8, 0.1, 0.1, 0, 0)"}, "Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "relationship": "negative", "content": "Elena Ivanova has yet to establish any connections within the investment community, which reflects her isolation and implies a lack of engagement in potential collaborative efforts. Her rejection of the trustee's proposal due to concerns over reliability and the trustee's lack of a prior reputation further compounds her negative standing.", "numerical record": "(0.7, 0.1, 0.1, 0, 0.1)"}, "Investor_13": {"ID": 13, "scenario": "investment", "role": "investor", "name": "Emma Dubois", "relationship": "negative", "content": "Emma Dubois rejected the allocation plan due to significant concerns about the trustee's trustworthiness, reflecting her own cautious approach as a new investor. This rejection indicates a less favorable view of her engagement in investments while she still maintains a neutral standing overall, as she is still building her connections and reputation in the community.", "numerical record": "(0.5, 0.2, 0.2, 0.1, 0)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia Novak displayed exceptional integrity and transparency throughout the investment process. The successful alignment of the projected and actual outcomes indicates her reliability and commitment to acting in the best interest of her investors. While she is new to the trustee role, her actions in this transaction have laid a solid foundation for her reputation, suggesting she is a trustworthy partner capable of fostering positive investment relationships.", "numerical record": "(0.1, 0, 0.1, 0, 0.8)"}, "Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "relationship": "neutral", "content": "Isabella Costa is new to the investment scene and has not yet established a reputation. Having built 3 connections among 20 people, her standing is neutral, as her prior engagement in investment activities does not provide enough history to evaluate her reputation positively or negatively.", "numerical record": "(0.2, 0.2, 0.2, 0.2, 0.2)"}}