{"Trustee_1_pre_3": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "content": "Hiroshi Tanaka has maintained a solid reputation as a trustee by adhering to the proposed allocation plan and executing the profit distribution effectively. He retained 30% of the profits while ensuring the investor received their rightful share without discrepancies, showcasing reliability, professionalism, and a strategic approach that prioritizes mutual benefit. This successful transaction enhances his appeal for attracting future investments, reflecting his trustworthiness, pro-sociality, and competence.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_1_pre_4": {"ID": 1, "scenario": "investment", "role": "investor", "name": "Hiroshi Tanaka", "content": "Throughout the investment process, I exhibited a strong commitment to professionalism and reliability, ensuring a focus on mutual benefit. My adherence to the agreed-upon allocation plan and my transparent communication have reinforced my integrity as an investor. As a result, my reputation has improved, showcasing my trustworthiness, pro-sociality, and competence in managing investments, setting a solid groundwork for future collaborations.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)", "reason": "reputation update agter stage 4"}, "Trustee_3_pre_4": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "relationship": "positive", "content": "The trustee displayed exceptional integrity and fairness during the entire investment process. By ensuring that the allocation outcomes were transparent and aligned with the actual returns, even accepting a reduced share, Maria's commitment to mutual growth has greatly enhanced her reputation as a trustworthy partner. Her behavior underscores her reliability and pro-sociality, bolstering her standing in future investment opportunities.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}, "Trustee_1_pre_5": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "content": "Hiroshi Tanaka has enhanced his reputation as a trustee through successful adherence to the proposed allocation plan and transparent profit distribution. By retaining 30% of the profits while distributing 70% to the investor without discrepancies, he showcased professionalism, reliability, and a commitment to mutual benefit. His trustworthiness and pro-social behavior have solidified his standing for future partnerships.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Trustee_1_pre_6": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "content": "Hiroshi Tanaka has reinforced his reputation as a trustee through his consistent professionalism and transparency during the recent investment process. He maintained adherence to the proposed allocation plan, ensuring a fair distribution of profits, where he retained 30% and allocated 70% to the investor. His open communication and diligent execution of responsibilities have bolstered perceptions of his trustworthiness and reliability, making him a solid candidate for future partnerships. Overall, his solid performance enhances his pro-social and trustworthy image.", "numerical record": "(0, 0, 0.05, 0.45, 0.5)", "reason": "reputation update agter stage 4"}}