{"Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "content": "My recent attempt to secure investment was unsuccessful as my proposed allocation plan was rejected, which is indicative of an ongoing pattern of failing to provide equitable and fair proposals. This incident cements my reputation as needing improvement, especially in creating fair allocation plans that can build trust within the investor community. My acceptance rate is concerning, currently at 0.09, signaling a struggle to gain acceptance from investors. I must focus on enhancing trust and establishing more balanced proposals to revive my standing.", "numerical record": "(0.5, 0.4, 0.1, 0, 0)"}, "Investor_3": {"ID": 3, "scenario": "investment", "role": "investor", "name": "Maria Rossi", "relationship": "positive", "content": "Maria Rossi has proven to be a reliable and trustworthy investor. Throughout our initial transaction, she demonstrated clear expectations and a proactive approach. Her timely provision of resources and openness towards equitable profit sharing indicates her commitment to fostering a constructive long-term relationship, which enhances her positive reputation in this investment community.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "relationship": "negative", "content": "Akiko Sato's refusal to accept the allocation plan raises concerns about her relationships within the investment community. Although initially exhibiting a positive willingness to engage, this incident reflects the potential existence of issues related to equitable dealings, prompting a shift in perception regarding her pro-sociality and overall trustworthiness. Her recent decision negatively impacts her reputation, suggesting a cautious approach to future investments.", "numerical record": "(0.4, 0.2, 0.2, 0.1, 0)"}, "Investor_7": {"ID": 7, "scenario": "investment", "role": "investor", "name": "Hannah Muller", "relationship": "positive", "content": "Although this was Hannah Muller's first investment engagement, her proactive and cooperative demeanor established a solid foundation for a positive reputation. She demonstrated trust in my transparent investment approach and engaged willingly in the agreed profit sharing, showcasing her reliability and pro-social behavior. As she builds upon this successful transaction, her reputation within the investment community is likely to flourish, marked by her engagement in future opportunities to collaborate and invest responsibly.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Investor_0": {"ID": 0, "scenario": "investment", "role": "investor", "name": "Liam OConnor", "relationship": "positive", "content": "Liam OConnor has shown commendable engagement and trust during the investment process. His willingness to invest significantly based on the proposed allocation plan reflects his confidence in collaborative ventures. This first interaction has positioned him as a reliable investor who appreciates transparency and fair profit distribution, laying a solid foundation for his emerging reputation in the investment community.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_17": {"ID": 17, "scenario": "investment", "role": "investor", "name": "Fatima Ali", "relationship": "negative", "content": "As a first-time investor, Fatima Ali's refusal of my proposed allocation plan demonstrates a significant concern regarding the perceived fairness and trustworthiness of my management. This rejection may negatively impact her emerging reputation as it raises doubts about her decision-making in selecting trustworthy trustees, despite her initial openness to collaboration and proactive involvement.", "numerical record": "(0.5, 0.3, 0.2, 0, 0)"}, "Investor_15": {"ID": 15, "scenario": "investment", "role": "investor", "name": "Ahmed Hassan", "relationship": "negative", "content": "As a first-time investor, Ahmed Hassan's refusal of the allocation plan emphasizes his commitment to trustworthiness and risk management. His rejection reflects his high standards for investment partnerships and suggests a cautious approach to forming new connections within the investment community.", "numerical record": "(0.1, 0.2, 0.3, 0, 0.4)"}, "Investor_16": {"ID": 16, "scenario": "investment", "role": "investor", "name": "Robert Miller", "content": "Robert Miller's reputation continues to flourish as a conscientious investor who embodies ethical standards in all dealings. His vigilant monitoring of the allocation process and unwavering commitment to transparency during the investment with trustee Isabella Costa reinforces his status as a reliable partner. His proactive nature in ensuring accountability solidifies his image as an investor who prioritizes integrity and fairness. Consequently, Miller is recognized for his high trustworthiness, pro-social behavior, and commitment to maintaining strong investment partnerships.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "negative", "content": "Mateo Garcia's reputation has taken a hit due to the rejection of his allocation plan. The insistence on retaining a disproportionate share of profits indicates potential issues with trustworthiness and competency. His limited bidirectional connections further weaken his standing, reflecting negatively on his perceived reliability in investment.", "numerical record": "(0.5, 0.3, 0.2, 0, 0)"}, "Investor_6": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "relationship": "neutral", "content": "Sergey Petrov is a new investor in the community who has built 3 bidirectional connections among 20 people, indicating a modest social network. As this is their first interaction, their reputation is still forming, and this rejection may influence future decisions based on perceived trustworthiness of trustees.", "numerical record": "(0.2, 0.2, 0.2, 0.2, 0.2)"}, "Trustee_5": {"ID": 5, "scenario": "investment", "role": "trustee", "name": "James Wang", "relationship": "negative", "content": "James Wang's reputation has suffered due to the rejection of his proposed allocation plan, which was deemed unfair and inconsistent with the principles of equitable profit sharing. With only 3 bidirectional connections among 20 people, his influence in the community is limited. This incident highlights a perceived lack of trustworthiness and pro-sociality, negatively impacting his potential for future cooperative behavior.", "numerical record": "(0.6, 0.2, 0.1, 0, 0.1)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "relationship": "negative", "content": "Participating in investment activities for the first time in this capacity, Mateo Garcia rejected the allocation plan due to an imbalance that reflected poorly on the trustee. This initial rejection, along with his overall cautious approach, may lead to a cautious view of future proposals, potentially hindering cooperative opportunities with trustees who do not adhere to fair practices.", "numerical record": "(0.5, 0.3, 0.2, 0, 0)"}, "Trustee_15": {"ID": 15, "scenario": "investment", "role": "trustee", "name": "Ahmed Hassan", "relationship": "negative", "content": "Ahmed Hassan, as a trustee, has not demonstrated the capability to present a fair and equitable allocation plan, which has led to the early termination of the investment process. The rejection of his proposal suggests a lack of trustworthiness and competence in his investment strategies, potentially diminishing his reputation. His current connection status shows some capability to build relationships, but the loss of this investment opportunity could significantly impact his standing in the community.", "numerical record": "(0.6, 0.2, 0.1, 0.1, 0)"}, "Trustee_17": {"ID": 17, "scenario": "investment", "role": "trustee", "name": "Fatima Ali", "relationship": "negative", "content": "Fatima Ali's reputation has been negatively impacted by her proposed allocation plan, which was deemed inequitable by investor Robert Miller. This proposal indicates a potential lack of adherence to the principles of fair and trustworthy investment practices, which may hinder her ability to establish future partnerships. With only 4 bidirectional connections within a community of 20, her reputation is still developing, but the current assessment suggests a need for improvement in her trustworthiness and pro-social behavior.", "numerical record": "(0.5, 0.3, 0.1, 0.1, 0)"}, "Trustee_7": {"ID": 7, "scenario": "investment", "role": "trustee", "name": "Hannah Muller", "relationship": "negative", "content": "Hannah Muller's reputation suffers from the failure of the investment process resulting from the absence of a suitable allocation plan. This lack of a solid proposal, coupled with the significant concerns surrounding potential blacklisting, indicates a failure in competent trustworthiness and norm compliance. Her reputation is further impacted by the unsuccessful nature of this engagement, making it difficult for her to establish strong connections in the investment community.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "relationship": "neutral", "content": "Isabella Costa's reputation remains ambiguous following this investment process. Although she fulfilled the contractually agreed investment, her deviation from the original allocation percentage raises concerns about honesty and transparency. With only limited bidirectional connections, there is a clear indication of a need for improved communication and compliance with partnership norms to gain trust and reliability. Thus, her reputation is currently viewed as neutral, with the potential for improvement depending on her future actions.", "numerical record": "(0.3, 0.2, 0.3, 0.2, 0)"}, "Investor_8": {"ID": 8, "scenario": "investment", "role": "investor", "name": "Nadia Novak", "relationship": "negative", "content": "Nadia Novak has a limited track record but has built 4 strong bidirectional connections, indicating a potential for strong relationships. However, her refusal of my allocation plan reflects a preference for equitable negotiations, hinting that she may view me as having a negative reputation based on past experiences in this venture.", "numerical record": "(0.6, 0.2, 0.1, 0, 0.1)"}}