{"Investor_11": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "During the investment process, I demonstrated trustworthiness and a commitment to equitable resource sharing. I maintained transparency and collaboration, adhering to the proposed allocation plan. My engagement emphasized mutual success, and my slight advantage in resource allocation did not compromise my dedication to fairness. This behavior enhances my reputation as a trustworthy and pro-social investor.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "positive", "content": "The trustee exhibited integrity throughout the investment process, adhering to the agreed terms while also ensuring that my interests were prioritized. Their honest communication and compliance with the proposed allocation plan fostered trust. By managing the investment successfully and upholding pro-social behavior, Mateo's reputation has been significantly enhanced as a reliable and competent trustee.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "content": "During the recent investment process, I maintained a high level of trustworthiness, pro-sociality, and competence. I successfully executed the agreed allocation plan, providing the investor with 70% of the profits while ensuring transparency and fairness. My ability to navigate the transaction smoothly and the positive feedback received from this experience have significantly bolstered my reputation. I am recognized as a reliable trustee dedicated to equitable resource sharing and effective collaboration, which has resulted in a marked improvement in my standing within the investment community.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "relationship": "positive", "content": "Isabella demonstrated trust and a willingness to engage in a transparent partnership during our first investment transaction. Her acceptance of my proposed allocation plan reflects her positive disposition towards equitable profit sharing, indicating a pro-social attitude. As this was her initial foray into investment, I believe her reputation as an investor will develop positively with future engagements, supporting the community's collaborative spirit.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_10": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "relationship": "positive", "content": "As a first-time investor, Mohammed Al-Farsi has demonstrated a willingness to engage in a transparent and fair investment process. His acceptance of the proposed profit distribution plan reflects his openness to collaboration and commitment to mutual success. Establishing a bidirectional connection highlights his proactive approach towards building relationships within the investment community. This positive initial interaction lays a strong foundation for future engagements, enhancing his reputation as a reliable and collaborative investor.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_2": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "relationship": "positive", "content": "As this investor participated in their first transaction with me, they showed a commendable willingness to engage in the allocation plan, which reflects their confidence in fair investment practices. Their active role in providing resources for investment indicates a collaborative spirit and an intention for mutual benefit. Given the successful outcome of this transaction, David Johnson emerges as a promising partner for future investments, strengthening his reputation in this investment context.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}}