{"Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "content": "Despite proposing an allocation plan, the absence of a suitable plan due to blacklisting has resulted in a failed agreement. This is likely to affect my reputation negatively, as it suggests a lack of preparedness or an inability to build cooperative relationships. My commitment to integrity and transparency was undermined, which could reduce my trustworthiness as a trustee significantly.", "numerical record": "(0.4, 0.2, 0.3, 0, 0.1)"}, "Investor_6": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "relationship": "neutral", "content": "Sergey Petrov's rejection of the allocation plan indicates a cautious approach due to possible blacklisting, which may reflect a need for more transparency and better communication. While this decision may not sever the relationship completely, it introduces an element of distrust that could hinder future cooperation.", "numerical record": "(0.2, 0.1, 0.3, 0, 0.4)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "content": "During the investment process, I exhibited a strong commitment to collaboration, maintaining transparency and adhering to the agreed allocation plan. My proactive engagement and effective communication with my trustee led to a successful investment outcome that exceeded my expectations. This reinforces my reputation as a responsible and trustworthy investor dedicated to mutual success and highlights my competence in resource management.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "relationship": "positive", "content": "Aisha Ibrahim showcased exceptional integrity and transparency throughout the investment. She adhered strictly to the proposed allocation plan and ensured that profits were distributed fairly according to the agreement. Her actions reflect reliability and ethical conduct, enhancing her reputation as a trustable trustee and setting a solid foundation for future transactions.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_17": {"ID": 17, "scenario": "investment", "role": "trustee", "name": "Fatima Ali", "relationship": "positive", "content": "Fatima Ali demonstrated exceptional integrity and commitment during our investment process, achieving a favorable investment outcome for both parties. Her fair distribution of profits, exceeding the agreed terms, reflects her pro-social behavior and alignment with my best interests. This positive experience positions her as a reliable and competent trustee, likely to earn her a strong reputation in future transactions.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}}