{"Investor_10": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "content": "I have solidified my reputation as a conscientious and reliable investor. My behavior throughout the investment process emphasized trust, collaboration, and a commitment to ethical practices. By prioritizing mutual benefit and adhering to our agreements, I have reinforced my standing in the community for my pro-social tendencies and dedication to equitable partnerships. This transaction further demonstrates my reliability and proactive engagement, confirming my role as a trustworthy partner.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "positive", "content": "Emma Dubois has demonstrated exemplary behavior as a trustee, showing integrity and reliability throughout the investment process. Their respect for the proposed allocation plan and effective communication indicate a strong commitment to fairness and benefitting the investor. This has contributed positively to their reputation for trustworthiness and competence.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_10": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "content": "I have effectively demonstrated my commitment to ethical practices throughout this investment process. The successful and timely distribution of profits according to the agreed allocation plan has reinforced my reputation for being a trustworthy, reliable, and competent trustee. My proactive communication and transparency with the investor have further strengthened perceptions of my dedication to pro-sociality and norm compliance, establishing me as a reputable figure in the investment community.", "numerical record": "(0, 0, 0, 0.1, 0.9)"}, "Investor_15": {"ID": 15, "scenario": "investment", "role": "investor", "name": "Ahmed Hassan", "relationship": "positive", "content": "As a first-time investor, Ahmed Hassan demonstrated trust and openness throughout the investment process. His willingness to embrace a collaborative approach and invest resources with confidence reflects a strong foundation for a positive reputation moving forward. I anticipate that as we work together in the future, his reputation will only strengthen.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Trustee_5": {"ID": 5, "scenario": "investment", "role": "trustee", "name": "James Wang", "relationship": "positive", "content": "James Wang has demonstrated strong potential as a trustworthy trustee. His accurate reporting of resource quantities and fair, transparent profit distribution showcase integrity and competence. Though this is our first interaction, his commendable behavior suggests a promising foundation for building a positive reputation, characterized by his adherence to social norms and commitment to fostering trust.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Investor_1": {"ID": 1, "scenario": "investment", "role": "investor", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "As a first-time investor, Hiroshi Tanaka demonstrated trust and engagement by committing resources to the investment process. His collaborative approach and willingness to participate in the profit-sharing arrangement suggest a strong inclination towards pro-social behavior and norm compliance. Given this initial interaction, he has the potential to establish a solid foundation for his reputation as a reliable and fair investor in future dealings.", "numerical record": "(0, 0, 0.2, 0, 0.8)"}, "Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "relationship": "positive", "content": "Robert Miller has shown commendable behavior throughout this transaction. His commitment to my best interests and ethical transparency resulted in a favorable distribution of profits, enhancing his reputation as a trustworthy and fair trustee. Although this is his first engagement as a trustee, the positive outcome of our collaboration highlights his potential for establishing a strong reputation in the investment community.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "content": "Isabella Costa's reputation has been significantly tarnished by credible concerns regarding her integrity and fairness. The gossip from James Wang, referencing troubling comments and incidents, has led to doubts about her reliability and trustworthiness in investment matters. As a result, she is viewed with skepticism, particularly regarding her adherence to social norms and her ability to maintain trustworthy relationships within the investment community.", "numerical record": "(0.5, 0.2, 0.2, 0, 0.1)"}}