{"Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "content": "Hiroshi Tanaka has enhanced his reputation as a trustee through successful adherence to the proposed allocation plan and transparent profit distribution. By retaining 30% of the profits while distributing 70% to the investor without discrepancies, he showcased professionalism, reliability, and a commitment to mutual benefit. His trustworthiness and pro-social behavior have solidified his standing for future partnerships.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_13": {"ID": 13, "scenario": "investment", "role": "investor", "name": "Emma Dubois", "relationship": "neutral", "content": "Emma Dubois has shown willingness to engage in collaborative investment opportunities, indicating a reasonable and trusting nature. However, due to the absence of prior history, her reputation as an investor remains uncertain. Her acceptance of the allocation plan and participation in this investment suggest potential for positive interactions if she continues to honor agreements and fairly share profits in future engagements.", "numerical record": "(0.2, 0.2, 0.2, 0.2, 0.2)"}, "Investor_1": {"ID": 1, "scenario": "investment", "role": "investor", "name": "Hiroshi Tanaka", "content": "Throughout the investment process, I exhibited a strong commitment to professionalism and reliability, ensuring a focus on mutual benefit. My adherence to the agreed-upon allocation plan and my transparent communication have reinforced my integrity as an investor. As a result, my reputation has improved, showcasing my trustworthiness, pro-sociality, and competence in managing investments, setting a solid groundwork for future collaborations.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Trustee_3": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "relationship": "positive", "content": "The trustee displayed exceptional integrity and fairness during the entire investment process. By ensuring that the allocation outcomes were transparent and aligned with the actual returns, even accepting a reduced share, Maria's commitment to mutual growth has greatly enhanced her reputation as a trustworthy partner. Her behavior underscores her reliability and pro-sociality, bolstering her standing in future investment opportunities.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Investor_11": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "relationship": "positive", "content": "Aisha Ibrahim demonstrated a high level of trust and engagement during the investment process. As a first-time investor, her substantial investment of 21.8 units based on the outlined allocation plan indicates a readiness to collaborate. With a successful return received without issues, this experience lays a solid foundation for her reputation as a fair and trustworthy participant in future investments.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}}