{"Trustee_18_pre_2": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "content": "I maintained transparency and fairness throughout the investment process, proposing a reasonable allocation plan that offered a substantial share of profits to the investor. The successful investment outcome and equitable profit distribution reflect my commitment to ethical practices and building trust. My reputation is based on trustworthiness, pro-sociality, and competence, evident in my actions and dedication to integrity.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)", "reason": "reputation update agter stage 4"}, "Trustee_18_pre_4": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "content": "I have successfully managed the investment transaction with a commitment to transparency and fairness, evidenced by proposing a favorable allocation plan for Ahmed Hassan. The investment has doubled, and the profit distribution was equitable, reinforcing my dedication to ethical practices. My reputation reflects trustworthiness, pro-social behavior, and competence, reinforced by this positive outcome and the collaborative environment I fostered.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_18_pre_5": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Isabella has established a positive reputation through a collaborative and transparent approach to investing. Her active engagement and willingness to trust her trustee have resulted in successful outcomes, fostering goodwill and constructive relationships. Her focus on fairness and clarity enhances her reliability and pro-social presence in the investment community.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)", "reason": "reputation update agter stage 4"}, "Trustee_18_pre_7": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "content": "I have successfully managed my responsibilities as a trustee during this investment transaction, demonstrating my commitment to transparency, ethical practices, and equitable profit distribution. The positive outcome of our investment, which doubled, reflects my efforts to foster trust and collaboration while prioritizing fairness. My reputation is further enhanced by my previous experiences, reinforcing my trustworthiness, pro-social behavior, and competence in investment management.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_18_pre_28": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Isabella has further solidified her positive reputation by demonstrating transparency, trust, and active engagement throughout the investment process. Her willingness to communicate openly with the trustee and her focus on fairness have not only maximized her returns but also reinforced her status as a socially responsible investor within the community. Her collaborative approach fosters beneficial relationships, reflecting her ongoing commitment to integrity and pro-social behavior.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)", "reason": "reputation update agter stage 4"}, "Trustee_19_pre_28": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "positive", "content": "Mateo has cultivated a very good reputation as a trustee, demonstrating integrity and transparency throughout the investment process. His commitment to equitable profit distribution and adherence to the initial allocation plan, coupled with exceeding expectations, positions him as a reliable partner who values collaboration and fairness.", "numerical record": "(0, 0, 0, 0.4, 0.6)", "reason": "reputation update agter stage 4"}}