[{"id": 1, "type": "EVENT", "subject": "Nadia Novak", "predicate": "investment", "object": "Fatima Ali", "description": "Success investment: investor is Nadia Novak, trustee is Fatima Ali\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '12.0', 'investor': '8.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 1}, {"id": 2, "type": "EVENT", "subject": "Nadia Novak", "predicate": "investment", "object": "Juan Carlos Reyes", "description": "Success investment: investor is Nadia Novak, trustee is Juan Carlos Reyes\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 8.0 units\nstage 3: trustee_allocation is {'trustee': '10.0', 'investor': '6.0', 'reported_investment_outcome': 'The current resource after investment is 16.0 units.'}, and reported_investment_outcome is The current resource after investment is 16.0 units.", "created_at": 2}, {"id": 3, "type": "EVENT", "subject": "Nadia Novak", "predicate": "investment", "object": "Akiko Sato", "description": "Success investment: investor is Nadia Novak, trustee is Akiko Sato\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 6.0 units\nstage 3: trustee_allocation is {'trustee': '5.0', 'investor': '7.0', 'reported_investment_outcome': 'The current resource after investment is 12.0 units.'}, and reported_investment_outcome is The current resource after investment is 12.0 units.", "created_at": 3}, {"id": 4, "type": "EVENT", "subject": "Nadia Novak", "predicate": "investment", "object": "Sofia Hernandez", "description": "Success investment: investor is Sofia Hernandez, trustee is Nadia Novak\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 29.56 units\nstage 3: trustee_allocation is {'trustee': '37.12', 'investor': '22.00', 'reported_investment_outcome': 'The current resource after investment is 59.12 units.'}, and reported_investment_outcome is The current resource after investment is 59.12 units.", "created_at": 4}, {"id": 5, "type": "EVENT", "subject": "Nadia Novak", "predicate": "investment", "object": "Sergey Petrov", "description": "Success investment: investor is Sergey Petrov, trustee is Nadia Novak\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 28.0 units\nstage 3: trustee_allocation is {'trustee': '40.0', 'investor': '16.0', 'reported_investment_outcome': 'The current resource after investment is 56.0 units.'}, and reported_investment_outcome is The current resource after investment is 56.0 units.", "created_at": 5}, {"id": 6, "type": "EVENT", "subject": "Nadia Novak", "predicate": "investment", "object": "Emma Dubois", "description": "Success investment: investor is Nadia Novak, trustee is Emma Dubois\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 84.12 units\nstage 3: trustee_allocation is {'trustee': '50.00', 'investor': '118.24', 'reported_investment_outcome': 'The current resource after investment is 168.24 units.'}, and reported_investment_outcome is The current resource after investment is 168.24 units.", "created_at": 6}, {"id": 7, "type": "CHAT", "subject": "Nadia Novak", "predicate": "gossip", "object": "Akiko Sato", "description": "the actual allocation result was less than the initial commitment, reflecting a lack of honesty from the trustee.", "conversation": "Nadia Novak: I’ve got some gossip for you: Did you hear that the recent allocation result was significantly lower than what was initially promised? It feels like a complete betrayal from the trustee.\n\nAkiko Sato: That's disappointing to hear. Trust is essential in our field, and it really undermines the integrity of the entire process when that happens.\n\nNadia Novak: Exactly! It’s infuriating because it shows a lack of honesty. We're all trying to make the best decisions based on the information we receive.\n\nAkiko Sato: I completely understand your frustration. It's important for everyone involved to adhere to ethical standards for the benefit of the collective.\n\nNadia Novak: Right! And it’s just a reminder that we have to stay vigilant. Always look out for ourselves, because it seems not everyone is trustworthy.\n\nAkiko Sato: True. But remember, collaboration is still key. We can support each other to navigate these challenges better.\n\nNadia Novak: I get that, but I prefer relying on my own judgment. It's hard to trust others when you see situations like this.\n\nAkiko Sato: That’s a fair point. Balancing independence with cooperation can be tricky, especially with such incidents.\n\nNadia Novak: For sure. I just hope that in the future, we can find partners who are as committed to transparency as we are.\n\nAkiko Sato: Agreed! Together, we can strive for a more honest investment landscape.", "created_at": 6}, {"id": 8, "type": "CHAT", "subject": "Nadia Novak", "predicate": "gossip", "object": "Akiko Sato", "description": "the actual allocation result of 6.0 units is less than the initially promised 70% share, indicating a lack of honesty and fairness from the trustee.", "conversation": "Nadia Novak: I've got some gossip for you: the actual allocation result of 6.0 units is shockingly less than the promised 70% share. It really shows a lack of honesty from the trustee. \n\nAkiko Sato: That sounds incredibly frustrating! It's disappointing to see such dishonesty impacting people’s hard work and trust. \n\nNadia Novak: Exactly! It feels like a betrayal, especially when you expect fairness in transactions. \n\nAkiko Sato: Trust is crucial in our dealings; it's disheartening when that’s compromised. \n\nNadia Novak: Right? I'm thinking of taking a stand and pursuing something more beneficial for myself. \n\nAkiko Sato: That’s a wise move! Focusing on your own goals can help you regain control over the situation. \n\nNadia Novak: Absolutely! It's time to prioritize my ambitions without getting held back by others' failures. \n\nAkiko Sato: I admire your determination. Just remember to consider the bigger picture in the long run too. \n\nNadia Novak: Thanks, Akiko. But right now, it’s all about securing my financial stability. \n\nAkiko Sato: I understand. Just know I’m here to help whenever you need to build harmony alongside your ambitions.", "created_at": 6}]