[{"type": "first-order", "complained ID": "2", "complained name": "David Johnson", "complained role": "investor", "gossiper name": "Hannah Muller", "gossip info": "Hannah Muller expressed disappointment with the trustees, stating they claimed a 20.0 unit investment outcome but only allocated 2.0 units to the investors instead of the promised 14.0. This raises concerns about their trustworthiness and dedication to fair practices, feeling it compromises transparency and ethical practices.", "credibility level": "credible", "whether to spread gossip second-hand": "Yes", "reasons": "The source of the gossip, Hannah Muller, has expressed legitimate concerns regarding the financial practices of David Johnson, which raises important ethical considerations. Since there are no instances of uncredible gossip in society, this information can contribute meaningfully to discussions about transparency and trustworthiness in investments.", "created_at": 6}, {"type": "second-order", "complained ID": "14", "complained name": "Juan Carlos Reyes", "complained role": "trustee", "first-order listener name": "Mohammed Al-Farsi", "original gossiper name": "Sergey Petrov", "gossip info": "Mohammed Al-Farsi expressed concerns regarding significant issues with resource allocation within investment circles, as relayed by Sergey Petrov. He highlighted that if these concerns aren't addressed, it could undermine trust among stakeholders and negatively impact future investments. Mohammed is planning to reach out to other investors to discuss these issues openly and find solutions.", "credibility level": "credible", "gossiper name": "Mohammed Al-Farsi", "created_at": 11}, {"type": "second-order", "complained ID": "7", "complained name": "Hannah Muller", "complained role": "trustee", "first-order listener name": "Akiko Sato", "original gossiper name": "Fatima Ali", "gossip info": "Akiko Sato expressed concerns about troubling claims regarding the trustee's actions that could undermine investors' trust. There are inconsistencies mentioned by Fatima that might affect reputations, highlighting the need for transparency and maintaining high ethical standards. Akiko plans to prepare notes for the next meeting to address these issues and emphasize the importance of integrity and cooperation among partners.", "credibility level": "credible", "gossiper name": "Akiko Sato", "created_at": 11}]