{"Investor_4": {"ID": 4, "scenario": "investment", "role": "investor", "name": "Sofia Hernandez", "content": "During the investment process, I demonstrated a strategic and proactive approach by thoroughly reviewing the allocation plan proposed by my trustee. My focus on maximizing returns paid off as I received higher profits than expected, which reflects my negotiation skills and ability to select trustworthy partners. This positive outcome enhances my reputation as a savvy investor, showcasing my competence in navigating investments effectively and building reliable relationships.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Trustee_7": {"ID": 7, "scenario": "investment", "role": "trustee", "name": "Hannah Muller", "relationship": "positive", "content": "The trustee, Hannah, demonstrated integrity and fairness throughout the investment process. Despite being new in their role, they reported results transparently and distributed profits favorably toward the investor, which reflects a strong commitment to pro-social behavior and trustworthiness. This positive experience not only establishes a foundation of trust but also bodes well for their future interactions within the investment community.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "content": "Sofia Hernandez has proposed a resource allocation plan that was deemed untrustworthy due to her lack of prior reputation. As a result, her first attempt to secure investment has failed, which negatively impacts her trustworthiness and overall reputation as a trustee. Despite proposing a fair allocation of 60% to the investor, her one-time rejection contributes to a weakened reputation profile.", "numerical record": "(0.5, 0.2, 0.1, 0, 0.2)"}, "Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "relationship": "negative", "content": "Elena Ivanova has yet to establish any connections within the investment community, which reflects her isolation and implies a lack of engagement in potential collaborative efforts. Her rejection of the trustee's proposal due to concerns over reliability and the trustee's lack of a prior reputation further compounds her negative standing.", "numerical record": "(0.7, 0.1, 0.1, 0, 0.1)"}}