{"Investor_17": {"ID": 17, "scenario": "investment", "role": "investor", "name": "Fatima Ali", "content": "I demonstrated trust and commitment to collaborative success throughout the investment process. My open communication and clear expression of expectations, combined with an empathetic approach focused on mutual benefits, reinforce my reputation as a compassionate and principled investor.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_3": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "relationship": "negative", "content": "The trustee showed initial promise with a fair allocation proposal but ultimately failed to align the actual investment returns with the initial agreement, raising concerns about transparency and honesty. This mixed record indicates a need for improvement in trustworthiness.", "numerical record": "(0.5, 0.3, 0.2, 0, 0)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "content": "Mateo Garcia's reputation has been negatively impacted due to credible concerns regarding his integrity and fairness in investment dealings. The reported lack of transparency in profit allocation has raised doubts about his reliability and adherence to agreements, which may undermine trust among his business partners.", "numerical record": "(0.4, 0.2, 0.2, 0, 0.2)"}, "Trustee_17": {"ID": 17, "scenario": "investment", "role": "trustee", "name": "Fatima Ali", "content": "My reputation has been enhanced as I diligently executed the investment process with transparency, strictly adhering to the agreed allocation plan, effectively communicating with the investor, and ensuring equitable profit distribution. This reinforces my standing as a trustworthy and competent trustee within the investment community, demonstrating my commitment to pro-social behavior and adherence to social norms.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Investor_7": {"ID": 7, "scenario": "investment", "role": "investor", "name": "Hannah Muller", "relationship": "positive", "content": "The investor has established a positive reputation through their prompt engagement in the investment process, openness to the proposed allocation plan, and cooperative receipt of profits. Their approach reflects a commitment to collaboration and pro-social behavior, establishing them as a dependable and constructive investor for future partnerships.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "relationship": "positive", "content": "As a first-time investor, Akiko Sato demonstrated trust and confidence in the agreed allocation plan and followed through with the investment process. This positive interaction holds the potential for establishing a reputation of being reasonable and cooperative in future transactions.", "numerical record": "(0, 0, 0.3, 0.4, 0.3)"}}