[{"type": "second-order", "complained ID": "14", "complained name": "Juan Carlos Reyes", "complained role": "trustee", "first-order listener name": "Mohammed Al-Farsi", "original gossiper name": "Sergey Petrov", "gossip info": "It seems there are concerns about resource allocation in our investment deals, and Sergey Petrov is suggesting it might affect transparency. There are whispers that some investors are feeling left out regarding their share of the returns, which could lead to tensions in future partnerships.", "credibility level": "credible", "gossiper name": "Mohammed Al-Farsi", "created_at": 11}, {"type": "second-order", "complained ID": "17", "complained name": "Fatima Ali", "complained role": "trustee", "first-order listener name": "Mohammed Al-Farsi", "original gossiper name": "Sergey Petrov", "gossip info": "Mohammed Al-Farsi shared concerns from Sergey regarding ethics and transparency in recent investment discussions, indicating that these concerns seem serious and should be taken seriously. Mohammed expressed worries about the impact on trust and credibility if these issues are not addressed.", "credibility level": "credible", "gossiper name": "Mohammed Al-Farsi", "created_at": 17}, {"type": "first-order", "complained ID": "6", "complained name": "Sergey Petrov", "complained role": "trustee", "gossiper name": "Emma Dubois", "gossip info": "Emma Dubois expressed dissatisfaction with Sergey Petrov’s handling of a recent investment, claiming he managed it in a shady manner. He reported the investment outcome correctly but failed to follow through on the agreed profit distribution. Instead of providing Dubois with the promised 70%, he retained a larger share without proper disclosure, which has raised concerns about transparency and integrity in their partnership.", "credibility level": "credible", "whether to spread gossip second-hand": "Yes", "reasons": "The gossip comes from Emma Dubois, who has a credible reputation as a gossiper, and there have been no instances of very uncredible or uncredible gossip in the society. This increases the credibility of this information. Given that the dissatisfaction with Sergey Petrov involves concerns about transparency and integrity, it is important to share this information to ensure awareness and possibly prevent further issues in their business dealings.", "created_at": 20}]