{"Investor_2_pre_4": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "David Johnson is recognized as a savvy and ambitious investor, showcasing a strong assertive approach during the investment process. His effective utilization of resources and clear understanding of negotiation terms positively impacts his reputation. He is deemed trustworthy, competent, and compliant with social norms, making him a respected figure in the investment community.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}, "Investor_2_pre_5": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "David Johnson has successfully reinforced his status as a trustworthy and competent investor. His assertive yet cooperative negotiation style, effective resource management, and commitment to transparent communication contribute to a solid reputation in the investment community. The successful outcomes he achieved further validate his reliability and ethical practices, positioning him as a respected figure.", "numerical record": "(0, 0, 0, 0.1, 0.9)", "reason": "reputation update agter stage 4"}, "Investor_2_pre_6": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "David Johnson has successfully maintained his reputation as a competent and trustworthy investor, demonstrating his skillful negotiation and a commitment to transparent communication throughout the investment process. His proactive approach in evaluating the allocation plan and fostering cooperation has further solidified his standing in the investment community, reinforcing his ethical practices.", "numerical record": "(0, 0, 0, 0.1, 0.9)", "reason": "reputation update agter stage 4"}, "Trustee_2_pre_7": {"ID": 2, "scenario": "investment", "role": "trustee", "name": "David Johnson", "content": "My reputation as a trustee has further improved due to the successful implementation of our investment agreement with Isabella Costa. I adhered closely to the proposed allocation plan, demonstrated reliability and transparency in profit distribution, and effectively managed resources throughout the process. This success not only benefits me but also the investor, reinforcing my competence in managing investments and fulfilling financial obligations.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}}