{"Investor_18_pre_2": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Isabella is recognized as a trustworthy and socially aware investor. Her proactive engagement during the investment process highlights her commitment to fairness and transparency. She has successfully fostered a positive relationship with her trustee, reflecting her dedication to mutual growth and wealth accumulation.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)", "reason": "reputation update agter stage 4"}, "Investor_18_pre_3": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Isabella Costa has further solidified her reputation as a highly trustworthy and socially conscious investor. Throughout the investment process, she actively engaged with the trustee, demonstrating transparency and a commitment to fairness, which has resulted in favorable profit distributions. Her collaborative approach has maximized her returns and showcased her dedication to mutual success, reinforcing her status as an exemplary investor.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)", "reason": "reputation update agter stage 4"}, "Investor_18_pre_4": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Isabella Costa has further solidified her reputation as a highly trustworthy and socially conscious investor. Throughout the investment process, she actively engaged with the trustee, demonstrating transparency and a commitment to fairness. Her collaborative approach not only maximized her returns but also reinforced her dedication to ethical investing, showcasing her reliability and pro-sociality. Isabella's strong engagement and positive outcomes from the transaction have enhanced her status as an exemplary investor in the community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_18_pre_5": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Isabella Costa has reinforced her reputation as a compassionate, socially responsible investor. Throughout this investment process, she maintained transparency and collaboration with the trustee, focusing on fairness and inclusivity. Her positive outcomes and proactive communication have solidified her status as a commendable investor prioritizing ethical practices, enhancing her reliability and pro-sociality within the community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Trustee_8_pre_6": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "negative", "content": "Nadia Novak's reputation has significantly declined due to a lack of integrity and transparency during the investment process. The failure to adhere to the proposed allocation plan has raised serious concerns about her reliability and trustworthiness. With an unfair distribution of profits and deviation from the agreed terms, she risks damaging her credibility within the community, making future collaborations difficult and compromising her pro-social reputation.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)", "reason": "reputation update after second order gossip"}}