{"Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "content": "I have reinforced my reputation as a reliable and trustworthy investor through proactive communication and a commitment to transparency during the investment with James Wang. Achieving an outcome of 19.2 units, which exceeded expectations, showcases my focus on sustainable growth and positive relationship building. I am seen as a cooperative partner who fosters a strong partnership climate, enhancing my standing in the investment community.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "The trustee has shown honesty and fairness during the transaction, exceeding my expectations while adhering to the agreed-upon allocation plan. This reflects a commitment to my interests and integrity in dealings, warranting a positive update to their reputation for reliability and concern for investor well-being.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "positive", "content": "Emma Dubois has shown exceptional integrity and fairness, having accurately reported the investment outcome and distributed resources beyond the initial agreement. Her actions reflect a strong commitment to mutual benefit and trustworthiness, enhancing her reputation as a reliable trustee in the investment environment.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia has established a strong initial reputation as an honest and committed trustee. Her transparency and willingness to exceed the promised allocation to 19.2 units demonstrate her integrity and dedication to the investor's interests. This performance not only fulfills but enhances the trustworthiness and pro-sociality aspects of her role, indicating she is likely to foster fruitful relationships in the future.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_5": {"ID": 5, "scenario": "investment", "role": "trustee", "name": "James Wang", "relationship": "neutral", "content": "James Wang exhibited a commitment to prioritizing my interests, as demonstrated by exceeding the initial allocation, although this came at the expense of strict adherence to the original agreement. His behavior indicates good intent, but the lack of clarity in communication regarding the changes may impede trust-building. As a first-time trustee, he has the potential to improve his reputation with better transparency and communication in future investments.", "numerical record": "(0.1, 0.1, 0.2, 0, 0.6)"}}