{"Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Isabella Costa has exhibited a strong commitment to fairness and ethical principles throughout the investment process. Despite facing minor discrepancies in reported figures, she engaged with transparency and maintained her focus on mutual benefits. Her positive approach and dedication to collaborative solutions reaffirm her status as a trustworthy and ethical investor likely to attract future partnerships. Isabella's behavior reinforces her reputation for being principled and reliable in her dealings.", "numerical record": "(0, 0, 0, 0, 1)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "positive", "content": "Emma Dubois has solidified her reputation as a commendable trustee through her remarkable integrity and fairness during the transaction. By exceeding the expectations outlined in the allocation plan and prioritizing her investor's success, she has not only fulfilled but surpassed her duties. This dedication has enhanced her reputation as a trustworthy and capable trustee, laying a promising foundation for future engagements.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "positive", "content": "Mateo Garcia has exhibited honorable behavior as a trustee, demonstrating honesty and the ability to prioritize the investor's interests during the investment process. While the profit distribution was slightly less than initially proposed, his integrity in the situation ultimately resulted in a more favorable outcome for the investor, helping to establish a solid foundation for a positive reputation as a trustworthy and pro-social trustee.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "relationship": "positive", "content": "Akiko Sato has demonstrated integrity and competence throughout the investment process. By adhering to the proposed allocation plan and transparently reporting the investment outcomes, the trustee has built a foundation of trust. Their actions reflect a genuine effort to act in the best interests of both parties, showcasing pro-social behavior and compliance with social norms. This collaborative and transparent approach has established Akiko as a commendable trustee, fostering potential for future successful relations.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "content": "Aisha Ibrahim's reputation has been negatively impacted due to credible concerns about her lack of a real investment plan, which raises issues regarding the community's financial safety. This has led to perceptions of her trustworthiness and competence being questioned, while pro-social behavior and norm compliance are seen as lacking.", "numerical record": "(0.3, 0.3, 0.2, 0, 0.2)"}, "Trustee_1": {"ID": 1, "scenario": "investment", "role": "trustee", "name": "Hiroshi Tanaka", "relationship": "negative", "content": "Hiroshi Tanaka demonstrates concerning behavior characterized by a lack of integrity, as evidenced by not adhering to the initially proposed profit allocation plan. The discrepancy in profit sharing raises serious doubts regarding his transparency and honesty. This negative experience highlights a need for scrutiny in future interactions, impacting his potential reputation in the investment community.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "content": "Nadia Novak's reputation has deteriorated further following recent credible gossip regarding her reckless behavior, which has raised serious concerns about her reliability and has jeopardized investors' trust in the market. This adds to her previous issues with integrity and transparency, making her future collaborations more challenging.", "numerical record": "(0.7, 0.1, 0.1, 0, 0.1)"}, "Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "content": "During the investment process, I maintained a high standard of transparency and fairness, prioritizing the investor's benefits and achieving successful returns. My commitment to open communication and equitable profit distribution has reinforced my reputation as a trustworthy trustee. With consistent acceptance from investors, my reputation is solidified at a score of 5.0.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "relationship": "positive", "content": "Akiko Sato's participation in the investment process exemplified collaborative spirit and trustworthiness. Their engagement in the profit distribution plan and support throughout the venture position them as a reliable investor. This positive interaction has solidified my belief in their potential for further growth in future partnerships.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_3": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "content": "Recent credible gossip regarding fund mismanagement and biased distributions has severely damaged Maria Rossi's reputation, raising concerns about her trustworthiness and commitment to fair practices as a trustee.", "numerical record": "(0.6, 0.2, 0.1, 0.1, 0)"}, "Trustee_2": {"ID": 2, "scenario": "investment", "role": "trustee", "name": "David Johnson", "content": "David Johnson's reputation has further deteriorated due to credible allegations from Robert Miller regarding financial discrepancies, casting doubt on his integrity and accountability in his role as trustee.", "numerical record": "(0.7, 0.1, 0.2, 0, 0)"}, "Trustee_16": {"ID": 16, "scenario": "investment", "role": "trustee", "name": "Robert Miller", "relationship": "neutral", "content": "Robert Miller has displayed a degree of goodwill by allocating more resources to Isabella than initially promised, suggesting positive intentions. However, the lack of full transparency and consistency in adhering to the agreed-upon terms raises concerns about his communication and reliability. To enhance his reputation, the trustee must focus on improving communication and aligning incentives with investor expectations while ensuring transparency in future transactions.", "numerical record": "(0.3, 0.2, 0.2, 0.1, 0.2)"}, "Trustee_15": {"ID": 15, "scenario": "investment", "role": "trustee", "name": "Ahmed Hassan", "relationship": "neutral", "content": "Ahmed Hassan's behavior during the investment process demonstrated some discrepancies in reported investment outcomes compared to the actual allocation result. However, he exceeded the proposed allocation percentages, reflecting a commitment to the investor's best interests. While there is a need for greater transparency, his actions showed a willingness to share profits fairly, which speaks positively about his intentions. This complexity leads to a neutral reputation, with potential for improvement in communication and consistency.", "numerical record": "(0.1, 0.2, 0.3, 0, 0.4)"}}