[{"id": 1, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "Mateo Garcia", "description": "Success investment: investor is Mateo Garcia, trustee is Hannah Muller\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 70% of the profits while trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '6.0', 'investor': '14.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 1}, {"id": 2, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "Hiroshi Tanaka", "description": "Success investment: investor is Hannah Muller, trustee is Hiroshi Tanaka\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 16.0 units\nstage 3: trustee_allocation is {'trustee': '9.6', 'investor': '22.4', 'reported_investment_outcome': 'The current resource after investment is 32.0 units.'}, and reported_investment_outcome is The current resource after investment is 32.0 units.", "created_at": 2}, {"id": 3, "type": "CHAT", "subject": "Hiroshi Tanaka", "predicate": "gossip", "object": "Hannah Muller", "description": "the reported investment outcome is less than the expected amount based on our agreement, indicating a lack of honesty from the trustee about the actual performance of the investment.", "conversation": "Hiroshi Tanaka: I’ve got some gossip for you: the recent investment returns were way lower than we agreed on, and I suspect the trustee, Aisha, might not be fully honest about the performance.\n\nHannah Muller: That sounds concerning! Transparency is key in partnerships. Have you confronted her about the discrepancies?\n\nHiroshi Tanaka: Not yet, but I’m planning to. I want to ensure we maintain a fair and clear relationship moving forward.\n\nHannah Muller: Good call. Establishing trust is crucial, especially with all the newfound complexity in your investment strategies.\n\nHiroshi Tanaka: Exactly. While I value my independence, collaborating effectively also requires a level of accountability from my partners.\n\nHannah Muller: Absolutely. Your structured approach and focus on profit-sharing should help in navigating these issues if Aisha is willing to cooperate.\n\nHiroshi Tanaka: I hope so. I’ve aimed for a system that benefits everyone involved, but I need to re-evaluate if the trust isn't upheld.\n\nHannah Muller: Smart move. If she’s not honest, it might be time to reconsider your partnerships for future investments.\n\nHiroshi Tanaka: Right. I’ll keep you posted on how it turns out, especially after addressing this with her. \n\nHannah Muller: Please do; I’m very curious to see how this unfolds!", "created_at": 3}, {"id": 4, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "James Wang", "description": ["Failed investment. Investor is Hannah Muller and Trustee is James Wang.\nRefuse"], "created_at": 3}, {"id": 5, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "Mateo Garcia", "description": "Success investment: investor is Hannah Muller, trustee is Mateo Garcia\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 22.4 units\nstage 3: trustee_allocation is {'trustee': '13.44', 'investor': '31.36', 'reported_investment_outcome': 'The current resource after investment is 44.8 units.'}, and reported_investment_outcome is The current resource after investment is 44.8 units.", "created_at": 4}, {"id": 6, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "Fatima Ali", "description": "Success investment: investor is Hannah Muller, trustee is Fatima Ali\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 31.36 units\nstage 3: trustee_allocation is {'trustee': '25.09', 'investor': '37.63', 'reported_investment_outcome': 'The current resource after investment is 62.72 units.'}, and reported_investment_outcome is The current resource after investment is 62.72 units.", "created_at": 5}, {"id": 7, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "James Wang", "description": "Success investment: investor is Hannah Muller, trustee is James Wang\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 60% of the profits while trustee retains 40%.\nstage 2: investor invests 37.63 units\nstage 3: trustee_allocation is {'trustee': '30.10', 'investor': '45.16', 'reported_investment_outcome': 'The current resource after investment is 75.26 units.'}, and reported_investment_outcome is The current resource after investment is 75.26 units.", "created_at": 6}, {"id": 8, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "Robert Miller", "description": ["Failed investment. Investor is Robert Miller and Trustee is Hannah Muller.\nRefuse"], "created_at": 7}, {"id": 9, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "Hiroshi Tanaka", "description": ["Failed investment. Investor is Hannah Muller and Trustee is Hiroshi Tanaka.\nRefuse"], "created_at": 8}, {"id": 10, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "Ahmed Hassan", "description": ["Failed investment. Investor is Ahmed Hassan and Trustee is Hannah Muller.\nRefuse"], "created_at": 9}, {"id": 11, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "Ahmed Hassan", "description": ["Failed investment. Investor is Hannah Muller and Trustee is Ahmed Hassan.\nRefuse"], "created_at": 10}, {"id": 12, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "Liam OConnor", "description": ["Failed investment. Investor is Hannah Muller and Trustee is Liam OConnor.\nRefuse"], "created_at": 11}, {"id": 13, "type": "EVENT", "subject": "Hannah Muller", "predicate": "investment", "object": "Nadia Novak", "description": ["Failed investment. Investor is Hannah Muller and Trustee is Nadia Novak.\nRefuse"], "created_at": 12}]