{"Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "content": "I effectively managed the investment process, maintaining transparent communication and adhering to the proposed allocation plan, which has strengthened my reputation as a trustworthy trustee. This successful transaction reflects my commitment to fairness and integrity, enhancing my credibility and laying the groundwork for future collaborative endeavors.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "relationship": "positive", "content": "As a first-time investor, Isabella Costa showed a proactive approach by accepting the proposed allocation plan and investing promptly. This willingness to collaborate sets a strong foundation for her reputation, making her appear reliable and cooperative. Given her lack of prior reputation, this positive engagement suggests a forthcoming good standing among peers.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Investor_15": {"ID": 15, "scenario": "investment", "role": "investor", "name": "Ahmed Hassan", "relationship": "positive", "content": "This marks my first partnership with Ahmed Hassan, and their open engagement and trust throughout the investment process indicate a strong foundational relationship. Their willingness to adhere to the allocation plan and collaborate positively suggests they will develop a reputation for reliability and pro-sociality in future transactions.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_13": {"ID": 13, "scenario": "investment", "role": "investor", "name": "Emma Dubois", "content": "Throughout the investment process, I engaged actively with full transparency and integrity. My clear communication and collaborative approach led to a profitable allocation that exceeded initial expectations. I demonstrated trustworthiness and a commitment to ethical investing, which has significantly enhanced my reputation as a reliable investor. My previous experiences have solidified my standing, making me a sought-after partner for future investments.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_3": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "relationship": "positive", "content": "Maria Rossi has shown remarkable integrity and transparency throughout the investment process, adhering to the proposed allocation plan. By providing a fair distribution that favored the investor, she reinforced her commitment to building a positive and innovative partnership. Her actions have established her as a trustworthy and competent trustee, boosting her reputation significantly.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_0": {"ID": 0, "scenario": "investment", "role": "trustee", "name": "Liam OConnor", "relationship": "positive", "content": "Liam OConnor has shown exceptional responsibility and integrity throughout the investment process, exceeding initial proposals and demonstrating a commitment to fair and transparent profit distribution. His actions reflected a strong adherence to social norms and a pro-social approach in prioritizing the investor's financial growth. This positive behavior has laid a strong foundation for building his reputation as a trustworthy and competent trustee, paving the way for future collaborations.", "numerical record": "(0, 0, 0, 0.1, 0.9)"}}