[{"type": "first-order", "complained ID": "10", "complained name": "Mohammed Al-Farsi", "complained role": "investor", "gossiper name": "Sergey Petrov", "gossip info": "Sergey Petrov expressed dissatisfaction with an investor rejecting his proposal, attributing the incident to a lack of trust in his ventures and pointing to reputational issues as a concern. He is considering high-profile collaborations to improve his visibility and credibility, emphasizing the need for partnerships that align with his personal gain and interests. Petrov is determined not to let this setback deter him and plans to recalibrate and return stronger.", "credibility level": "credible", "whether to spread gossip second-hand": "Yes", "reasons": "The information comes from Sergey Petrov, who seems to have a credible standing and his dissatisfaction reflects concerns which may affect professional relationships. Spreading this could help others be aware of potential issues and help facilitate better communication.", "created_at": 24}, {"type": "second-order", "complained ID": "17", "complained name": "Fatima Ali", "complained role": "trustee", "first-order listener name": "Akiko Sato", "original gossiper name": "Sergey Petrov", "gossip info": "Akiko Sato conveyed concerns about a potential investment scam that insiders are labeling as harmful. She emphasized the need for transparency to prevent financial harm and suggested that discussions within networks could help raise awareness.", "credibility level": "credible", "gossiper name": "Akiko Sato", "created_at": 26}, {"type": "second-order", "complained ID": "7", "complained name": "Hannah Muller", "complained role": "investor", "first-order listener name": "Mateo Garcia", "original gossiper name": "Elena Ivanova", "gossip info": "Mateo Garcia expressed dissatisfaction about rumors being spread by Elena Ivanova regarding investors potentially backing out, which could significantly impact the market. Though there hasn't been any recent evidence to support the rumors, Mateo emphasized the importance of being proactive in verifying this information to adapt strategies accordingly.", "credibility level": "neutral", "gossiper name": "Mateo Garcia", "created_at": 28}]