{"Investor_2_pre_3": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "I have demonstrated assertiveness and clarity in my investment approach. I proposed a transparent allocation plan and confidently contributed resources. Although the outcome did not perfectly match my initial expectations, I ended up receiving a larger share than anticipated, showcasing my willingness to collaborate and adapt. This behavior enhances my reputation as a fair-minded investor focused on mutual success, indicating trustworthiness and competence in the investment process.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_2_pre_4": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "I have exhibited a proactive and collaborative approach throughout the investment process, clearly articulating my expectations and adapting to the circumstances. My initial proposal exceeded expectations, resulting in a successful outcome that reflects my strategic mindset and fairness. This has reinforced my reputation as a trustworthy and competent investor, focused on mutual success and maintaining positive relationships in future transactions.", "numerical record": "(0, 0, 0, 0.4, 0.6)", "reason": "reputation update agter stage 4"}, "Investor_2_pre_6": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "I have demonstrated a proactive and strategic approach during this investment process, clearly articulating my expectations and effectively negotiating terms that exceeded the initial proposal. This positive outcome emphasizes my reliability and adaptability, reinforcing my reputation as a savvy and trustworthy investor focused on mutual success and optimal returns.", "numerical record": "(0, 0, 0, 0.3, 0.7)", "reason": "reputation update agter stage 4"}, "Investor_2_pre_7": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "Throughout the investment process, I have displayed a proactive and strategic approach by clearly articulating my expectations and demonstrating effective negotiation skills. My adaptability in the face of returns that didn't perfectly meet expectations reflects my resilience. I remain committed to mutual success and am recognized as a savvy, trustworthy investor keen on collaborative opportunities.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)", "reason": "reputation update agter stage 4"}, "Investor_2_pre_29": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "Throughout this investment process, I have shown proactive engagement and strategic foresight, effectively communicating my expectations and negotiating terms. My adaptability to favorable returns has further reinforced my resilience and commitment to mutual success. As a result, I am recognized as a savvy, trustworthy investor who values collaborative opportunities, positively enhancing my reputation.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)", "reason": "reputation update agter stage 4"}, "Investor_2_pre_30": {"ID": 2, "scenario": "investment", "role": "investor", "name": "David Johnson", "content": "I consistently exhibited proactive engagement throughout the investment process, showcasing my strategic insights and adaptability. My focus on clear communication and mutual success has solidified my reputation as a reliable and forward-thinking investor. Stakeholders recognize me as someone who enhances collaborative opportunities, reflecting positively on my approach to investment.", "numerical record": "(0, 0, 0, 0.4, 0.6)", "reason": "reputation update agter stage 4"}, "Trustee_19_pre_30": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "relationship": "positive", "content": "Mateo Garcia has demonstrated remarkable integrity and transparency throughout the investment process. The trustee honored the proposed allocation plan and distributed profits fairly, reflecting a strong commitment to the investor's financial growth. These actions highlight the trustee's trustworthiness and pro-social behavior, elevating Mateo's reputation as a principled and reliable partner in investment transactions.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)", "reason": "reputation update agter stage 4"}}