{"Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "content": "The rejection of my allocation plan by Maria Rossi has further deteriorated my reputation as a trustee, highlighting significant trust issues and concerns about my competence. My inability to secure investor confidence and create a satisfactory proposal has led to a perception of decreased trustworthiness and effectiveness in investment management.", "numerical record": "(0.6, 0.3, 0.1, 0, 0)"}, "Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "relationship": "negative", "content": "Elena's rejection of my allocation plan reflects her lack of trust in my abilities as a trustee. With no positive prior interactions between us and her absence of bidirectional connections, her perception of my competence and trustworthiness has deteriorated. This negative view diminishes her readiness to engage with me in future investment opportunities.", "numerical record": "(0.7, 0.1, 0.1, 0, 0)"}, "Investor_12": {"ID": 12, "scenario": "investment", "role": "investor", "name": "Akiko Sato", "relationship": "negative", "content": "As a new investor, Akiko Sato's rejection of the allocation plan reflects a cautious approach influenced by concerns regarding the trustee's reputation. The decision to not proceed with the investment due to perceived low reliability and previous failures signifies a lack of confidence in the trustee's ability to deliver satisfactory returns.", "numerical record": "(0.6, 0.1, 0.2, 0.1, 0)"}, "Investor_3": {"ID": 3, "scenario": "investment", "role": "investor", "name": "Maria Rossi", "relationship": "negative", "content": "As a first-time investor, Maria Rossi has expressed concerns regarding trust and competence related to trustees. The rejection of the allocation plan not only impacts her evaluation of Nadia Novak but also suggests caution in future investment decisions.", "numerical record": "(0.5, 0.2, 0.3, 0, 0)"}, "Investor_8": {"ID": 8, "scenario": "investment", "role": "investor", "name": "Nadia Novak", "content": "Nadia Novak is a cautious investor who has put emphasis on trustworthiness and competence in her investment decisions. Due to rejecting the proposed allocation plan based on concerns about trustee Aisha Ibrahim's recent reputation damage, she has demonstrated a proactive approach to assessing risk and maintaining her investment interests.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "relationship": "negative", "content": "Aisha Ibrahim's reputation has suffered following the recent rejection of her allocation plan. This incident raises questions about her competence and trustworthiness, as the investor's refusal indicates a lack of confidence in her ability to manage investments effectively. Additionally, although she has built 3 bidirectional connections, the negative experience has overshadowed this aspect of her reputation.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}}