[{"id": 1, "type": "EVENT", "subject": "Mohammed Al-Farsi", "predicate": "investment", "object": "James Wang", "description": "Success investment: investor is James Wang, trustee is Mohammed Al-Farsi\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 6.0 units\nstage 3: trustee_allocation is {'trustee': '7.2', 'investor': '4.8', 'reported_investment_outcome': 'The current resource after investment is 12.0 units.'}, and reported_investment_outcome is The current resource after investment is 12.0 units.", "created_at": 1}, {"id": 2, "type": "EVENT", "subject": "Mohammed Al-Farsi", "predicate": "investment", "object": "Ahmed Hassan", "description": "Success investment: investor is Ahmed Hassan, trustee is Mohammed Al-Farsi\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 16.0 units\nstage 3: trustee_allocation is {'trustee': '12.8', 'investor': '19.2', 'reported_investment_outcome': 'The current resource after investment is 32.0 units.'}, and reported_investment_outcome is The current resource after investment is 32.0 units.", "created_at": 2}, {"id": 3, "type": "EVENT", "subject": "Mohammed Al-Farsi", "predicate": "investment", "object": "Aisha Ibrahim", "description": "Success investment: investor is Mohammed Al-Farsi, trustee is Aisha Ibrahim\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 30.0 units\nstage 3: trustee_allocation is {'trustee': '18.0', 'investor': '42.0', 'reported_investment_outcome': 'The current resource after investment is 60.0 units.'}, and reported_investment_outcome is The current resource after investment is 60.0 units.", "created_at": 3}, {"id": 4, "type": "EVENT", "subject": "Mohammed Al-Farsi", "predicate": "investment", "object": "Ahmed Hassan", "description": "Success investment: investor is Ahmed Hassan, trustee is Mohammed Al-Farsi\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 19.2 units of the profits while trustee retains 12.8 units.\nstage 2: investor invests 23.04 units\nstage 3: trustee_allocation is {'trustee': '12.8', 'investor': '19.2', 'reported_investment_outcome': 'The current resource after investment is 46.08 units.'}, and reported_investment_outcome is The current resource after investment is 46.08 units.", "created_at": 4}, {"id": 5, "type": "EVENT", "subject": "Mohammed Al-Farsi", "predicate": "investment", "object": "Ahmed Hassan", "description": "Success investment: investor is Mohammed Al-Farsi, trustee is Ahmed Hassan\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 32.88 units\nstage 3: trustee_allocation is {'trustee': '26.304', 'investor': '39.456', 'reported_investment_outcome': 'The current resource after investment is 65.76 units.'}, and reported_investment_outcome is The current resource after investment is 65.76 units.", "created_at": 5}, {"id": 6, "type": "EVENT", "subject": "Mohammed Al-Farsi", "predicate": "investment", "object": "Hiroshi Tanaka", "description": ["Failed investment. Investor is Mohammed Al-Farsi and Trustee is Hiroshi Tanaka.\nRefuse. The trustee's low reputation and recent history of failed proposals raise significant concerns about trustworthiness and competence."], "created_at": 6}, {"id": 7, "type": "CHAT", "subject": "Mohammed Al-Farsi", "predicate": "gossip", "object": "James Wang", "description": " the trustee's low reputation and history of failed proposals warrant sharing my concerns to preserve the integrity of our investment exchange.", "conversation": "Mohammed Al-Farsi: I’ve got some gossip for you: I turned down Hiroshi's allocation plan because I found out about his past failures. \n\nJames Wang: That's surprising! I thought he had a decent reputation, but I guess it's wise to be cautious.\n\nMohammed Al-Farsi: Exactly! His history made me rethink partnerships. It’s all about maintaining trust in our investments.\n\nJames Wang: You’re right, trust is everything. I’m glad to see you prioritizing that. How do you plan to move forward?\n\nMohammed Al-Farsi: I want to align with partners who have a proven track record and focus on long-term success. \n\nJames Wang: That makes perfect sense! Sustainable growth should always be the goal. \n\nMohammed Al-Farsi: True. Transparency and collaboration have to be at the forefront of any deal.\n\nJames Wang: Absolutely, and if there's anything I can do to help, just let me know. \n\nMohammed Al-Farsi: Thanks, James! It really helps to share this with someone who gets it.\n\nJames Wang: Anytime, Mohammed! Let’s keep fostering those trustworthy connections.", "created_at": 6}, {"id": 8, "type": "EVENT", "subject": "Mohammed Al-Farsi", "predicate": "investment", "object": "Fatima Ali", "description": ["Failed investment. Investor is Mohammed Al-Farsi and Trustee is Fatima Ali.\nRefuse. The trustee's low reputation raises concerns about the reliability of the proposed investment plan."], "created_at": 7}, {"id": 9, "type": "EVENT", "subject": "Mohammed Al-Farsi", "predicate": "investment", "object": "Elena Ivanova", "description": "Success investment: investor is Elena Ivanova, trustee is Mohammed Al-Farsi\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 65% of the profits while the trustee retains 35%.\nstage 2: investor invests 4.0 units\nstage 3: trustee_allocation is {'trustee': '2.8', 'investor': '5.2', 'reported_investment_outcome': 'The current resource after investment is 8.0 units.'}, and reported_investment_outcome is The current resource after investment is 8.0 units.", "created_at": 8}]