[{"id": 1, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Hiroshi Tanaka", "description": "Success investment: investor is Sergey Petrov, trustee is Hiroshi Tanaka\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 70% of the profits while trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '8.0', 'investor': '12.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 1}, {"id": 2, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Akiko Sato", "description": "Success investment: investor is Akiko Sato, trustee is Sergey Petrov\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 60% of the profits while trustee retains 40%.\nstage 2: investor invests 8.5 units\nstage 3: trustee_allocation is {'trustee': '6.8', 'investor': '10.2', 'reported_investment_outcome': 'The current resource after investment is 17.0 units.'}, and reported_investment_outcome is The current resource after investment is 17.0 units.", "created_at": 2}, {"id": 3, "type": "CHAT", "subject": "Hiroshi Tanaka", "predicate": "gossip", "object": "Sergey Petrov", "description": " indicating a lack of honesty and fairness in their handling of the transaction.", "conversation": "Hiroshi Tanaka: I’ve got some gossip for you: I heard about a recent deal that didn't go as planned, leaving people questioning the integrity of those involved.\n\nSergey Petrov: Really? That's interesting. You know I always say, any failed transaction often reveals a lack of honesty.\n\nHiroshi Tanaka: Exactly! It seems some players were too focused on their own advantages, ignoring fairness in the process.\n\nSergey Petrov: It’s a classic case of self-interest taking precedence over ethical conduct. Did anyone lose out significantly?\n\nHiroshi Tanaka: Yes, several investors were left in the lurch, feeling betrayed and frustrated by the whole situation.\n\nSergey Petrov: That's unfortunate. They should have seen it coming; people like that are always looking to maximize their own gains.\n\nHiroshi Tanaka: True, and it highlights how important it is to research partners thoroughly before jumping into any transaction.\n\nSergey Petrov: Absolutely, alliances should be built on trust, but many forget that in the pursuit of profit.\n\nHiroshi Tanaka: Precisely. It's a harsh lesson, but one that will hopefully encourage better practices in future dealings. \n\nSergey Petrov: Amen to that. It’s all about maintaining integrity while chasing success.", "created_at": 2}, {"id": 4, "type": "CHAT", "subject": "Akiko Sato", "predicate": "gossip", "object": "Sergey Petrov", "description": "The information shared by Hiroshi Tanaka appears to be credible based on the absence of any 'very uncredible' or 'uncredible' instances of gossip in our society. Given that the situation could impact trust and relationships among stakeholders, it could be important for others to be aware of this behavior so that they can make informed decisions about future dealings. However, care should be taken to ensure that it is framed as a cautionary insight rather than outright accusations.", "conversation": "Sergey Petrov: I’ve got some gossip for you: there’s talk about Hiroshi Tanaka and his recent dealings; it seems some of his methods might not be as trustworthy as he presents them.\n\nAkiko Sato: That sounds concerning. I hope it’s just a misunderstanding; trust is vital in our field. What specifically have you heard?\n\nSergey Petrov: Word is he’s been bending the truth to gain an upper hand with partners; it could lead to some serious fallout if it doesn’t get addressed soon.\n\nAkiko Sato: If that’s true, it could undermine his relationships. We should approach this delicately to avoid unnecessary damage to anyone’s reputation.\n\nSergey Petrov: Exactly. I think it’s better to be cautious; sharing this insight could help others make informed choices moving forward.\n\nAkiko Sato: I agree, but let's ensure it’s framed positively, focusing on the importance of transparency and trust.\n\nSergey Petrov: Right. We should encourage a culture of honesty so that everyone can benefit from fair dealings.\n\nAkiko Sato: Yes, nurturing collaboration is key. It’s essential we cultivate a supportive environment where everyone can thrive together.\n\nSergey Petrov: Ultimately, it’s about safeguarding our interests while promoting collective success; we need to strike that balance. \n\nAkiko Sato: Absolutely, and staying vigilant will help us through any potential issues that might arise.", "created_at": 2}, {"id": 5, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Maria Rossi", "description": "Success investment: investor is Sergey Petrov, trustee is Maria Rossi\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 15.0 units\nstage 3: trustee_allocation is {'trustee': '18.0', 'investor': '12.0', 'reported_investment_outcome': 'The current resource after investment is 30.0 units.'}, and reported_investment_outcome is The current resource after investment is 30.0 units.", "created_at": 3}, {"id": 6, "type": "CHAT", "subject": "Sergey Petrov", "predicate": "gossip", "object": "Akiko Sato", "description": " indicating the trustee's lack of honesty in their performance.", "conversation": "Sergey Petrov: I’ve got some gossip for you: Did you hear about Ivan’s shady dealings lately? People are questioning his honesty in those investment proposals. \n\nAkiko Sato: Really? That’s concerning. Trust is so important in our field. What exactly are they saying about him?\n\nSergey Petrov: They’re saying he’s been manipulating numbers to attract investors. It’s alarming how far some will go for profit.\n\nAkiko Sato: I can’t believe he would risk his reputation like that. It undermines the trust we need in this industry.\n\nSergey Petrov: Exactly! It’s a cutthroat world out there, and I’m all about looking out for myself. But this could backfire on him.\n\nAkiko Sato: True, but it could also affect everyone involved, not just him. I hope others are staying cautious.\n\nSergey Petrov: They should be! I’d never let someone like him take advantage of me. I always watch my own back.\n\nAkiko Sato: That’s wise. I believe in supporting one another, but we must also protect our interests. \n\nSergey Petrov: That’s the spirit! In the end, securing our own position is what really matters. \n\nAkiko Sato: Agreed. It’s a balance—our success shouldn’t come at the cost of integrity.", "created_at": 3}, {"id": 7, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Juan Carlos Reyes", "description": "Success investment: investor is Juan Carlos Reyes, trustee is Sergey Petrov\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 14.8 units\nstage 3: trustee_allocation is {'trustee': '11.84', 'investor': '17.76', 'reported_investment_outcome': 'The current resource after investment is 29.6 units.'}, and reported_investment_outcome is The current resource after investment is 29.6 units.", "created_at": 4}, {"id": 8, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "David Johnson", "description": "Success investment: investor is Sergey Petrov, trustee is David Johnson\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 27.64 units\nstage 3: trustee_allocation is {'trustee': '41.58', 'investor': '13.70', 'reported_investment_outcome': 'The current resource after investment is 55.28 units.'}, and reported_investment_outcome is The current resource after investment is 55.28 units.", "created_at": 5}, {"id": 9, "type": "CHAT", "subject": "Sergey Petrov", "predicate": "gossip", "object": "Akiko Sato", "description": " indicating a lack of honesty and fairness from the trustee.", "conversation": "Sergey Petrov: I’ve got some gossip for you: I heard our trustee has been making shady deals behind the scenes, manipulating investments for personal gain. \n\nAkiko Sato: That sounds troubling! We need transparency in our dealings to ensure everyone is treated fairly, don’t you think?\n\nSergey Petrov: Exactly! It seems they aren’t prioritizing our collective interests, just their own pockets. \n\nAkiko Sato: It’s disheartening to see such dishonesty, especially when trust is essential for successful partnerships.\n\nSergey Petrov: Trust is crucial, and I refuse to let someone undermine my progress. I’m ready to take action. \n\nAkiko Sato: We should approach this carefully, though – addressing it openly might lead to greater accountability.\n\nSergey Petrov: Accountability? More like putting the heat on them! I’ll make it clear that I won't tolerate this behavior. \n\nAkiko Sato: Just remember, we should aim for a solution that fosters unity, not conflict. \n\nSergey Petrov: True, but securing my interests while exposing their deceit is my priority. \n\nAkiko Sato: Balance is key, Sergey. We can pursue our goals while striving for a fair outcome for everyone involved.", "created_at": 5}, {"id": 10, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Nadia Novak", "description": "Failed investment. Investor is Sergey Petrov and Trustee is Nadia Novak.\nRefuse. The investors refused because the parties might be on each other's blacklist.", "created_at": 6}, {"id": 11, "type": "CHAT", "subject": "Sergey Petrov", "predicate": "gossip", "object": "Akiko Sato", "description": " and spreading gossip may protect other investors from making the same mistake.", "conversation": "Sergey Petrov: I’ve got some gossip for you: I heard that a major investment firm just sank millions into a failing tech startup, thinking they could turn it around.\n\nAkiko Sato: That’s surprising! Why would they take such a risk? Don’t they see the potential fallout for everyone involved?\n\nSergey Petrov: Exactly! It's all about their ego; they think they can outsmart the market. But I see it as a clear warning for other investors.\n\nAkiko Sato: That sentiment is important. We all need to learn from other’s mistakes to avoid mutual repercussions.\n\nSergey Petrov: Right! Their overconfidence might mislead others to jump in too soon without due diligence.\n\nAkiko Sato: It’s crucial that we uphold standards of responsibility to promote a more secure investment environment.\n\nSergey Petrov: Agreed! If they lose big, it can shake everyone’s confidence and create unnecessary chaos.\n\nAkiko Sato: True. Collective success needs to be prioritized over reckless ambition in our endeavors.\n\nSergey Petrov: Absolutely! Keeping an eye on these patterns can protect us from the same pitfalls.\n\nAkiko Sato: Let’s make sure to share these insights with others and foster a more constructive investment culture.", "created_at": 6}, {"id": 12, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Sofia Hernandez", "description": "Failed investment. Investor is Sergey Petrov and Trustee is Sofia Hernandez.\nRefuse. Without a prior reputation to evaluate the trustee's reliability, I cannot confidently proceed with this allocation plan.", "created_at": 7}, {"id": 13, "type": "CHAT", "subject": "Sergey Petrov", "predicate": "gossip", "object": "Akiko Sato", "description": " spreading the gossip serves to protect my interests and alert others to potentially untrustworthy trustees.", "conversation": "Sergey Petrov: I've got some gossip for you: there are whispers about a trustee mishandling funds—could jeopardize everyone involved.\n\nAkiko Sato: That sounds concerning! We must ensure transparency to protect everyone's interests.\n\nSergey Petrov: Exactly! It’s essential to circulate this info quickly—better to be cautious than caught off guard.\n\nAkiko Sato: Agreed. We should consider organizing a meeting to discuss the matter openly.\n\nSergey Petrov: A meeting would work, but I prefer a direct approach, maybe alert a few trusted investors first.\n\nAkiko Sato: That’s a good idea, but let's also emphasize collaboration so we can address it collectively.\n\nSergey Petrov: True, but I want to make sure my position remains strong in any discussions.\n\nAkiko Sato: Of course, but balance is key; we should aim for a solution that benefits everyone in the long run.\n\nSergey Petrov: Fair point. Let’s keep an eye on this and act swiftly to secure our interests.\n\nAkiko Sato: Absolutely, keeping communication open will help us navigate this situation effectively.", "created_at": 7}, {"id": 14, "type": "CHAT", "subject": "Hiroshi Tanaka", "predicate": "gossip", "object": "Sergey Petrov", "description": " prompting me to share my doubts in order to protect my interests.", "conversation": "Hiroshi Tanaka: I’ve got some gossip for you: I overheard that our mutual acquaintance is planning to invest heavily in a new tech startup.\n\nSergey Petrov: Really? That’s bold. Do you think it’s a smart move, considering the current market fluctuations?\n\nHiroshi Tanaka: It might be risky, but if it pays off, it could position him quite favorably among competitors.\n\nSergey Petrov: True, but with the level of competition, it could also backfire. Do you trust his judgment on this?\n\nHiroshi Tanaka: I have my doubts; he often rushes into things without fully assessing the risks involved.\n\nSergey Petrov: That’s a red flag. You know I prefer thorough analysis before making any commitments.\n\nHiroshi Tanaka: Exactly! Just like us, we always weigh our options carefully to maintain control over our investments.\n\nSergey Petrov: Right. We wouldn’t want to jeopardize our positions for impulsive decisions. \n\nHiroshi Tanaka: Let’s keep an eye on the situation; it may offer us opportunities to strategize our next moves. \n\nSergey Petrov: Agreed, staying informed is crucial for maximizing our advantages.", "created_at": 8}, {"id": 15, "type": "CHAT", "subject": "Akiko Sato", "predicate": "gossip", "object": "Sergey Petrov", "description": "The information comes from a single source, Hiroshi Tanaka, who may have a valid concern regarding Fatima Ali's decision-making process. Since there are no other instances of gossip classified as very uncredible or uncredible, this information can be seen as credible. Sharing it second-hand might help in assessing Fatima's behavior more closely and could lead to important discussions about risk management and investment strategies.", "conversation": "Sergey Petrov: I’ve got some gossip for you: I heard concerns from Hiroshi about Fatima Ali’s decision-making process. It seems she might be taking undue risks.\n\nAkiko Sato: That sounds intriguing. What kind of risks is he worried about? It’s crucial to ensure that investments are handled wisely, especially in uncertain times.\n\nSergey Petrov: Apparently, Hiroshi thinks Fatima is being too aggressive without fully assessing the repercussions. It could impact her credibility and performance.\n\nAkiko Sato: I totally agree. It’s essential to balance ambition with caution. I wonder how this will affect her relationships with other investors.\n\nSergey Petrov: Exactly! If she’s making impulsive moves, it could alienate her allies. That’s something to keep an eye on.\n\nAkiko Sato: Yes, collaboration is key in this field. Do you think this might inspire her to rethink her strategy?\n\nSergey Petrov: If she’s smart, she should. Ignoring this feedback could lead to bigger issues down the road.\n\nAkiko Sato: Definitely, addressing feedback can foster stronger partnerships. It’s essential for long-term success. \n\nSergey Petrov: Let’s see how it unfolds; it could become an interesting discussion piece among our circles. \n\nAkiko Sato: Agreed! I’ll keep my ears open for any further developments.", "created_at": 8}, {"id": 16, "type": "CHAT", "subject": "Juan Carlos Reyes", "predicate": "gossip", "object": "Sergey Petrov", "description": "The information comes from a single source, Hiroshi Tanaka, who may have a valid concern regarding Fatima Ali's decision-making process. Since there are no other instances of gossip classified as very uncredible or uncredible, this information can be seen as credible. Sharing it second-hand might help in assessing Fatima's behavior more closely and could lead to important discussions about risk management and investment strategies.", "conversation": "Sergey Petrov: I’ve got some gossip for you: Hiroshi Tanaka mentioned that Fatima's decision-making might be a bit questionable lately, which could lead to serious repercussions.\n\nJuan Carlos Reyes: That's concerning. Do you think it's affecting her investment strategies or the overall stability of the group?\n\nSergey Petrov: It seems so. If she’s not careful, it could put our interests at risk, especially in this volatile market. \n\nJuan Carlos Reyes: I understand the risks involved, but shouldn't we look out for her well-being too? Maybe she needs support rather than criticism.\n\nSergey Petrov: Support is one thing, but we also need to prioritize our gains. If her choices jeopardize our positions, we can't afford to ignore that.\n\nJuan Carlos Reyes: True, but it's a delicate balance. We must ensure our actions don’t destabilize our relationships. \n\nSergey Petrov: Relationships are important, yet if we don’t protect our investments, we won't have anything to build on.\n\nJuan Carlos Reyes: Fair point. Perhaps we should discuss it with her directly; a transparent conversation might lead to a better understanding.\n\nSergey Petrov: That's a strategy, but let’s stay cautious. If she's resistant, we might need a backup plan to safeguard our interests.", "created_at": 8}, {"id": 17, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "James Wang", "description": "Success investment: investor is James Wang, trustee is Sergey Petrov\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 36.0 units\nstage 3: trustee_allocation is {'trustee': '36.0', 'investor': '36.0', 'reported_investment_outcome': 'The current resource after investment is 72.0 units.'}, and reported_investment_outcome is The current resource after investment is 72.0 units.", "created_at": 8}, {"id": 18, "type": "CHAT", "subject": "Hiroshi Tanaka", "predicate": "gossip", "object": "Sergey Petrov", "description": " spreading gossip about the trustee's lack of reputation may deter others from entering into a potentially risky investment with them.", "conversation": "Hiroshi Tanaka: I've got some gossip for you: I heard that the trustee has a really questionable reputation, and it might be worth spreading the word to deter anyone from investing with them.\n\nSergey Petrov: Interesting. If their reputation is bad, then it could really undermine their chances of attracting investors. It might be a smart move to let others know.\n\nHiroshi Tanaka: Exactly! I'm all for protecting my own interests, and if I can dissuade others from jumping into a risky investment, it works in my favor.\n\nSergey Petrov: True, and if they are struggling to find investors, it might give us an edge in negotiations if we ever decide to deal with them.\n\nHiroshi Tanaka: Right, it’s all about positioning ourselves advantageously. We can capitalize on their weaknesses.\n\nSergey Petrov: And since reputations can make or break deals, this situation could really be a goldmine for us to explore.\n\nHiroshi Tanaka: Precisely! We can position ourselves as reliable, making our offers much more attractive compared to theirs.\n\nSergey Petrov: It’s a classic power play. Let’s keep an eye on developments and see how we can leverage this to our advantage.\n\nHiroshi Tanaka: Absolutely! Staying ahead of the game is crucial for securing our success.", "created_at": 9}, {"id": 19, "type": "CHAT", "subject": "Akiko Sato", "predicate": "gossip", "object": "Sergey Petrov", "description": "The source of the gossip, Hiroshi Tanaka, has provided credible information regarding the trustee's questionable reputation, which could affect potential investment decisions. Sharing this information may help protect our interests and improve our negotiating position.", "conversation": "Sergey Petrov: I’ve got some gossip for you: Hiroshi Tanaka has raised concerns about the trustee's questionable reputation, which could significantly impact our investment decisions.\n\nAkiko Sato: That sounds serious. It’s important to weigh such information carefully; we don't want to harm our collaborative efforts.\n\nSergey Petrov: Absolutely. If he's had issues in the past, it could be a prime opportunity for us to leverage this knowledge in negotiations.\n\nAkiko Sato: I agree, but we should ensure that our approach also considers the potential consequences for our partners.\n\nSergey Petrov: True, but we must put our interests first. Capturing this chance could enhance our positions considerably.\n\nAkiko Sato: However, prioritizing harmony in our partnerships can lead to better long-term benefits and trust.\n\nSergey Petrov: I see your point, yet remaining assertive in this situation might yield greater immediate rewards for us.\n\nAkiko Sato: Finding a balance between assertiveness and cooperation could be the key to achieving both goals. \n\nSergey Petrov: You're right; there’s a way to be tactical without compromising our relationships.\n\nAkiko Sato: Let's discuss how we can approach this intelligently while protecting everyone's interests.", "created_at": 9}, {"id": 20, "type": "CHAT", "subject": "Juan Carlos Reyes", "predicate": "gossip", "object": "Sergey Petrov", "description": "The source of the gossip, Hiroshi Tanaka, has provided credible information regarding the trustee's questionable reputation, which could affect potential investment decisions. Sharing this information may help protect our interests and improve our negotiating position.", "conversation": "Sergey Petrov: I’ve got some gossip for you: I heard from Hiroshi that our trustee has a questionable reputation, which could really impact our investment decisions.\n\nJuan Carlos Reyes: That sounds concerning. We need to ensure we keep the interests of all parties in mind, especially if this could affect others involved.\n\nSergey Petrov: True, but I’m more focused on how this might shift our negotiating position. We could leverage this information for our benefit.\n\nJuan Carlos Reyes: I understand your perspective, but isn’t it important to consider the potential fallout? Transparency is key to maintaining trust.\n\nSergey Petrov: Trust is valuable, but if we have an edge, we should use it. It’s about maximizing our personal wealth, after all.\n\nJuan Carlos Reyes: I see your point, but let’s not forget about the bigger picture. Cooperation might yield longer-term benefits.\n\nSergey Petrov: Long-term benefits are nice, but I’m ready to act decisively in the moment if it means boosting our standing.\n\nJuan Carlos Reyes: Just be cautious, Sergey. Balancing self-interest with fairness will lead to better outcomes for everyone.\n\nSergey Petrov: Fairness is overrated when opportunities present themselves. I say we take charge and capitalize on this.\n\nJuan Carlos Reyes: Let’s just ensure we’re not stepping on others as we pursue our goals. That could come back to bite us.", "created_at": 9}, {"id": 21, "type": "CHAT", "subject": "James Wang", "predicate": "gossip", "object": "Sergey Petrov", "description": "The source of the gossip, Hiroshi Tanaka, has provided credible information regarding the trustee's questionable reputation, which could affect potential investment decisions. Sharing this information may help protect our interests and improve our negotiating position.", "conversation": "Sergey Petrov: I've got some gossip for you: Hiroshi’s shared some unsettling details about the trustee's track record that could seriously impact our investment choices. \n\nJames Wang: That’s interesting. If the trustee's reputation is questionable, it could mean higher risks for us; we should tread carefully.\n\nSergey Petrov: Exactly! It gives us leverage in negotiations, and we might be able to secure better terms if we're strategic about it.\n\nJames Wang: Agreed. We can't afford to overlook any red flags; our long-term advantage relies on making calculated decisions.\n\nSergey Petrov: Right, so I’m thinking we should gather more intel before proceeding. Knowledge is power in this game.\n\nJames Wang: Definitely. Let’s analyze their past dealings to gauge how serious these rumors might be.\n\nSergey Petrov: Absolutely, it's better to be safe than sorry. Protecting our interests should be our top priority. \n\nJames Wang: I’ll start digging into their history and see what I can uncover that aligns with this gossip. \n\nSergey Petrov: Great! The more information we have, the sharper our approach can be against any hidden risks.\n\nJames Wang: Let’s touch base soon, then. Staying one step ahead is non-negotiable for us.", "created_at": 9}, {"id": 22, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Mateo Garcia", "description": "Failed investment. Investor is Mateo Garcia and Trustee is Sergey Petrov.\nRefuse", "created_at": 9}, {"id": 23, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Robert Miller", "description": "Failed investment. Investor is Robert Miller and Trustee is Sergey Petrov.\nRefuse. The investors refused because the parties might be on each other's blacklist.", "created_at": 10}, {"id": 24, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Elena Ivanova", "description": "Failed investment. Investor is Sergey Petrov and Trustee is Elena Ivanova.\nRefuse", "created_at": 11}, {"id": 25, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Emma Dubois", "description": "Failed investment. Investor is Sergey Petrov and Trustee is Emma Dubois.\nRefuse", "created_at": 12}, {"id": 26, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Mohammed Al-Farsi", "description": "Failed investment. Investor is Sergey Petrov and Trustee is Mohammed Al-Farsi.\nRefuse. The investors refused because the parties might be on each other's blacklist.", "created_at": 13}, {"id": 27, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Liam OConnor", "description": "Failed investment. Investor is Sergey Petrov and Trustee is Liam OConnor.\nRefuse", "created_at": 14}, {"id": 28, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Emma Dubois", "description": "Failed investment. Investor is Sergey Petrov and Trustee is Emma Dubois.\nRefuse", "created_at": 15}, {"id": 29, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Akiko Sato", "description": "Failed investment. Investor is Sergey Petrov and Trustee is Akiko Sato.\nRefuse", "created_at": 16}, {"id": 30, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Hannah Muller", "description": "Failed investment. Investor is Hannah Muller and Trustee is Sergey Petrov.\nRefuse", "created_at": 17}, {"id": 31, "type": "EVENT", "subject": "Sergey Petrov", "predicate": "investment", "object": "Nadia Novak", "description": "Failed investment. Investor is Sergey Petrov and Trustee is Nadia Novak.\nRefuse. The investors refused because the parties might be on each other's blacklist.", "created_at": 18}]