{"Trustee_4_pre_2": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "content": "My reputation as a trustee has been significantly enhanced through my fair and responsible behavior during the investment process. By proposing a generous allocation plan that prioritized the investor's share at 70%, I exemplified trustworthiness and pro-sociality, fostering mutual benefit. The successful investment outcome and adherence to the distribution plan further solidified my reliability and competence, thus reinforcing my reputation as a trustworthy and effective trustee.", "numerical record": "(0, 0, 0, 0.3, 0.7)", "reason": "reputation update agter stage 4"}, "Trustee_4_pre_3": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "content": "My reputation as a trustee has further improved due to my unwavering commitment to transparency and adherence to the agreed allocation plan. By effectively managing the investment process and ensuring clear communication regarding profit distribution, I have established myself as a reliable and trustworthy trustee. This experience not only solidifies my competence but also demonstrates my strong relationships with investors, thereby enhancing my potential for securing future investments.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}, "Trustee_4_pre_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "content": "My reputation as a trustee continues to strengthen due to my steadfast commitment to transparency, fairness, and adherence to the agreed allocation plan throughout the investment process. My effective management of resources and prompt communication regarding profit distribution has reaffirmed my reliability and built trust amongst investors. This successful transaction not only emphasizes my competence but also reinforces my potential for establishing long-lasting relationships with future investors.", "numerical record": "(0, 0, 0, 0.1, 0.9)", "reason": "reputation update agter stage 4"}}