{"Investor_11": {"ID": 11, "scenario": "investment", "role": "investor", "name": "Aisha Ibrahim", "content": "I have maintained a strong reputation as a reliable and equitable investor, consistently demonstrating commitment to transparency, collaboration, and responsible resource management. My adherence to the agreed allocation plan and focus on ethical practices have fortified my standing in the investment community, fostering trust and emphasizing mutual success. This transaction further solidified my reputation for integrity and long-term potential.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_3": {"ID": 3, "scenario": "investment", "role": "trustee", "name": "Maria Rossi", "relationship": "positive", "content": "Maria demonstrated exceptional integrity and a pro-social attitude throughout the investment process. Her priority of ensuring a fair distribution of profits, even resulting in a greater share for the investor than originally proposed, showcases her commitment to enhancing investor wealth over personal gain. This altruistic behavior positions her as a trustworthy trustee with a strong potential for future partnerships.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia has proven to be a trustworthy and fair trustee throughout the investment process. By providing a favorable return that exceeded the outlined expectations, she demonstrated a commitment to the investor's best interests, enhancing her reputation for integrity and cooperation. Although she lacks previous reputation context, her actions indicate a strong potential for pro-social behavior, and I view her future dealings with optimism and confidence.", "numerical record": "(0, 0, 0, 0.3, 0.7)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "relationship": "negative", "content": "The trustee displayed a lack of honesty during the investment process, evidenced by discrepancies between the reported investment outcome and actual allocation. Despite favoring me as the investor, the inconsistency undermines the integrity and transparency expected in such transactions. Therefore, Sofia Hernandez's reputation remains questionable, with a critical need for improvement in her reliability and adherence to fair practices.", "numerical record": "(0.6, 0.2, 0.2, 0, 0)"}}