{"Trustee_18_pre_2": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "content": "Isabella Costa demonstrated excellent trustworthiness and competence throughout the investment process by proposing a fair allocation plan and achieving a 100% return on the investment. Her commitment to transparency and equitable distribution of profits reflects positively on her pro-sociality, fostering strong relationships with investors. As she had no prior rejections or negative encounters with investors, her reputation is now enhanced significantly.", "numerical record": "(0, 0, 0, 0.2, 0.8)", "reason": "reputation update agter stage 4"}, "Investor_18_pre_4": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Throughout the investment process, I exhibited high levels of trustworthiness and pro-sociality by ensuring transparency and alignment with the trustee's allocation plan. My ethical approach and commitment to mutual growth have solidified my reputation as a reliable investor in the community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_18_pre_5": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "During the investment process, I maintained a high level of ethical conduct, ensuring transparency and aligning my expectations with the trustee's proposed allocation plan. My strategic decision-making resulted in substantial profit, reinforcing my reputation as a trustworthy and reliable investor in the community. My dedication to mutual growth and equitable profit distribution has solidified my standing within the investment community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 4"}, "Investor_18_pre_6": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Throughout this investment process, I consistently exhibited a strong commitment to ethical conduct and transparency, aligning with the proposed allocation plan from the trustee. This proactive engagement contributed to maximizing my returns, thereby reinforcing my reputation as a reliable and trustworthy investor. I maintained a focus on mutual growth and equitable profit sharing within the investment community, solidifying my standing as a valued member.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 1"}, "Investor_18_pre_7": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "While I attempted to engage with a trustee regarding resource allocation, I prioritized ethical standards and transparency, reflected in my decision to reject the proposed allocation plan due to concerns over the trustee's reputation. This showcases my commitment to due diligence and safeguarding my investments, thus maintaining my reputation as a prudent investor who values trustworthiness and integrity.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)", "reason": "reputation update agter stage 1"}, "Trustee_0_pre_7": {"ID": 0, "scenario": "investment", "role": "trustee", "name": "Liam OConnor", "relationship": "positive", "content": "Liam demonstrated a strong commitment to integrity and fairness during the investment process. By adhering to the agreed terms and distributing profits consistently and equitably, he has established a reputation as a trustworthy and competent trustee, which enhances his credibility for future transactions.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)", "reason": "reputation update agter stage 1"}}