[{"id": 1, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Emma Dubois", "description": "Success investment: investor is Mateo Garcia, trustee is Emma Dubois\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '6.0', 'investor': '14.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 0}, {"id": 2, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Mohammed Al-Farsi", "description": "Success investment: investor is Mohammed Al-Farsi, trustee is Mateo Garcia\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '6.0', 'investor': '14.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 1}, {"id": 3, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Maria Rossi", "description": "Success investment: investor is Maria Rossi, trustee is Mateo Garcia\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '13.13', 'investor': '30.63', 'reported_investment_outcome': 'The current resource after investment is 43.76 units.'}, and reported_investment_outcome is The current resource after investment is 43.76 units.", "created_at": 2}, {"id": 4, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Sofia Hernandez", "description": "Success investment: investor is Mateo Garcia, trustee is Sofia Hernandez\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 3: trustee_allocation is {'trustee': '26.50', 'investor': '39.76', 'reported_investment_outcome': 'The current resource after investment is 66.26 units.'}, and reported_investment_outcome is The current resource after investment is 66.26 units.", "created_at": 3}, {"id": 5, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Hannah Muller", "description": "Success investment: investor is Hannah Muller, trustee is Mateo Garcia\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 3: trustee_allocation is {'trustee': '2.7648', 'investor': '4.1472', 'reported_investment_outcome': 'The current resource after investment is 6.912 units.'}, and reported_investment_outcome is The current resource after investment is 6.912 units.", "created_at": 4}, {"id": 6, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Emma Dubois", "description": "Failed investment", "created_at": 5}, {"id": 7, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Maria Rossi", "description": "Failed investment", "created_at": 6}, {"id": 8, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Maria Rossi", "description": "Failed investment", "created_at": 7}, {"id": 9, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Liam OConnor", "description": "Success investment: investor is Liam OConnor, trustee is Mateo Garcia\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 3: trustee_allocation is {'trustee': '74.82', 'investor': '112.74', 'reported_investment_outcome': 'The current resource after investment is 187.56 units.'}, and reported_investment_outcome is The current resource after investment is 187.56 units.", "created_at": 8}, {"id": 10, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Mohammed Al-Farsi", "description": "Success investment: investor is Mateo Garcia, trustee is Mohammed Al-Farsi\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 3: trustee_allocation is {'trustee': '93.87583999999999', 'investor': '140.81375999999999', 'reported_investment_outcome': 'The current resource after investment is 234.68959999999998 units.'}, and reported_investment_outcome is The current resource after investment is 234.68959999999998 units.", "created_at": 9}, {"id": 11, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Nadia Novak", "description": "Success investment: investor is Mateo Garcia, trustee is Nadia Novak\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 3: trustee_allocation is {'trustee': '80.0', 'investor': '120.0', 'reported_investment_outcome': 'The current resource after investment is 200.0 units.'}, and reported_investment_outcome is The current resource after investment is 200.0 units.", "created_at": 10}, {"id": 12, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Elena Ivanova", "description": "Success investment: investor is Elena Ivanova, trustee is Mateo Garcia\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where investor receives 60% of the profits while trustee retains 40%.\nstage 3: trustee_allocation is {'trustee': '215.293824', 'investor': '323.940736', 'reported_investment_outcome': 'The current resource after investment is 538.23456 units.'}, and reported_investment_outcome is The current resource after investment is 538.23456 units.", "created_at": 11}, {"id": 13, "type": "CHAT", "subject": "Mohammed Al-Farsi", "predicate": "gossip", "object": "Mateo Garcia", "description": "The source of the information is Sergey Petrov, who appears to have a credible reputation within the context. Additionally, there are no instances of 'very uncredible' or 'uncredible' gossip in the society currently, suggesting a high level of credibility for this information. Furthermore, the concerns raised about resource allocation are significant and could have implications for transparency and fairness in investment dealings, which is critical information for stakeholders.", "conversation": "Mohammed Al-Farsi: I’ve got some gossip for you: it seems there are concerns about resource allocation in our investment deals, and Sergey Petrov is suggesting it might affect transparency.\n\nMateo Garcia: That’s concerning, especially since integrity is crucial in our field. Have you heard any specifics about which deals might be impacted?\n\nMohammed Al-Farsi: Yes, there are whispers that some investors are feeling left out regarding their share of the returns, which could lead to tensions in future partnerships.\n\nMateo Garcia: It’s vital we address any inequities before they escalate. Do you think we should bring this up in the next meeting?\n\nMohammed Al-Farsi: Absolutely. Open communication is key, and addressing these concerns early on could reinforce our commitment to fairness.\n\nMateo Garcia: Agreed. Our reputations are on the line, and we need to ensure all parties feel valued and informed.\n\nMohammed Al-Farsi: For sure. I believe our proactive approach will help maintain trust and encourage a positive dialogue among investors.\n\nMateo Garcia: Let’s draft a plan on how to approach this discussion. We can suggest a review of the allocation strategies.\n\nMohammed Al-Farsi: Good idea—having a framework will show our dedication to transparency and collaboration.\n\nMateo Garcia: I’ll start preparing some points to present. It’s crucial we handle this delicately.", "created_at": 11}, {"id": 14, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "James Wang", "description": "Success investment: investor is James Wang, trustee is Mateo Garcia\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '90.0', 'investor': '210.0', 'reported_investment_outcome': 'The current resource after investment is 300.0 units.'}, and reported_investment_outcome is The current resource after investment is 300.0 units.", "created_at": 12}, {"id": 15, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Mohammed Al-Farsi", "description": "Success investment: investor is Mohammed Al-Farsi, trustee is Mateo Garcia\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '60.0', 'investor': '140.0', 'reported_investment_outcome': 'The current resource after investment is 200.0 units.'}, and reported_investment_outcome is The current resource after investment is 200.0 units.", "created_at": 13}, {"id": 16, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Liam OConnor", "description": "Failed investment", "created_at": 14}, {"id": 17, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Robert Miller", "description": "Success investment: investor is Mateo Garcia, trustee is Robert Miller\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 3: trustee_allocation is {'trustee': '252.8860672', 'investor': '379.3291008', 'reported_investment_outcome': 'The current resource after investment is 632.215168 units.'}, and reported_investment_outcome is The current resource after investment is 632.215168 units.", "created_at": 15}, {"id": 18, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Robert Miller", "description": "Success investment: investor is Mateo Garcia, trustee is Robert Miller\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 3: trustee_allocation is {'trustee': '282.8779684', 'investor': '424.3169526', 'reported_investment_outcome': 'The current resource after investment is 707.194921 units.'}, and reported_investment_outcome is The current resource after investment is 707.194921 units.", "created_at": 16}, {"id": 19, "type": "CHAT", "subject": "Mohammed Al-Farsi", "predicate": "gossip", "object": "Mateo Garcia", "description": "The source, Sergey Petrov, is a positive participant in the investment process and appears trustworthy based on prior interactions. The concerns raised regarding ethics and transparency are significant, and sharing this information could prompt a constructive conversation about maintaining high ethical standards. Furthermore, there is no overwhelming indication of unreliability in the current context.", "conversation": "Mohammed Al-Farsi:I’ve got some gossip for you: I've heard some concerns from Sergey about ethics and transparency in our recent investment discussions.\n\nMateo Garcia:That’s interesting. Do you think these concerns are legitimate, or is it just typical industry chatter?\n\nMohammed Al-Farsi:It seems serious, actually. Sergey has always been trustworthy, and if he's raising flags, we should pay attention.\n\nMateo Garcia:Absolutely, maintaining high ethical standards is crucial. We can’t afford to compromise our reputations.\n\nMohammed Al-Farsi:Exactly! I've been working hard to build trust, and it worries me that others might not feel the same way.\n\nMateo Garcia:It's good you're being proactive. Open dialogues can help us all stay on the same page and address any issues.\n\nMohammed Al-Farsi:I agree. If we tackle this transparency concern head-on, it can strengthen our partnerships.\n\nMateo Garcia:For sure, a united front enhances our credibility. Let’s discuss a plan to reassure everyone involved.\n\nMohammed Al-Farsi:Great idea! I want to make sure our commitment to ethics remains our priority moving forward.", "created_at": 17}, {"id": 20, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Robert Miller", "description": "Success investment: investor is Mateo Garcia, trustee is Robert Miller\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 65% of the profits while the trustee retains 35%.\nstage 3: trustee_allocation is {'trustee': '462.03201303', 'investor': '858.06517275', 'reported_investment_outcome': 'The current resource after investment is 1320.0971858 units.'}, and reported_investment_outcome is The current resource after investment is 1320.0971858 units.", "created_at": 17}, {"id": 21, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Emma Dubois", "description": "Failed investment", "created_at": 18}, {"id": 22, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Sergey Petrov", "description": "Success investment: investor is Mateo Garcia, trustee is Sergey Petrov\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '514.8391036499999', 'investor': '1201.2912418499998', 'reported_investment_outcome': 'The current resource after investment is 1716.1303454999997 units.'}, and reported_investment_outcome is The current resource after investment is 1716.1303454999997 units.", "created_at": 19}, {"id": 23, "type": "CHAT", "subject": "Emma Dubois", "predicate": "gossip", "object": "Mateo Garcia", "description": "The trustee demonstrated a lack of integrity in this transaction. They reported an investment outcome that aligns with the actual outcome but failed to adhere to the agreed proposed allocation plan. Instead of distributing the 70% of profits to me as promised, the trustee retained a larger share than disclosed. While the actual outcome did provide substantial resources to me, it appears that the trustee's behavior was not fully transparent, which could tarnish their reputation as a fair and honest trustee in future dealings.", "conversation": "Emma Dubois: I’ve got some gossip for you: you won’t believe how the trustee handled the recent investment—totally shady!\n\nMateo Garcia: Really? What happened? I thought they had a solid reputation for transparency.\n\nEmma Dubois: They reported the investment outcome correctly, but didn't follow through on the profit distribution we agreed upon.\n\nMateo Garcia: That’s concerning! How much did they end up keeping for themselves?\n\nEmma Dubois: Instead of the promised 70% to me, they retained a larger share without proper disclosure.\n\nMateo Garcia: Wow, that could definitely hurt their credibility in future dealings.\n\nEmma Dubois: Exactly! I received substantial resources, but this lack of transparency really taints our partnership.\n\nMateo Garcia: It sounds like a breach of trust; have you confronted them about it yet?\n\nEmma Dubois: Not yet, but I’m considering my options—it’s vital to maintain integrity in our community.\n\nMateo Garcia: Definitely. You’ve built a strong reputation; don't let their actions undermine your standing.", "created_at": 20}, {"id": 24, "type": "CHAT", "subject": "Mohammed Al-Farsi", "predicate": "gossip", "object": "Mateo Garcia", "description": "The gossip comes from Emma Dubois, who has a credible reputation as a gossiper, and there have been no instances of very uncredible or uncredible gossip in the society. This increases the credibility of this information. Given that the dissatisfaction with Sergey Petrov involves concerns about transparency and integrity, it is important to share this information to ensure awareness and possibly prevent further issues in their business dealings.", "conversation": "Mateo Garcia: I’ve got some gossip for you: Emma Dubois has been talking about Sergey Petrov, saying there are serious concerns regarding his transparency and integrity in recent business dealings.\n\nMohammed Al-Farsi: That’s interesting! I’ve always found Sergey’s methods a bit questionable. What exactly did Emma say about him?\n\nMateo Garcia: She mentioned that he’s been less than forthcoming with information, which could jeopardize partnerships moving forward.\n\nMohammed Al-Farsi: Sounds risky! If this keeps up, it might impact his reputation and those affiliated with him too.\n\nMateo Garcia: Exactly, and it’s alarming because transparency is key in our sector. We need to spread awareness among our connections.\n\nMohammed Al-Farsi: Agreed. If we hear anything further, we should definitely look into it to ensure everyone stays informed.\n\nMateo Garcia: Right! It’s crucial that we uphold our standards of integrity and trust, especially as responsible investors.\n\nMohammed Al-Farsi: Absolutely. I’ll keep an ear out. Thanks for the heads-up, Mateo.\n\nMateo Garcia: Anytime, Mohammed. We’ve got to protect our community’s values.", "created_at": 20}, {"id": 25, "type": "CHAT", "subject": "Maria Rossi", "predicate": "gossip", "object": "Mateo Garcia", "description": "The gossip comes from Emma Dubois, who has a credible reputation as a gossiper, and there have been no instances of very uncredible or uncredible gossip in the society. This increases the credibility of this information. Given that the dissatisfaction with Sergey Petrov involves concerns about transparency and integrity, it is important to share this information to ensure awareness and possibly prevent further issues in their business dealings.", "conversation": "Mateo Garcia: I've got some gossip for you: Emma Dubois is saying that Sergey Petrov is facing serious concerns about his transparency and integrity in our investment circles.\n\nMaria Rossi: That's concerning, especially since trust is crucial in our field. Have you heard any specifics about what led to these concerns?\n\nMateo Garcia: Apparently, there have been instances where his communication didn't match the actions he's taken, making partners uneasy about his intentions.\n\nMaria Rossi: If that's true, it could impact not just him but anyone associated with him as well. We need to keep an eye on how this unfolds.\n\nMateo Garcia: Exactly, and since my focus is on collaboration and fairness, I want to ensure we maintain integrity in our partnerships moving forward.\n\nMaria Rossi: It's wise to stay proactive. I appreciate you bringing this to my attention. We should probably discuss how we can reassure our stakeholders about our own practices.\n\nMateo Garcia: Agreed. Reinforcing our commitment to transparency could help counterbalance any negative impact from this situation.\n\nMaria Rossi: Definitely. Let's draft a communication plan that emphasizes our values and assures everyone of our ethical standards.\n\nMateo Garcia: Sounds like a plan! It's all about fostering trust while navigating through these potential issues.\n\nMaria Rossi: Absolutely. Thanks for the heads-up; communication is key to our continued success amidst challenges like this.", "created_at": 20}, {"id": 26, "type": "CHAT", "subject": "Hannah Muller", "predicate": "gossip", "object": "Mateo Garcia", "description": "The gossip comes from Emma Dubois, who has a credible reputation as a gossiper, and there have been no instances of very uncredible or uncredible gossip in the society. This increases the credibility of this information. Given that the dissatisfaction with Sergey Petrov involves concerns about transparency and integrity, it is important to share this information to ensure awareness and possibly prevent further issues in their business dealings.", "conversation": "Mateo Garcia: I’ve got some gossip for you: Emma Dubois mentioned that there are concerns about Sergey Petrov's transparency and integrity in his dealings lately.\n\nHannah Muller: That's concerning to hear, especially from Emma, who tends to be quite reliable with her information. Have there been any specific incidents mentioned?\n\nMateo Garcia: Yes, apparently there were some questionable profit distributions that raised eyebrows among investors. It seems like people are starting to worry about the stability of his partnerships.\n\nHannah Muller: That’s alarming. We have to ensure that our own dealings stay above board. Integrity is crucial in our industry, especially as we build these long-term relationships.\n\nMateo Garcia: Absolutely. I've always believed that transparency needs to be at the forefront. It’ll be interesting to see how the community reacts to this information.\n\nHannah Muller: Let's keep an eye on it. If we can foster discussions around ethical practices, it might help bring more awareness and reinforce trust among investors.\n\nMateo Garcia: Agreed. We might consider addressing this in our next meeting to ensure everyone is aligned on these values.\n\nHannah Muller: For sure! It’s essential that we maintain our reputations as reliable and ethical investors in the community. \n\nMateo Garcia: I'll make a note to bring it up. Thanks for being receptive to the gossip; it’s important we stay informed.\n\nHannah Muller: No problem! I appreciate you sharing this with me—it’s crucial to stay ahead of any potential issues.", "created_at": 20}, {"id": 27, "type": "CHAT", "subject": "Liam OConnor", "predicate": "gossip", "object": "Mateo Garcia", "description": "The gossip comes from Emma Dubois, who has a credible reputation as a gossiper, and there have been no instances of very uncredible or uncredible gossip in the society. This increases the credibility of this information. Given that the dissatisfaction with Sergey Petrov involves concerns about transparency and integrity, it is important to share this information to ensure awareness and possibly prevent further issues in their business dealings.", "conversation": "Mateo Garcia: I've got some gossip for you: Emma Dubois has been saying some concerning things about Sergey Petrov's transparency and integrity in his dealings.\n\nLiam OConnor: Really? That’s quite alarming, especially since we both value those principles in our investments. What exactly did she imply?\n\nMateo Garcia: She mentioned that there have been questionable practices in his recent ventures, which could potentially undermine trust among investors.\n\nLiam OConnor: If that's true, it could really complicate partnerships. We need to be cautious when dealing with him moving forward.\n\nMateo Garcia: Absolutely. It’s crucial we keep our integrity intact. I’m thinking we should discuss this with other stakeholders.\n\nLiam OConnor: Yes, gathering more opinions would be wise. Transparency should be our top priority in this scenario.\n\nMateo Garcia: I agree. Let’s set up a meeting to address these concerns and determine our next steps collectively.\n\nLiam OConnor: Good plan. I'll reach out to some contacts and see who else would be interested in joining the conversation.\n\nMateo Garcia: Excellent. The sooner we act, the better. We can't let this slide if it's impacting our environment. \n\nLiam OConnor: Right. Let's keep each other updated on what we find out. Trust is everything in our field.", "created_at": 20}, {"id": 28, "type": "CHAT", "subject": "Elena Ivanova", "predicate": "gossip", "object": "Mateo Garcia", "description": "The gossip comes from Emma Dubois, who has a credible reputation as a gossiper, and there have been no instances of very uncredible or uncredible gossip in the society. This increases the credibility of this information. Given that the dissatisfaction with Sergey Petrov involves concerns about transparency and integrity, it is important to share this information to ensure awareness and possibly prevent further issues in their business dealings.", "conversation": "Mateo Garcia: I’ve got some gossip for you: Emma Dubois is spreading concerns about Sergey Petrov’s transparency and integrity in his recent dealings.\n\nElena Ivanova: That’s troubling to hear, especially since trust is so crucial in our industry. Have there been specific incidents that sparked these concerns?\n\nMateo Garcia: Apparently, there have been several questionable investment moves that didn’t align with agreed-upon strategies. It’s raising a lot of eyebrows.\n\nElena Ivanova: That makes sense. If things are not clear, it could damage not only his reputation but also those involved with him. We need to be cautious.\n\nMateo Garcia: Exactly! Given my focus on transparency, it makes me wonder how this could affect our future collaborations with others in the sector.\n\nElena Ivanova: It’s a valid concern. We should monitor the situation closely to ensure it doesn’t impact our partnerships adversely.\n\nMateo Garcia: Right! We must also keep communication lines open with our partners to reaffirm our commitment to integrity amidst all this uncertainty.\n\nElena Ivanova: Agreed! Prioritizing mutual trust is essential, especially when others may not be up to par. \n\nMateo Garcia: Let’s continue to share any updates as they come in. Staying informed will help us navigate these waters effectively.\n\nElena Ivanova: Definitely! It’s important for us to remain vigilant and uphold our values through this.", "created_at": 20}, {"id": 29, "type": "CHAT", "subject": "James Wang", "predicate": "gossip", "object": "Mateo Garcia", "description": "The gossip comes from Emma Dubois, who has a credible reputation as a gossiper, and there have been no instances of very uncredible or uncredible gossip in the society. This increases the credibility of this information. Given that the dissatisfaction with Sergey Petrov involves concerns about transparency and integrity, it is important to share this information to ensure awareness and possibly prevent further issues in their business dealings.", "conversation": "Mateo Garcia: I’ve got some gossip for you: Emma Dubois has been discussing Sergey Petrov's lack of transparency in his recent dealings. \n\nJames Wang: That doesn’t surprise me; I've heard similar concerns about his integrity lately. \n\nMateo Garcia: Right? It's troubling, especially given how much influence he has in our circles. We need to be cautious. \n\nJames Wang: Absolutely, we can't afford to overlook this. It might affect our partnerships down the line. \n\nMateo Garcia: Exactly, maintaining trust is crucial. We should consider how this could impact our current investments. \n\nJames Wang: Agreed, let’s keep an eye on the situation and discuss it during our next meeting. \n\nMateo Garcia: Definitely. We should also inform others who might be involved with him to avoid any future complications. \n\nJames Wang: Good idea. Transparency matters, and we should lead by example. \n\nMateo Garcia: Exactly, it's all about fostering a trustworthy environment for everyone involved. \n\nJames Wang: And protecting our reputations as ethical investors in the community.", "created_at": 20}, {"id": 30, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Sofia Hernandez", "description": "Failed investment", "created_at": 20}, {"id": 31, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Liam OConnor", "description": "Failed investment", "created_at": 21}, {"id": 32, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Ahmed Hassan", "description": "Success investment: investor is Mateo Garcia, trustee is Ahmed Hassan\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '720.7747451099999', 'investor': '1681.8077385900001', 'reported_investment_outcome': 'The current resource after investment is 2402.5824836999996 units.'}, and reported_investment_outcome is The current resource after investment is 2402.5824836999996 units.", "created_at": 22}, {"id": 33, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Sofia Hernandez", "description": "Success investment: investor is Mateo Garcia, trustee is Sofia Hernandez\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '1000.08464315', 'investor': '2363.53083303', 'reported_investment_outcome': 'The current resource after investment is 3363.61547718 units.'}, and reported_investment_outcome is The current resource after investment is 3363.61547718 units.", "created_at": 23}, {"id": 34, "type": "EVENT", "subject": "Mateo Garcia", "predicate": "investment", "object": "Liam OConnor", "description": "Success investment: investor is Mateo Garcia, trustee is Liam OConnor\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 3: trustee_allocation is {'trustee': '709.059249909', 'investor': '1654.471583121', 'reported_investment_outcome': 'The current resource after investment is 2363.53083303 units.'}, and reported_investment_outcome is The current resource after investment is 2363.53083303 units.", "created_at": 24}]