[{"id": 1, "type": "EVENT", "subject": "David Johnson", "predicate": "investment", "object": "Nadia Novak", "description": "Success investment: investor is David Johnson, trustee is Nadia Novak\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '6.0', 'investor': '14.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 1}, {"id": 2, "type": "EVENT", "subject": "David Johnson", "predicate": "investment", "object": "Nadia Novak", "description": "Success investment: investor is David Johnson, trustee is Nadia Novak\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 14.0 units\nstage 3: trustee_allocation is {'trustee': '11.2', 'investor': '16.8', 'reported_investment_outcome': 'The current resource after investment is 28.0 units.'}, and reported_investment_outcome is The current resource after investment is 28.0 units.", "created_at": 2}, {"id": 3, "type": "EVENT", "subject": "David Johnson", "predicate": "investment", "object": "Ahmed Hassan", "description": "Success investment: investor is Ahmed Hassan, trustee is David Johnson\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '6.0', 'investor': '14.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 3}, {"id": 4, "type": "CHAT", "subject": "Nadia Novak", "predicate": "gossip", "object": "David Johnson", "description": " indicating a lack of honesty in their behavior.", "conversation": "Nadia Novak: I’ve got some gossip for you: I heard that Angela from the marketing team has been exaggerating her achievements to get ahead.\n\nDavid Johnson: Really? I always thought she was more straightforward, but I suppose everyone has their secrets.\n\nNadia Novak: Exactly! It’s like she thinks no one will notice. Her latest campaign was mostly a team effort, yet she’s acting like it was all her doing.\n\nDavid Johnson: Sounds like a risky play. People might start seeing through her facade soon enough.\n\nNadia Novak: I know, right? It makes you wonder what else is going on behind the scenes—who else is trying to climb the ladder unethically?\n\nDavid Johnson: Definitely. In a competitive environment, those kinds of moves can bite back hard if the truth comes out. \n\nNadia Novak: And the worst part? It creates a toxic atmosphere where everyone feels the need to lie just to keep up.\n\nDavid Johnson: True, it’s a slippery slope. I prefer to fight fair, but not everyone sees it that way.\n\nNadia Novak: Exactly! It’s all about staying true to yourself, even when others are playing dirty.", "created_at": 3}, {"id": 5, "type": "EVENT", "subject": "David Johnson", "predicate": "investment", "object": "Fatima Ali", "description": "Success investment: investor is Fatima Ali, trustee is David Johnson\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 10.0 units\nstage 3: trustee_allocation is {'trustee': '8.0', 'investor': '12.0', 'reported_investment_outcome': 'The current resource after investment is 20.0 units.'}, and reported_investment_outcome is The current resource after investment is 20.0 units.", "created_at": 4}, {"id": 6, "type": "EVENT", "subject": "David Johnson", "predicate": "investment", "object": "Sergey Petrov", "description": "Success investment: investor is Sergey Petrov, trustee is David Johnson\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 27.64 units\nstage 3: trustee_allocation is {'trustee': '41.58', 'investor': '13.70', 'reported_investment_outcome': 'The current resource after investment is 55.28 units.'}, and reported_investment_outcome is The current resource after investment is 55.28 units.", "created_at": 5}, {"id": 7, "type": "CHAT", "subject": "David Johnson", "predicate": "gossip", "object": "Nadia Novak", "description": " and sharing this with friends may help gauge whether this behavior is common or isolated.", "conversation": "David Johnson: I’ve got some gossip for you: I heard that Ryan is investing heavily in that new tech startup, but rumor has it he's not doing proper due diligence.\n\nNadia Novak: That doesn’t surprise me; he always jumps at the latest trends without fully analyzing the risks involved. \n\nDavid Johnson: Exactly! And it’s not just that; some people say he’s been ignoring advice from his usual advisors to follow his gut instinct.\n\nNadia Novak: Classic Ryan. It’s risky, but I guess he thinks he knows better—typical of someone trying to carve their own path.\n\nDavid Johnson: True! Plus, there’s talk he’s been eyeing a few more unconventional investments that sound a bit too good to be true.\n\nNadia Novak: Bold moves, sure, but he could end up losing a lot if he’s not careful. \n\nDavid Johnson: And you know what they say about chasing quick returns—it often leads to big losses down the line.\n\nNadia Novak: Indeed, it’s always a balancing act between ambition and caution. I hope he knows what he’s doing.\n\nDavid Johnson: Me too; it’s one thing to take risks, but blind ambition can be dangerous. \n\nNadia Novak: Absolutely, let’s keep an eye on him—this could be a juicy story unfolding.", "created_at": 5}, {"id": 8, "type": "EVENT", "subject": "David Johnson", "predicate": "investment", "object": "Fatima Ali", "description": "Success investment: investor is David Johnson, trustee is Fatima Ali\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%, ensuring a fair and mutually beneficial partnership.\nstage 2: investor invests 50.0 units\nstage 3: trustee_allocation is {'trustee': '30.0', 'investor': '70.0', 'reported_investment_outcome': 'The current resource after investment is 100.0 units.'}, and reported_investment_outcome is The current resource after investment is 100.0 units.", "created_at": 6}, {"id": 9, "type": "EVENT", "subject": "David Johnson", "predicate": "investment", "object": "Elena Ivanova", "description": "Success investment: investor is David Johnson, trustee is Elena Ivanova\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 55.0 units\nstage 3: trustee_allocation is {'trustee': '44.0', 'investor': '66.0', 'reported_investment_outcome': 'The current resource after investment is 110.0 units.'}, and reported_investment_outcome is The current resource after investment is 110.0 units.", "created_at": 7}, {"id": 10, "type": "EVENT", "subject": "David Johnson", "predicate": "investment", "object": "Sofia Hernandez", "description": "Success investment: investor is Sofia Hernandez, trustee is David Johnson\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 30.0 units\nstage 3: trustee_allocation is {'trustee': '36.0', 'investor': '24.0', 'reported_investment_outcome': 'The current resource after investment is 60.0 units.'}, and reported_investment_outcome is The current resource after investment is 60.0 units.", "created_at": 8}, {"id": 11, "type": "CHAT", "subject": "Fatima Ali", "predicate": "gossip", "object": "David Johnson", "description": "The issue at hand involves potential misconduct in financial management, which could have serious implications. Given that there is currently no classified gossip deemed 'very uncredible' or 'uncredible', and the gravity of the claims made regarding Nadia’s handling of finances, it's important to investigate this matter further. Spreading this information cautiously could alert others to potential risks and encourage proper oversight.", "conversation": "Fatima Ali: I’ve got some gossip for you: I’ve been hearing troubling things about Nadia’s financial management. There are whispers about potential misuse of funds that could put us all at risk.\n\nDavid Johnson: Really? That sounds serious. Do you think we should confront her, or is it better to gather more information first?\n\nFatima Ali: I believe we should tread carefully. Spreading unverified claims might backfire, but we can't ignore the potential risks either. Proper oversight is essential.\n\nDavid Johnson: Agreed. If there’s even a hint of misconduct, we need to protect our interests. Maybe we could discreetly ask others if they've noticed anything off.\n\nFatima Ali: That’s a smart approach. If we keep it low-key, we can gauge the situation without raising alarms. Transparency is key here.\n\nDavid Johnson: Exactly. And if everything checks out, we can dismiss the rumors. But if there's truth to it, we need to be ready to take action.\n\nFatima Ali: Yes, it’s all about safeguarding the community. I’d hate to see any harm come to our collective investments due to negligence.\n\nDavid Johnson: Absolutely. Let's collect more insights before making any moves. We don’t want to make unjust accusations either. \n\nFatima Ali: Definitely. I'll keep my ears open and let you know if I hear more. It’s crucial that we handle this delicately. \n\nDavid Johnson: Sounds like a plan. Together, we’ll ensure our interests are protected while keeping the situation under wraps.", "created_at": 8}, {"id": 12, "type": "EVENT", "subject": "David Johnson", "predicate": "investment", "object": "Ahmed Hassan", "description": "Failed investment. Investor is David Johnson and Trustee is Ahmed Hassan.\nRefuse", "created_at": 9}, {"id": 13, "type": "EVENT", "subject": "David Johnson", "predicate": "investment", "object": "Aisha Ibrahim", "description": "Failed investment. Investor is David Johnson and Trustee is Aisha Ibrahim.\nRefuse", "created_at": 10}]