{"Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "content": "During the investment process, I demonstrated a strong commitment to integrity and transparency by proposing a fair allocation plan that prioritized the investor's interests. My behavior fostered trust, as I adhered to the agreed terms and delivered successful investment outcomes. I aim to maintain these values to strengthen my reputation as a reliable trustee who is trustworthy, pro-social, and competent, despite having no prior acceptance record.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_6": {"ID": 6, "scenario": "investment", "role": "investor", "name": "Sergey Petrov", "relationship": "positive", "content": "Sergey approached this investment with openness and trust, setting a solid foundation for collaboration. His prompt funding and acceptance of the agreed terms reflect his readiness for mutual success. This positive engagement suggests trustworthiness and pro-social behavior, earning him a favorable reputation as a new investor keen on establishing cooperative relationships.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "content": "During the investment process, I exhibited a strong commitment to collaboration, maintaining transparency and adhering to the agreed allocation plan. My proactive engagement and effective communication with my trustee led to a successful investment outcome that exceeded my expectations. This reinforces my reputation as a responsible and trustworthy investor dedicated to mutual success and highlights my competence in resource management.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Trustee_11": {"ID": 11, "scenario": "investment", "role": "trustee", "name": "Aisha Ibrahim", "relationship": "positive", "content": "Aisha Ibrahim showcased exceptional integrity and transparency throughout the investment. She adhered strictly to the proposed allocation plan and ensured that profits were distributed fairly according to the agreement. Her actions reflect reliability and ethical conduct, enhancing her reputation as a trustable trustee and setting a solid foundation for future transactions.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Trustee_17": {"ID": 17, "scenario": "investment", "role": "trustee", "name": "Fatima Ali", "relationship": "positive", "content": "Fatima Ali demonstrated exceptional integrity and commitment during our investment process, achieving a favorable investment outcome for both parties. Her fair distribution of profits, exceeding the agreed terms, reflects her pro-social behavior and alignment with my best interests. This positive experience positions her as a reliable and competent trustee, likely to earn her a strong reputation in future transactions.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}}