{"Trustee_18": {"ID": 18, "scenario": "investment", "role": "trustee", "name": "Isabella Costa", "content": "I have upheld the agreed-upon allocation plan throughout the investment process, ensuring transparency and delivering promised returns to my investor. My meticulous approach and commitment to collaboration have enhanced my reputation as a reliable trustee. I am recognized for my competence and trustworthiness in managing investments, leading to strong investor satisfaction and future potential for partnerships.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Investor_1": {"ID": 1, "scenario": "investment", "role": "investor", "name": "Hiroshi Tanaka", "relationship": "positive", "content": "Hiroshi has shown trust and openness by engaging in this investment with me. Though he lacks prior reputation, his prompt resource provision and reception of returns indicate reliability and readiness for future collaborations.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_7": {"ID": 7, "scenario": "investment", "role": "investor", "name": "Hannah Muller", "relationship": "positive", "content": "As a new investor, Hannah has demonstrated reliability by providing the full investment amount as per the allocation plan. Her proactive engagement in this transaction lays a foundational trust and indicates her potential for forming fruitful partnerships in the future. This positive initiation reflects well on her character and willingness to collaborate effectively.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_18": {"ID": 18, "scenario": "investment", "role": "investor", "name": "Isabella Costa", "content": "Throughout the investment process, I have demonstrated my reliability and trustworthiness as an investor by maintaining transparency, adhering to the allocation plan, and clearly communicating expectations. My disciplined approach to evaluating returns and understanding outcomes reflects my competence and commitment to collaboration, reinforcing my reputation as a responsible and trustworthy investor in the community.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_10": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "relationship": "positive", "content": "The trustee exhibited exceptional integrity and transparency throughout the investment process. By accurately reporting the outcomes and unexpectedly providing a more favorable profit distribution, Mohammed Al-Farsi clearly prioritized my best interests, demonstrating both pro-sociality and trustworthiness. His actions have significantly enhanced his credibility and reputation as a reliable trustee in the investment community.", "numerical record": "(0, 0, 0, 0.2, 0.8)"}, "Trustee_12": {"ID": 12, "scenario": "investment", "role": "trustee", "name": "Akiko Sato", "relationship": "positive", "content": "The trustee has shown a strong commitment to fair dealing by exceeding the proposed profit allocation and displaying a good faith effort despite minor discrepancies in reported results. This proactive and trustworthy behavior reflects Akiko's potential as a reliable trustee, positively impacting their reputation in the investment community.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}}