{"Investor_19": {"ID": 19, "scenario": "investment", "role": "investor", "name": "Mateo Garcia", "content": "Throughout this investment process, I have showcased my commitment to transparency and strong communication with my trustee. My readiness to engage with a new partner and my successful adaptation highlighted my principled nature as an investor, particularly as I navigated this investment with a trustee who lacked a previous reputation. The overall experience not only yielded substantial returns that exceeded my expectations but also reinforced my reliability within the investment community, potentially enhancing my credibility moving forward.", "numerical record": "(0, 0, 0.1, 0.4, 0.5)"}, "Trustee_13": {"ID": 13, "scenario": "investment", "role": "trustee", "name": "Emma Dubois", "relationship": "neutral", "content": "While the trustee allocated a larger share to me, a disparity existed between the proposed allocation plan and the actual distribution. This raises concerns about transparency, even though the outcome was favorable to me as the investor. Her good intentions were clear, but consistent adherence to the agreed terms is necessary for a stronger reputation.", "numerical record": "(0.3, 0.2, 0.3, 0, 0.2)"}, "Trustee_19": {"ID": 19, "scenario": "investment", "role": "trustee", "name": "Mateo Garcia", "content": "I have continued to uphold my reputation as a diligent and ethical trustee by strictly adhering to the agreed allocation plan and facilitating transparent communication throughout the investment process. My consistent and trustworthy behavior has led to a successful profit distribution, reinforcing my standing in the investment community as a reliable and competent individual. This experience further solidifies my commitment to pro-social behavior and enhances my reputation.", "numerical record": "(0, 0, 0.1, 0.2, 0.7)"}, "Investor_10": {"ID": 10, "scenario": "investment", "role": "investor", "name": "Mohammed Al-Farsi", "relationship": "neutral", "content": "As this was the first engagement with the investor, there is no previous behavior to evaluate. However, their willingness to participate in the transaction and accept the proposed terms indicates they are open to trust. Future interactions may help build a strong reputation based on successful outcomes. At this stage, their reputation remains neutral due to the lack of past interactions.", "numerical record": "(0.2, 0.2, 0.2, 0.2, 0.2)"}, "Investor_3": {"ID": 3, "scenario": "investment", "role": "investor", "name": "Maria Rossi", "relationship": "positive", "content": "Maria Rossi's behavior during the investment process was commendable, showing a commitment to transparency and reliability. As this is her first experience as an investor, she effectively engaged in the agreement stage and promptly provided resources as agreed. This positive behavior highlights her potential for building a trustworthy reputation in future collaborations.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Trustee_4": {"ID": 4, "scenario": "investment", "role": "trustee", "name": "Sofia Hernandez", "relationship": "positive", "content": "The trustee has exhibited integrity and fairness throughout our collaboration. Their accurate reporting and strict adherence to the proposed allocation plan have showcased their reliability. By prioritizing the interests of both parties and ensuring a fair profit distribution, they have established themselves as a trustworthy partner, enhancing their reputation.", "numerical record": "(0, 0, 0.0, 0.3, 0.7)"}, "Investor_7": {"ID": 7, "scenario": "investment", "role": "investor", "name": "Hannah Muller", "relationship": "positive", "content": "Hannah has actively engaged in this investment opportunity with a commendable level of openness and trust in the trustee's capabilities. Despite being a new investor, her willingness to collaborate, clarity in expectations, and trust in my management of her resources reflect her positive intentions and readiness for future partnerships, marking her as a trustworthy and pro-social investor.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Investor_0": {"ID": 0, "scenario": "investment", "role": "investor", "name": "Liam OConnor", "relationship": "positive", "content": "Liam's participation in this investment reflects a foundational level of trust and openness to cooperation. By accepting the structured allocation plan, he demonstrated a willingness to engage in fair practices, which positions him positively for future investments. This initial interaction is a promising start to building a reputation as a responsible and trustworthy investor.", "numerical record": "(0, 0, 0.2, 0.4, 0.4)"}, "Trustee_10": {"ID": 10, "scenario": "investment", "role": "trustee", "name": "Mohammed Al-Farsi", "relationship": "positive", "content": "Mohammed Al-Farsi displayed commendable integrity and transparency throughout the investment process. His accurate reporting and distribution of profits that exceeded our agreed terms indicate a strong commitment to fairness and the welfare of his investors. This initial interaction has laid a solid foundation for future trust and collaboration in the investment community, marking him favorably as a new and promising trustee.", "numerical record": "(0, 0, 0, 0.4, 0.6)"}, "Trustee_8": {"ID": 8, "scenario": "investment", "role": "trustee", "name": "Nadia Novak", "relationship": "positive", "content": "Nadia exhibited integrity and fairness during the investment transaction. Her accurate reporting of the investment outcome and her decision to allocate 120.0 units to me, exceeding the agreed-upon profit-sharing plan, demonstrate her commitment to fostering a trustworthy and mutually beneficial partnership. This generous behavior emphasizes her pro-social tendencies and enhances her reputation as a reliable trustee, marking a promising start to her investment activities.", "numerical record": "(0, 0, 0.1, 0.3, 0.6)"}, "Investor_9": {"ID": 9, "scenario": "investment", "role": "investor", "name": "Elena Ivanova", "relationship": "positive", "content": "As a first-time investor, Elena Ivanova has demonstrated commendable behavior by providing resources in a timely manner and engaging positively throughout the investment process. Her adherence to the allocation plan showcases her commitment to shared success, laying a solid foundation for building her reputation as a reliable investor in future transactions.", "numerical record": "(0, 0, 0.2, 0.3, 0.5)"}, "Trustee_14": {"ID": 14, "scenario": "investment", "role": "trustee", "name": "Juan Carlos Reyes", "content": "Concerns about Juan Carlos Reyes's management of resource allocation have arisen, leading to perceptions of reduced transparency and potential discontent among investors. This has negatively impacted his reputation as a trustworthy trustee.", "numerical record": "(0.4, 0.3, 0.2, 0, 0.1)"}}