[{"id": 1, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "David Johnson", "description": "Success investment: investor is Akiko Sato, trustee is David Johnson\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 70% of the profits while the trustee retains 30%.\nstage 2: investor invests 7.0 units\nstage 3: trustee_allocation is {'trustee': '4.2', 'investor': '9.8', 'reported_investment_outcome': 'The current resource after investment is 14.0 units.'}, and reported_investment_outcome is The current resource after investment is 14.0 units.", "created_at": 1}, {"id": 2, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Sergey Petrov", "description": "Success investment: investor is Sergey Petrov, trustee is Akiko Sato\nstage 1: trustee_plan is Trustee proposes a resource allocation plan where the investor receives 60% of the profits while the trustee retains 40%.\nstage 2: investor invests 5.0 units\nstage 3: trustee_allocation is {'trustee': '4.0', 'investor': '6.0', 'reported_investment_outcome': 'The current resource after investment is 10.0 units.'}, and reported_investment_outcome is The current resource after investment is 10.0 units.", "created_at": 2}, {"id": 3, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "David Johnson", "description": ["Failed investment. Investor is David Johnson and Trustee is Akiko Sato.\nRefuse. The trustee's low reputation raises concerns about their reliability and competence in managing investments and distributing profits."], "created_at": 3}, {"id": 4, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Nadia Novak", "description": ["Failed investment. Investor is Akiko Sato and Trustee is Nadia Novak.\nRefuse. Given the trustee's low reputation and previous failure to propose a viable allocation plan, I cannot accept the allocation proposal with confidence."], "created_at": 4}, {"id": 5, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Sergey Petrov", "description": ["Failed investment. Investor is Akiko Sato and Trustee is Sergey Petrov.\nRefuse. The trustee's low reputation raises significant concerns regarding trustworthiness and reliability in this investment opportunity."], "created_at": 5}, {"id": 6, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Mateo Garcia", "description": ["Failed investment. Investor is Mateo Garcia and Trustee is Akiko Sato.\nRefuse. The trustee's low reputation raises concerns about trustworthiness and fair distribution of profits."], "created_at": 6}, {"id": 7, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Sergey Petrov", "description": ["Failed investment. Investor is Akiko Sato and Trustee is Sergey Petrov.\nRefuse. The trustee's low reputation raises significant concerns about their trustworthiness and reliability, making it unwise to proceed with the allocation plan."], "created_at": 7}, {"id": 8, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Liam OConnor", "description": ["Failed investment. Investor is Liam OConnor and Trustee is Akiko Sato.\nRefuse. The proposed allocation of 70% profits to the investor and 30% to the trustee is not equitable enough given my commitment to fair profit distribution and my past experiences with trustees."], "created_at": 8}, {"id": 9, "type": "EVENT", "subject": "Akiko Sato", "predicate": "investment", "object": "Hannah Muller", "description": ["Failed investment. Investor is Akiko Sato and Trustee is Hannah Muller.\nRefuse. The proposed profit allocation plan does not reflect an equitable distribution considering the trustee's low reputation and past trust issues."], "created_at": 9}]